[{"id":"dsq-645750980","author":"JLP","deleted":false,"createdAt":"2012-05-12T02:59:28Z","message":"<p>If the text is already short enough for other parts of the GUI and you only need to make it even shorter for displaying it next to icon in toolbar button, then you can also use the setIconText() function.</p>","replies":[{"id":"dsq-645750985","author":"Aurélien","deleted":false,"createdAt":"2012-05-12T11:37:14Z","message":"<p>Right, very good point.</p>","replies":[{"id":"dsq-645751000","author":"Aurélien","deleted":false,"createdAt":"2012-05-12T16:23:31Z","message":"<p>Not however that explicitly setting the tooltip is still a good idea because of the difference of capitalization between menu items and tooltips.</p>","replies":[]}]}]},{"id":"dsq-645750979","author":"JanKusanagi","deleted":false,"createdAt":"2012-05-12T03:32:47Z","message":"<p>As with the other 4 parts, great post :D</p><p>I also hate when the tooltip is the same as the button text, specially for my mother, who is learning (no previous computer experience) and finds the tooltips useful.</p>","replies":[]},{"id":"dsq-645750981","author":"labatts","deleted":false,"createdAt":"2012-05-12T03:58:47Z","message":"<p>\"So the “View” button is about… “View”! Thank you Captain Obvious! (This is fixed for 4.9)\".</p><p>DId you shorten the text to just \"vi\"?</p>","replies":[{"id":"dsq-645750988","author":"Aurélien","deleted":false,"createdAt":"2012-05-12T11:39:29Z","message":"<p>No :) I replaced it with \"View one image\"... not really the best idea I came up with but at least it is not a mere repetition. I need to find a better tooltip though, especially since you can now view more than one image in \"View\" mode.</p>","replies":[{"id":"dsq-645750989","author":"StuieT","deleted":false,"createdAt":"2012-05-12T13:24:14Z","message":"<p>Why not change it to \"View image(s)\".</p>","replies":[{"id":"dsq-645751006","author":"Aurélien","deleted":false,"createdAt":"2012-05-12T22:38:31Z","message":"<p>That would be more precise, but I don't like using parenthesis. Thanks for your suggestion nevertheless.</p>","replies":[]}]},{"id":"dsq-645751002","author":"gumb","deleted":false,"createdAt":"2012-05-12T16:35:40Z","message":"<p>\"View selected images\" ?</p>","replies":[{"id":"dsq-645751005","author":"Aurélien","deleted":false,"createdAt":"2012-05-12T22:37:55Z","message":"<p>I changed the tooltip to use your suggestion, thanks!</p>","replies":[]}]}]}]},{"id":"dsq-645750983","author":"Ionut Colceriu","deleted":false,"createdAt":"2012-05-12T12:49:05Z","message":"<p>Another issue in toolbars is that some buttons should be toggle buttons, when they are regular buttons right now.</p><p>More exactly, for example the \"Find\" button in Dolphin should definitely be a toggle button, since it toggles the visibility of the find toolbar. The \"Preview\" button, next to \"Find\" is a correctly implemented toggle button.<br>The same issue applies to a lot of another apps.</p><p>I think a \"Papercuts\"-like project to find and report issues like these would be really great for the KDE ecosystem.</p>","replies":[{"id":"dsq-645750998","author":"Aurélien","deleted":false,"createdAt":"2012-05-12T16:22:33Z","message":"<p>Yes, I agree. A papercut-like project may happen at some point (hint, hint!)</p>","replies":[]},{"id":"dsq-645751010","author":"ppenz","deleted":false,"createdAt":"2012-05-13T02:51:59Z","message":"<p>&gt; More exactly, for example the “Find” button in Dolphin should definitely be<br>&gt; a toggle button, since it toggles the visibility of the find toolbar</p><p>I tried to keep the Find-behaviour in Dolphin consistent with the other applications like e.g. KWrite:<br>- Pressing Ctrl+F activates the find-mode<br>- Pressing Ctrl+F on an already active find-mode assures getting back the keyboard-focus<br>- Pressing Escape or the close button deactivates the find-mode</p><p>So currently it is no toggle-button on purpose, however I'm not sure whether this is really better than a toggle-button (at least in the scope of Dolphin)</p>","replies":[]}]},{"id":"dsq-645750990","author":"Stéphane Péchard","deleted":false,"createdAt":"2012-05-12T13:34:15Z","message":"<p>Such a post should be added in KDE official UI guidelines, and maybe a pair-review process inside KDE should let \"experienced\" developers of the platform help others to conform on such guidelines? If we're more extremist, we can even think that KDE should not accept software that do not conform to these guidelines...</p>","replies":[]},{"id":"dsq-645750994","author":"Kevin Kofler","deleted":false,"createdAt":"2012-05-12T15:40:38Z","message":"<p>I think it was a mistake to show text by default in the first place. It's one of the first settings I change (and the next is to add lots of buttons to the toolbar which are not there by default, e.g., my Okular has: Open, Print, |, Back, Forward, |, Beginning of document, Previous page, Next page, End of document, |, Zoom dropdown, Zoom out, Zoom in, |, Navigation, Lens, Selection).</p>","replies":[{"id":"dsq-645751007","author":"Aurélien","deleted":false,"createdAt":"2012-05-13T00:38:24Z","message":"<p>To each his own, I would say. I think this choice helped us to simplify our applications. It's nice that you still have the option to customize applications your own way.</p>","replies":[]}]},{"id":"dsq-645750974","author":"brillaint kde","deleted":false,"createdAt":"2012-05-14T17:41:18Z","message":"<p>interesting topic <br><a href=\"http://forum.kde.org/viewtopic.php?f=226&amp;t=101206\" rel=\"nofollow noopener\" title=\"http://forum.kde.org/viewtopic.php?f=226&amp;t=101206\">http://forum.kde.org/viewto...</a></p>","replies":[]},{"id":"dsq-645750977","author":"Happy Heyoka","deleted":false,"createdAt":"2012-05-16T14:20:57Z","message":"<p>I hope that nobody confuses \"too many items\" with \"too many pixels\" as the meaning for \"big toolbars\"...</p><p>I still love my trinitron crt because I can do 1920x1440 (bigger if I want to drop the scan rate).  The out-of-the box size for toolbar fonts and icons is way too small; for me the best use of those pixels is for better text and icons.  With 32 pixel icons in a toolbar it takes about 3% of the vertical height of my display.</p><p>I'm sure that as display technology turns full circle again (eg: the high density display in the new iPad) that people will want this setup again... so I would add a common mistake of my own: Failure to test with other than the default font and icon sizes.  By all means make sure your app scales to work on an 800x600 phone, but make sure it copes with a high density display too.</p><p>Totally agree with text only buttons and informative tooltips.</p>","replies":[]}]