[{"id":"dsq-645751071","author":"Àlex Fiestas","deleted":false,"createdAt":"2012-08-06T03:37:26Z","message":"<p>I hope the other rippers will catchup on the topic soon enough (k9copy).</p><p>Also, why didn't you download the rip already? you already bought the dvd after all :s</p>","replies":[{"id":"dsq-645751189","author":"Aurélien","deleted":false,"createdAt":"2012-08-06T11:39:26Z","message":"<p>Unfortunately k9copy is dead: <a href=\"http://k9copy.sourceforge.net/web/index.php/en/nouveautes/12-theend\" rel=\"nofollow noopener\" title=\"http://k9copy.sourceforge.net/web/index.php/en/nouveautes/12-theend\">http://k9copy.sourceforge.n...</a> :(</p><p>I tried downloading the rip but I couldn't find it in French (kids do not speak english yet). Furthermore you usually cannot find the extra short movies from the bonus section. The kids are fond of the 2 extra movies which come with Cars 2 DVD.</p>","replies":[]}]},{"id":"dsq-645751074","author":"Martin Owens","deleted":false,"createdAt":"2012-08-06T09:24:17Z","message":"<p>I ripped my entire DVD collection last year, 128 discs using handbreak (and 12 computers all in parallel). I've basically got the process of ripping all the discs in mkv, with sub titles, multiple audio tracks (for anime and foreign dubs) with good sizes and quick codecs. I tried a few programs, but handbreak just seems to be a very good system.</p><p>Now about these 99 titles, when I see these, I run the DVD through vlc and find the title that the menu would play and then grab that one. Now all my movies and TV run through xbmc really nicely.</p><p>Do we have an Ubuntu multimedia club to talk about these kinds of things?</p>","replies":[{"id":"dsq-645751190","author":"Aurélien","deleted":false,"createdAt":"2012-08-06T11:42:39Z","message":"<p>12 computers all in parallel, wow! Now that's a professional ripping setup :)</p><p>I did exactly what you said regarding the 99 titles: played the DVD with vlc, note the title number.</p><p>Thinking a bit more about my experience, I probably would have known about HandBrake, had it been in Ubuntu archives. I assume the fact it ships with its own copies of many libs is the reason why it is not there.</p>","replies":[]}]},{"id":"dsq-645751067","author":"Anaximander","deleted":false,"createdAt":"2012-08-06T09:37:36Z","message":"<p>I personally use handbrake and makemkv under linux for ripping my dvds and blurays for use with my dlna server. While makemkv ist not free it does a good job not only on blurays but also on most dvds. For now it seems there's only one (Mad about you, Season1) which I can't rip at all.</p>","replies":[{"id":"dsq-645751082","author":"Martin Owens","deleted":false,"createdAt":"2012-08-06T12:58:56Z","message":"<p>handbreak can make mkvs and the mkv tools in ubuntu (mmv etc) are very good.</p><p>Also useful is avidemux which does a nice job of converting sub/vob titles into srt subtitles, useful for then combining into the mkv for real nice looking titles in xbmc.</p>","replies":[]}]},{"id":"dsq-645751055","author":"John","deleted":false,"createdAt":"2012-08-06T09:48:59Z","message":"<p>See this is a perfect example of how copyrighting and DRM do very little to protect anything and do everything to make the consumers wallet lighter. Too bad you didn't know about hand brake; it's indeed fantastic, but thanks to your story I'm sure you prevented more unnecessary capitalism by others unfortunate enough to be under a similar set of circumstances...kudos!</p>","replies":[{"id":"dsq-645751192","author":"Aurélien","deleted":false,"createdAt":"2012-08-06T11:43:52Z","message":"<p>Yes, that's one of the reason I wrote that: I hope if someone search the Internet for \"cars 2 dvd rip\", he will find this article and give HandBrake a try.</p>","replies":[]}]},{"id":"dsq-645751058","author":"Roger","deleted":false,"createdAt":"2012-08-06T09:58:46Z","message":"<p>What I do is just copy the entire DVD as is.  This does take more space since you aren't transcoding, but it means you keep all the special features, menus etc.  It also only takes about 10 minutes.  You just need to use lsdvd or similar to list the disc contents which will then enable the correct CSS descrambling.</p>","replies":[{"id":"dsq-645751085","author":"Aurélien","deleted":false,"createdAt":"2012-08-06T11:45:35Z","message":"<p>I prefer to have individual files (I also rip the short movies separately) because it is easier for the kids to navigate the movie collection through XBMC, which provide a consistent interface rather than having then learn their way in each DVD menus.</p>","replies":[]}]},{"id":"dsq-645751062","author":"gaboo","deleted":false,"createdAt":"2012-08-06T10:49:04Z","message":"<p>I am not against paying for software and culture either, but honestly, I wouldn't have spent 40€ (!!) euros to copy a DVD. It's in the french law after all. I'm so tired of that.</p><p>Nowdays we can buy mp3 from google play or amazon for what is fair prices to me. I can take them with me anywhere any devices. The movie industry needs to understand we need this for movies/series... too.</p><p>That said, I will try those tools, last time I needed something like that I failed to find something working! Thanks !=</p>","replies":[]},{"id":"dsq-645751061","author":"Digitalus","deleted":false,"createdAt":"2012-08-06T11:10:54Z","message":"<p>The only thing that will stop those copyrestriction extremists is to stop buying DRM-ed stuff, and that is exactly what I did. If it's got DRM I sure don't encourage more DRM by rewarding such evil corporations with more money for it. In this case I just get myself illegal copy without restrictions. I only pay the good guys these days which don't take away our rights with DRM.</p>","replies":[{"id":"dsq-645751084","author":"Aurélien","deleted":false,"createdAt":"2012-08-06T11:54:13Z","message":"<p>The problem is: you can't really know when buying from Amazon if there is any extra protection such as ARccOS. So unless you just don't buy DVD at all, it is like playing Russian roulette.</p>","replies":[]}]},{"id":"dsq-645751048","author":"Mark","deleted":false,"createdAt":"2012-08-06T11:39:22Z","message":"<p>I bought this on the weekend and found handbrake on Linux would crash. It worked on my wife's Mac though.<br>I always rip them to put on my xbmc system because it is sooo much more convenient than using the dvd. Wish you could buy non-drm digital copies.</p>","replies":[{"id":"dsq-645751188","author":"Aurélien","deleted":false,"createdAt":"2012-08-06T11:56:37Z","message":"<p>I agree, XBMC is much nicer to use than having to fiddle with DVDs. Especially the way 2-years old handle DVDs tend to shorten their life for some reason...</p>","replies":[]}]},{"id":"dsq-645751050","author":"Mauro","deleted":false,"createdAt":"2012-08-06T12:01:35Z","message":"<p>Handbreak is a good software but, unfortunately, in the last versions there is no more avi (divx/xvid) support. So I can't use it with my home players.</p><p>With wine or using a Windows VM, you can use \"DVDFab HD Decrypter\" (<a href=\"http://www.dvdfab.com/free.htm)\" rel=\"nofollow noopener\" title=\"http://www.dvdfab.com/free.htm)\">http://www.dvdfab.com/free....</a>.</p>","replies":[{"id":"dsq-752577836","author":"Don Giovanni","deleted":false,"createdAt":"2013-01-01T15:31:39Z","message":"<p>Personally, I wouldn't use avi, divx/xvid. MKV is a far better container, and h264 is better for compression. You should be able to find a decent media box that plays these</p>","replies":[]}]},{"id":"dsq-645751075","author":"Grant Phillips-Sewell","deleted":false,"createdAt":"2012-08-06T12:38:27Z","message":"<p>I found that i could watch these movies using VLC - thus also told me which of the 99 titles i should be ripping with dvdbackup.</p>","replies":[]},{"id":"dsq-645751028","author":"anonymous","deleted":false,"createdAt":"2012-08-07T06:23:01Z","message":"<p>Maybe this is also a lesson about Disney and what the movies represent and not just a DRM issue.</p><p>See for example who was/is the biggest shareholder:<br><a href=\"http://news.yahoo.com/steve-jobs-4-6b-disney-shares-trust-231858505.html\" rel=\"nofollow noopener\" title=\"http://news.yahoo.com/steve-jobs-4-6b-disney-shares-trust-231858505.html\">http://news.yahoo.com/steve...</a></p><p>I would be careful what I show to my children. Disney has also been involved in propaganda (e.g. WWII) and has a very conservative perspective to society.</p>","replies":[{"id":"dsq-645751030","author":"Aurélien","deleted":false,"createdAt":"2012-08-07T16:32:06Z","message":"<p>I am careful about what I show to my children. I usually watch movies and cartoons with them anyway. DVD is not a way to get some free time for me: it is another way to spend time with my kids.</p>","replies":[]},{"id":"dsq-645751032","author":"Martin Owens","deleted":false,"createdAt":"2012-08-07T17:28:28Z","message":"<p>Disney are a bit of a paradox, their company is so perversely evil, yet the culture they teach ultimately is a how to guide for standing up to people, er like Disney.</p>","replies":[{"id":"dsq-645751037","author":"Aurélien","deleted":false,"createdAt":"2012-08-07T18:06:46Z","message":"<p>Heh, that is very true!</p>","replies":[]}]}]},{"id":"dsq-645751078","author":"m_abs","deleted":false,"createdAt":"2012-08-07T14:52:04Z","message":"<p>I've a similar problem with an \"Angels and demons\" DVD, unfortunately HandBrake (at least the version in Fedora 17) can't handle it.</p>","replies":[]},{"id":"dsq-645751043","author":"Lazza","deleted":false,"createdAt":"2012-08-07T20:28:22Z","message":"<p>Probably you should have asked your readers vefore buying the software, looks like some of us already knew HandBrake. ;) BTW ssssh don't tell to your kids you used a proprietary software, it's not a good example to teach. :P</p>","replies":[{"id":"dsq-645751047","author":"Aurélien","deleted":false,"createdAt":"2012-08-08T01:18:21Z","message":"<p>No need to hide anything, I did not end up using the Windows application: I ripped the DVD with HandBrake.</p>","replies":[{"id":"dsq-645751053","author":"Lazza","deleted":false,"createdAt":"2012-08-08T12:51:13Z","message":"<p>Yes I was just kidding, no offence intended. ;) BTW in my opinion HandBrake deserve a place in the USC, it's a very good application!</p>","replies":[{"id":"dsq-645751194","author":"Aurélien","deleted":false,"createdAt":"2012-08-08T13:20:53Z","message":"<p>Oups, looks like I forgot the smiley. Don't worry I didn't take offence :)</p>","replies":[]}]}]}]},{"id":"dsq-645751088","author":"fsdfgbd","deleted":false,"createdAt":"2012-08-08T21:47:14Z","message":"<p>Personally I would have downloaded the movie, we all know it's online somewhere and you already supported the creators (and all the other parasites above them) by paying for your copy.</p><p>I don't really watch movies, but I've been downloading old games I bought years ago.<br>I don't have a cd/dvd drive since broadband arrival (and awesome online markets like steam :D). <br>I'm not going to waste money buying one of those things.</p><p>Screw dvds and packages, they're just bad for the environment.</p>","replies":[{"id":"dsq-645751094","author":"Aurélien","deleted":false,"createdAt":"2012-08-08T23:35:09Z","message":"<p>Problem is: it's difficult to find movies in French, and you don't get the bonuses.</p>","replies":[]}]},{"id":"dsq-752584268","author":"Don Giovanni","deleted":false,"createdAt":"2013-01-01T15:38:37Z","message":"<p>I got all excited the first time a DVD came with a digital copy. I thought hey this is great. I don't have to rip this for my media box.. Ummmm... what a horrible thing... DRM and THEY decide what it will play on AND for how long. Don't buy anything with a DIGITAL COPY. </p>","replies":[]},{"id":"dsq-752585745","author":"Don Giovanni","deleted":false,"createdAt":"2013-01-01T15:40:16Z","message":"<p>HandBrake is not a DVD-ripper. It uses external programs/libraries to do that. That's why Windoze Handbrake isn't very useful. </p>","replies":[]}]