[{"id":"dsq-457710658","author":"Stefan Majewsky","deleted":false,"createdAt":"2009-09-18T15:41:13Z","message":"<p>Nice writing. I hope to not mess up the terms: From what I know, KNotificationItem is the next generation of \"QSystemTrayIcon\", and this is obviously not matching the functionality that an indicator display needs.</p><p>Still, I fail to see why we can't use the existing extenders in Plasma's system tray for that, where those notifications appear (those for file transfers etc.)</p><p>You say: \"Indicators are a way to get permanent informations, rather than ephemeral ones like notifications.\"</p><p>So put some \"permanent\" flag in the notification spec and you're done. If you need more features, the Plasma team has worked on notifications for around half a year, which was plenty of time for you to coordinate development with them. Wouldn't this have saved you quite some work?</p>","replies":[{"id":"dsq-457710663","author":"Aurélien","deleted":false,"createdAt":"2009-09-18T16:26:10Z","message":"<p>\"Still, I fail to see why we can’t use the existing extenders in Plasma’s system tray for that, where those notifications appear (those for file transfers etc.)\"</p><p>I think it would look quite huge if presented as extenders. Can you imagine the attached screenshot represented as extenders? if you add let's say 3 KMail folders it would become really tall.</p><p>\"You say: “Indicators are a way to get permanent informations, rather than ephemeral ones like notifications.”</p><p>So put some “permanent” flag in the notification spec and you’re done.\"</p><p>It's not only about permanent versus ephemeral. The main missing part is that there is no server/indicator structure in the notification system, meaning it's impossible to represent a main item (the application) and its sub items (the indicators).</p><p>\"the Plasma team has worked on notifications for around half a year, which was plenty of time for you to coordinate development with them. Wouldn’t this have saved you quite some work?\"</p><p>libindicate is roughly one year old (first commit was on the 29th of October, 2008 and this probably happened after some upfront design work). I only had to build a Qt binding for it and a plasmoid.</p><p>I do not think it would have been faster to integrate the necessary changes to Plasma (assuming they would be accepted), implement a GNOME equivalent and port existing libindicate-enabled applications to use it instead.</p>","replies":[]}]},{"id":"dsq-457710657","author":"Markus","deleted":false,"createdAt":"2009-09-18T15:57:43Z","message":"<p>Do you provide binaries for other distributions? Right now I don't see the point of indicators, but if I try it myself, I may think different.</p>","replies":[{"id":"dsq-457710660","author":"Aurélien","deleted":false,"createdAt":"2009-09-18T16:08:33Z","message":"<p>No we don't. We only provide source tarballs and patches for existing applications.</p>","replies":[{"id":"dsq-457710687","author":"Markus","deleted":false,"createdAt":"2009-09-20T01:27:47Z","message":"<p>Then use Build Service to create binaries for a wide range of distros.</p>","replies":[]}]}]},{"id":"dsq-457710656","author":"alf","deleted":false,"createdAt":"2009-09-18T16:59:33Z","message":"<p>I think this makes things easier and organized... But I'd like it to be integrated with systray indicator(the icon with \"i\" letter) so I can have one place to go when I missed something. So when I click the \"i\" icon there would two categories:one for communications, and the onther one is for other categories...</p>","replies":[{"id":"dsq-457712133","author":"Aurélien","deleted":false,"createdAt":"2009-09-18T17:15:34Z","message":"<p>This can probably be worked out, but the (i) icon is part of the systemtray plasmoid, so getting indicators integrated in this would require integration of indicators in Plasma. Unfortunately, this does not seem very likely to happen for now.</p>","replies":[]}]},{"id":"dsq-457710654","author":"alf","deleted":false,"createdAt":"2009-09-18T17:04:10Z","message":"<p>That's why I made the comment above is because the UI of your indicator will overlap or will be covered with the notifcation bubbles in case you click it and then a notification bubble comes out...</p>","replies":[]},{"id":"dsq-457710652","author":"mycroft","deleted":false,"createdAt":"2009-09-18T17:23:12Z","message":"<p>As a kubuntu user under karmic, I had no idea up until now why I had lost Kopete notifications. (I am not sure that I ever had them under KDE 4.0 though)</p><p>Now I realize that to get \"notifications\" (in a broad sense, I understand the difference between notification and indication even if it is tenuous) from all my applications, I do not only need a systray, but a systray AND something else.</p><p>This is really confusing. I have no idea how a non-tech user who is not reading planet KDE is going to guess that after the upgrade to Karmic you need to add a new indicator plasmoid.</p><p>IIRC during upgrade, the desktop configuration is not modified, you need a clean install if you want to use the new default desktop.</p>","replies":[{"id":"dsq-457710664","author":"Aurélien","deleted":false,"createdAt":"2009-09-18T17:56:46Z","message":"<p>You don't need to add an indicator plasmoid to get Kopete notifications. Indicator support in Kopete is implemented as a plugin, and it does not disable notifications.</p>","replies":[]}]},{"id":"dsq-457710667","author":"mycroft","deleted":false,"createdAt":"2009-09-18T18:04:53Z","message":"<p>Thanks for your reply.</p><p>So something else is wrong with my kopete settings. I'll try to find out what it is.</p>","replies":[]},{"id":"dsq-457710668","author":"mat69","deleted":false,"createdAt":"2009-09-18T18:54:29Z","message":"<p>I like that concept. :)</p><p>I have experienced very often that I miss pings etc. in irc (konversation marks the tabs red, so that helps me then), mails in kmail etc. simply because I'm not there at the point when the notifications are displayed and no having them constantly on would not be a solution but rather a waste of space (imo they use too much space atm anyway).</p><p>So as mentioned I miss a lot of stuff and the workaround atm is to switch to all the apps where I could have missed stuff and check if I actually missed something. As it appears your tool is the solution to my problem.</p>","replies":[]},{"id":"dsq-457710671","author":"Martin Gräßlin","deleted":false,"createdAt":"2009-09-18T19:28:53Z","message":"<p>There are a few things I do not like about the Plasmoid: first of all that it is a Plasmoid. In my opinion it should be in the systray and autohidden when there are no new messages. I don't need a prominent indicator showing me that I have no new messages. The way it is now it's just taking away even more space from the panel for things I normaly don't want to see (like the battery plasmoid and the device notifier - both fixed in 4.4).</p><p>Then I think there is a design mistake - not done by you but done by the developers who did the indicator. Emails, instant messaging and IRC and three completely different topics and they do not have anything in common (except that it is communication). When I'm using instant messaging I want a notification at once as it is instant, while I normaly ignore mails till I decide when to reply to them. That's why I think having one indicator for all kinds of communication is just wrong. I think the right approach would have been to use the new possibilities of the systray and provide the information directly in the KMail icon or in the Kopete and Quassel icon. That is extending the current state by providing more information.</p><p>Last but not least I think using an email icon for the plasmoid is not the right icon as the indicator is for all communication. And I think the difference of the icons for no new message and new message is not strong enough</p>","replies":[{"id":"dsq-457712135","author":"Aurélien","deleted":false,"createdAt":"2009-09-18T19:44:47Z","message":"<p>\"In my opinion it should be in the systray and autohidden when there are no new messages.\"</p><p>I understand this problem. As you said, it is possible in KDE 4.4 to embed a plasmoid in the systray, which will help reduce the space taken by this plasmoid, unfortunately it does not work with KDE 4.3.</p><p>As for autohiding it, the problem I see with this is that a user adding the plasmoid to a panel will see nothing, which feels wrong. An idea could be to make it only a few pixels wide (or tall depending on the containment orientation) so that it does not waste too much space.</p><p>\"Emails, instant messaging and IRC and three completely different topics and they do not have anything in common (except that it is communication). When I’m using instant messaging I want a notification at once as it is instant, while I normaly ignore mails till I decide when to reply to them.\"</p><p>I agree. But keep in mind that you still have IRC notifications showing up. It's also worth noting that it is up to the application to decide whether it should turn the \"draw_attention\" flag of their indicators, causing the plasmoid to change its icon.<br>For example, right now KMail shows the count of unread messages in selected folders but does not turn the \"draw_attention\" flag for them, so the indicator won't turn on when you get a new message. You can imagine that it could get smarter in the future, and turn the flag on when a message arrives in a specific folder, or from a specific sender.<br>The advantage of having this plasmoid over one icon per application in the system tray is that it reduce the clutter in said system tray.</p><p>\"Last but not least I think using an email icon for the plasmoid is not the right icon as the indicator is for all communication. And I think the difference of the icons for no new message and new message is not strong enough\"</p><p>Yes, the icon is not really adapted, I agree. In fact the (i) icon in the system tray is quite nice, but using two (i) icons is probably not a good idea...</p>","replies":[{"id":"dsq-457712140","author":"Aaron Seigo","deleted":false,"createdAt":"2009-09-18T20:22:00Z","message":"<p>\"In fact the (i) icon in the system tray is quite nice, but using two (i) icons is probably not a good idea…\"</p><p>there's no reason we couldn't put a \"message\" icon next to it, however. the system tray already supports putting entries there, you just need to set the appropriate Status.</p><p>so 'i' for information and $SOMETHING for messags; sounds sensible. the messages icon could come and go if the user wishes.</p><p>moreover, that messages icon could show only when there are messaging apps running and could amalgamate all the \"messaging\" notification items.</p><p>that would eliminate the overlap between, e.g., kopete's system tray icon and providing indications.</p><p>and it doesn't need a separate library or a separate system to accomplish it. you'd also stand a reasonable chance to get such patches upstreamed.</p>","replies":[]}]}]},{"id":"dsq-457710673","author":"Aaron Seigo","deleted":false,"createdAt":"2009-09-18T20:17:43Z","message":"<p>the entire problem with this is, as i've said before both privately to various people involved as well as publicly  as time has gone on and it becomes increasingly apparent that the idea is to stay the course vs try to collaborate, is that it's Yet Another Unneeded System.</p><p>there's another library to learn to use and load at runtime.</p><p>there's another system to attach our applications to.</p><p>there's another UI concept that we need to rationalize with the system tray and tasks widget.</p><p>you say \"it might make sense to merge this with the new notification item system\", and you're absolutely right. not only does it make sense, it was designed to allow for such things! the entire POINT of the new system is to break out from useless icons that can not be managed or integrated or sorted and turn them into houses for application status and information that can be presented in any number of ways.</p><p>instead, what you've managed to accomplish is a bunch of patches to apps to support this new library that isn't common at all yet and to make app devs scratch their heads wondering when to use this or when to use the system tray or ...</p><p>app devs should NOT have to care about this kind of stuff. they should have ONE place to sink their data and the VISUALIZATION(S) should determine how to sort it out.</p><p>thus imho, as it stands, this indicator library is broken in its design. the intentions are good, but the implementation is awry. but it can be fixed.</p><p>i've mentioned this a few times to people working on these things @ Canonical over the course of many months. but i end up asking myself: is there really any interest in doing things better, or should i save us all the hassle and begin ignoring ayatana as a fork-producing downstream project?</p>","replies":[{"id":"dsq-457710677","author":"gp","deleted":false,"createdAt":"2009-09-18T21:43:42Z","message":"<p>I'm totally agree with you.<br>The idea is good but the way to achieve this it it right?<br>Totally agree with you.</p><p>giuseppe</p>","replies":[]},{"id":"dsq-457712137","author":"Aurélien","deleted":false,"createdAt":"2009-09-19T01:58:02Z","message":"<p>\"it becomes increasingly apparent that the idea is to stay the course vs try to collaborate\"</p><p>Depends on what you mean with \"collaborate\".</p><p>Assuming you agree that in its current state KNotificationItem does not make it possible to implement what indicators do, how should we collaborate?</p><p>I can only imagine two solutions:</p><p>- We throw away our working implementation (which predates KNotificationItem) and extend KNotificationItem to meet our needs, adding the concept of Indicators as children of KNotificationItem.</p><p>- You rebase KNotificationItem on top of libindicate. NotificationItems can be represented as libindicate servers, using the server type to match NotificationItem categories. libindicate Server concept would have to be extended to provide a few more properties.</p>","replies":[{"id":"dsq-457712142","author":"notmart","deleted":false,"createdAt":"2009-09-19T23:39:02Z","message":"<p>at the moment it can't do -exactly- that, yeah, but the machinery is almost there.<br>protocol-wise all is needed is probably a new property, with a data structure with that info, like (boss:2, joe:5) and a signal that tells it's changed,<br>then how to do a proper visualization for that is just a secondary (and changeable any time) matter..</p>","replies":[{"id":"dsq-457712144","author":"Aurélien","deleted":false,"createdAt":"2009-09-20T13:51:33Z","message":"<p>It's a bit more involved: an indicator can have any number of properties (see the list of predefined ones in my blog) and can emit a signal when it is activated.</p><p>Therefore I don't think the indicators of a server can be reduced to a property dictionary. An indicator must be a first class DBus object IMO.</p>","replies":[]}]},{"id":"dsq-457712143","author":"Markus","deleted":false,"createdAt":"2009-09-20T01:25:28Z","message":"<p>I didn't see much involvement of Canonical when the new notification specs were developed for KDE 4.2, so your \"predates\" argument is not really valid, because Canonical had the chance to join the process when the time was right.</p>","replies":[{"id":"dsq-457712617","author":"Aurélien","deleted":false,"createdAt":"2009-09-20T13:46:26Z","message":"<p>The first commit in KDE svn for KNotificationItem is from the <a href=\"http://websvn.kde.org/?view=rev&amp;revision=928646\" rel=\"nofollow noopener\" title=\"http://websvn.kde.org/?view=rev&amp;revision=928646\">19th of February 2009</a>, so I doubt this was in for KDE 4.2.</p><p>Furthermore, Aaron mentions in <a href=\"http://aseigo.blogspot.com/2009/07/plasma-in-kde-44.html\" rel=\"nofollow noopener\" title=\"http://aseigo.blogspot.com/2009/07/plasma-in-kde-44.html\">this post</a> that the spec has been in use since KDE 4.3.</p>","replies":[{"id":"dsq-457712622","author":"J Janz","deleted":false,"createdAt":"2009-09-21T18:12:36Z","message":"<p>Well, so that means it *is* possible to implement this as suggested after all, since karmic will use 4.3. That means new chance to do things in a more well designed manner, which is a better desktop for Kubuntu and, by flowing on KDE's course, collaborates with KDE as a whole.</p>","replies":[{"id":"dsq-457712625","author":"Aurélien","deleted":false,"createdAt":"2009-09-22T11:19:23Z","message":"<p>Indicators could be implemented with the NotificationItem spec, provided the spec integrates the necessary features.</p><p>It is not possible in the current state of the spec.</p>","replies":[]}]}]}]}]}]},{"id":"dsq-457710674","author":"G2g591","deleted":false,"createdAt":"2009-09-18T20:57:28Z","message":"<p>One small correction for you: Arch Linux isn't source based (Though its quite easy to grab the source if you want to change build options or what not)</p><p>Other than that seems quite interesting and I look forward to seeing this in action in the future</p>","replies":[{"id":"dsq-457710692","author":"Aurélien","deleted":false,"createdAt":"2009-09-20T23:33:13Z","message":"<p>I mentioned Arch Linux because I have been talking with an Arch Linux packager who complained about this build-time dependency. When I said it was not a problem for people using binary packages, he told me lots of users were building from source.</p>","replies":[]}]},{"id":"dsq-457710679","author":"frustphil","deleted":false,"createdAt":"2009-09-18T21:43:49Z","message":"<p>I think something good is ganna come out of this =)</p><p>For me, I like the idea of indicator applet. But implementing it as another plasmoid is not good because it adds space and confusion. <br>For instance one might ask: Where exactly is the notification icon I could click/interact with? My suggestion is to put it beside the (i) icon or just like what alf (the above poster) suggested...</p>","replies":[]},{"id":"dsq-457710682","author":"whilo","deleted":false,"createdAt":"2009-09-19T03:47:42Z","message":"<p>I am the author of Incoming Message, and it actually was created by me, to allow me to see if there are new messages in relevant apps on the plasma screensaver, so i don't have to unlock it. Thats about it and it is not supposed to be a notification system. In fact it should show only the information if i need to unlock and not leak any privacy.</p>","replies":[{"id":"dsq-457712141","author":"Aurélien","deleted":false,"createdAt":"2009-09-19T13:02:02Z","message":"<p>Oh. I didn't know it was developed for this use case. I guess it explains why it looks a bit weird when put in a panel :). Still, I think this plasmoid could be implemented with libindicate-qt, it would make the code much simpler.</p>","replies":[]}]},{"id":"dsq-457710683","author":"dipesh","deleted":false,"createdAt":"2009-09-19T14:39:10Z","message":"<p>\"libindicate-qt depends on libindicate. libindicate used to depend on GTK+ at runtime, but it’s not the case anymore.<br>It still depends on GTK+ at build time\"</p><p>classic showstopper.</p>","replies":[{"id":"dsq-457710686","author":"Aurélien","deleted":false,"createdAt":"2009-09-19T17:03:45Z","message":"<p>Why?</p>","replies":[]}]},{"id":"dsq-457710690","author":"Thomas Zander","deleted":false,"createdAt":"2009-09-20T16:49:34Z","message":"<p>I also worry about the reinventing of the wheel without talking to the actual stakeholders here. Thats not how to get results..</p><p>But lets ignore that for a moment.</p><p>I notice you use Qt style C++ api that has a name starting with a 'Q'. Please don't do that. Thats asking for trouble.<br>Your class should have another name to avoid people thinking its one from Qt itself. Also imagine the problem of Qt shipping with a class of the same name.</p>","replies":[{"id":"dsq-457712145","author":"Aurélien","deleted":false,"createdAt":"2009-09-20T18:29:43Z","message":"<p>Mmm true. That's a problem. Would QtIndicate be appropriate? or should we go for IndicateQt?</p>","replies":[{"id":"dsq-457712618","author":"Thomas Zander","deleted":false,"createdAt":"2009-09-20T19:44:59Z","message":"<p>Why do you need a 'Q'? Make it 'C' for Canonical or something like that. Like KDE classes start with 'K' and KWord classes with 'KW'.</p>","replies":[{"id":"dsq-457712623","author":"Aurélien","deleted":false,"createdAt":"2009-09-20T23:30:06Z","message":"<p>Because they are Qt bindings to a C library named libindicate. I could use Indicate, but I thought it was a good idea to use a Q to imply the library is QObject-based.</p>","replies":[]}]},{"id":"dsq-457712146","author":"Esben Mose Hansen","deleted":false,"createdAt":"2009-09-20T19:52:34Z","message":"<p>Namespaces are for solving issues like that. So use e.g. libindicate as the namespace and Indicate as the class name. Qt doesn't use namespace due to old age; all modern libraries should.</p>","replies":[]}]}]}]
