[{"id":"dsq-457710075","author":"Luis","deleted":false,"createdAt":"2008-11-20T03:42:58Z","message":"<p>Very,  very nice! Thank you!</p>","replies":[]},{"id":"dsq-457710078","author":"moltonel","deleted":false,"createdAt":"2008-11-20T04:38:25Z","message":"<p>It's nice option indeed.</p><p>Altough what annoys me about the bar is not the thumbnails (love them !), but how long the bar remains visible (too long for my taste). Could that timer be configurable, or could a click on the fullscreen image automatically hide the topbar ?</p>","replies":[]},{"id":"dsq-457710069","author":"Socceroos","deleted":false,"createdAt":"2008-11-20T04:59:08Z","message":"<p>Very nice!</p><p>Is it possible to have this 'cut down' thumbnail bar centred on the screen? It doesn't make much usability sense to have it on the left when it could be right in the centre.</p>","replies":[]},{"id":"dsq-457710070","author":"Volker","deleted":false,"createdAt":"2008-11-20T04:59:53Z","message":"<p>Thank you! That's the right KDE-way, to make it configurable :)</p>","replies":[]},{"id":"dsq-457710067","author":"metellius","deleted":false,"createdAt":"2008-11-20T05:20:35Z","message":"<p>Can you make it show only when you reach the upper edge of the screen? For me it was very annoying when I was viewing large pictures on my small screen by zooming and moving the mouse, and the full screen there was constantly visible taking precious screen space.</p>","replies":[]},{"id":"dsq-457710065","author":"kanttu","deleted":false,"createdAt":"2008-11-20T13:28:13Z","message":"<p>I totally agreed with previous poster. Triggering on top edge of the screen would be awesome.</p><p>I also hope that it'd be possible to toggle fullscreen by double clicking the image. KDE 3.5 had this feature but atleast 4.1 lacks it.</p><p>Keep up the good work!</p>","replies":[]},{"id":"dsq-457710087","author":"Aurélien","deleted":false,"createdAt":"2008-11-20T14:06:36Z","message":"<p>@moltonel: In Gwenview 2.2, The bar hides itself as soon as the mouse leaves it.</p><p>@Socceroos: It's in the top-left corner so that the leave-fullscreen button is easier to grab: throw your mouse cursor in the top-left corner and click. Having it on the center would also make the bar \"jump\" whenever you toggle the \"Show thumbnails\" checkbox. But I agree it would probably look a bit nicer. Will think about it.</p><p>@metellius, kanttu: In Gwenview 2.2, the bar only shows up when you hit the top edge.</p>","replies":[]},{"id":"dsq-457710085","author":"Karl Günter Wünsch","deleted":false,"createdAt":"2008-11-20T19:00:27Z","message":"<p>As much as I like any improvement in this area but how about an option to have these toolbars aligned vertically! Every time I have an image that is higher than wide I am annoyed by the fact that these horizontal bars take away valuable screen height - especially on wide screen displays where even most pictures that are wider than high are displayed with a black strip to the left and right... The same applies to the image thumbnails in the view mode of gwenview, not only full screen mode.<br>regards<br>Karl Günter</p>","replies":[]},{"id":"dsq-457710082","author":"Karl Günter Wünsch","deleted":false,"createdAt":"2008-11-20T23:37:53Z","message":"<p>I like what I see, well in part I do... I already commented before but the comment didn't show up here - but I really really wish for all these thumbnailbars not to disappear but to be placeable vertically to the left or right of the image. Even your screen shots show that there is loads of space there which is unoccupied. And that's without taking vertically aligned images or wide screen displays - both not that uncommon - into account.</p>","replies":[]},{"id":"dsq-457710083","author":"Aurélien","deleted":false,"createdAt":"2008-11-21T04:51:32Z","message":"<p>@Karl Günter Wünsch: The new autohiding behavior of the fullscreen bar makes it much less obstrusive so I believe it won't  \"take away valuable screen height\".<br>(for the record, my screen is 1280x800, so it's quite wide in fact)</p>","replies":[]},{"id":"dsq-457710084","author":"kanttu","deleted":false,"createdAt":"2008-11-21T13:29:44Z","message":"<p>I tested nightly build of KDE 4.2, and Gwenview really rocks! It's also much faster than in 4.1 :)</p><p>After using it for awhile I had only one problem: when then thumbnail bar is appearing or disappearing, the whole screen blinks to white. Also when you view a new image, it shows some old picture data for a fraction of second but I think the same bug/feature.</p><p>Personally I think it's a multi-threading issue, image buffer is rendered on the screen with uninitialized data before the actual image is loaded completely. This thing also happens in 4.1 and it's a bit annoying :/</p><p>However I hope you can solve this for the final release. Otherwise Gwenview really rules :)</p>","replies":[]},{"id":"dsq-457710079","author":"Karl Günter Wünsch","deleted":false,"createdAt":"2008-11-21T15:17:49Z","message":"<p>@Aurélien, sorry for the double post... As I said, I like what I see and I have tried this autohiding feature, but this makes some things harder in full screen mode. I really want to have the icons visible - but on the right or left hand side because I use gwenview as a comparing tool for determining which image of a set is the one that has preserved the best sharpness - thus I often switch between 4 or more images. Having these icon bars horizontally aligned - especially in non-fullscreen view mode - takes away too much of the space for my liking. Switching them off is not an option because I need a way of switching between those images at random quickly...</p>","replies":[]}]
