[{"id":"dsq-1160321231","author":"Danny","deleted":false,"createdAt":"2013-12-12T17:35:10Z","message":"<p>As someone who uses Gwenview quite a bit as I am transitioning away from Windows and Windows apps as well as transitioning my family from their Windows systems I find these \"minor\" tweaks to be quite refreshing.  One of my sons who is becoming quite the photographer will appreciate these changes as well.  For us....even with my professional work....Gwenview has replaced IrfanView on Windows.  These small changes actually have a BIG impact on impressing folks over the fit and finish of Free &amp; Open Source program alternatives.  Thanks again....even for the \"small\" stuff.</p>","replies":[]},{"id":"dsq-1160370904","author":"mck182","deleted":false,"createdAt":"2013-12-12T18:08:57Z","message":"<p>One thing I would like to see in the meta sidebar is either \"topically sorted\" or manually sortable items. For example - for photographs, the most important things are aperture and shutter speed (among others). Each of these values is on the other side of the list while they belong together.</p><p>So my suggestion is - put the related things together. The exif tags should hopefully by common enough to do that :)</p>","replies":[{"id":"dsq-1160745189","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-12-12T22:44:18Z","message":"<p>Very good point. I am thinking the metainfo dialog could be changed to use a dual-list, making it possible to reorder the selected items. And we should come up with reasonable defaults so that most users do not actually need to do that. You are a much better photograph than I am, your advice regarding which fields to show by default and in which order would be precious :)</p>","replies":[]}]},{"id":"dsq-1160392878","author":"Mahen","deleted":false,"createdAt":"2013-12-12T18:21:33Z","message":"<p>Hey Aurélien ! Thanks again for the continued support... It's been ten years or so, since you started ? Still one of my favorite KDE apps, great !</p>","replies":[{"id":"dsq-1160746162","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-12-12T22:45:16Z","message":"<p>Hey Mahen ! It's easy to count, I started Gwenview in 2000... so more like 13 years... wow.</p>","replies":[]}]},{"id":"dsq-1160482943","author":"Nayar","deleted":false,"createdAt":"2013-12-12T19:24:54Z","message":"<p>Those are really nice improvements. I'll try to include a map in there in holidays (if i manage to learn C++/Qt)</p>","replies":[]},{"id":"dsq-1160522061","author":"Ralesk","deleted":false,"createdAt":"2013-12-12T19:52:38Z","message":"<p>Thank you, these are indeed some well-needed touch ups :)  The sidebar and its configuration has always been something that annoyed me a lot in Gwenview.</p>","replies":[]},{"id":"dsq-1160715811","author":"Knusper","deleted":false,"createdAt":"2013-12-12T22:16:34Z","message":"<p>Gwenview is da bomb! Very nice work!</p>","replies":[]},{"id":"dsq-1160879029","author":"Jon Mease","deleted":false,"createdAt":"2013-12-13T01:13:16Z","message":"<p>I really like the sidebar changes, quite elegant.</p>","replies":[]},{"id":"dsq-1161245031","author":"Victor Varvariuc","deleted":false,"createdAt":"2013-12-13T11:23:51Z","message":"<p>Just for information: there is XnView for Linux which uses Qt (<a href=\"http://www.xnview.com/en/xnviewmp.php)\" rel=\"nofollow noopener\" title=\"http://www.xnview.com/en/xnviewmp.php)\">http://www.xnview.com/en/xn...</a> I was using XnView on Windows, and now I am using it on Linux(<a href=\"http://blindvic.blogspot.ru/2012/03/xnview-gwenview-alternative-for-kde.html)\" rel=\"nofollow noopener\" title=\"http://blindvic.blogspot.ru/2012/03/xnview-gwenview-alternative-for-kde.html)\">http://blindvic.blogspot.ru...</a>. I would use GwenView if the keyboard control was better (<a href=\"https://bugs.kde.org/show_bug.cgi?id=199264)\" rel=\"nofollow noopener\" title=\"https://bugs.kde.org/show_bug.cgi?id=199264)\">https://bugs.kde.org/show_b...</a></p>","replies":[]},{"id":"dsq-1162962319","author":"Ernesto Manríquez","deleted":false,"createdAt":"2013-12-14T12:37:46Z","message":"<p>Gwenview is essentially finished, and that's a good thing. So, please, focus on optimization for the next cycles.</p><p>Also, if you want to reimplement Gwenview on top of Dolphin, that would be beyond awesome.</p>","replies":[]},{"id":"dsq-1164828255","author":"Teun","deleted":false,"createdAt":"2013-12-15T19:28:29Z","message":"<p>Hi Aurelién,</p><p>Thanks for your continuing development of this great application!</p><p>Reading about the meta data side bar I remembered an old wish.<br>Would it be possible to have some meta data displayed as an overlay on top of a full screen view?<br>It's (thanks to GwenView) a while ago I last used IrfanView but IIRC it can display the file name as a transparent overlay and it's toggled by pressing the letter i(nformation).</p><p>I could even imagine the info as set up in the sidebar would be displayed.</p>","replies":[{"id":"dsq-1165478957","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-12-16T10:14:24Z","message":"<p>Right now I have no plan for adding configurable overlayed information, would need to think about it. You can however already customize the information displayed in the fullscreen bar (below the buttons) to show which meta information is relevant to you.</p>","replies":[{"id":"dsq-1166577806","author":"Teun","deleted":false,"createdAt":"2013-12-16T21:57:01Z","message":"<p>Ah good I came here, I had not realised the full screen bar is editable, thanks so much.<br>As a matter of fact, I did not even know it would display the file name, that's basically all I was after and now there is even more :)<br>Thanks!</p>","replies":[]}]}]}]