[{"id":"dsq-457709406","author":"john","deleted":false,"createdAt":"2007-07-26T23:31:44Z","message":"<p>very nice to see this, thanks for the work. The kde4 version of gwenview seems to be quite an improvement!</p>","replies":[]},{"id":"dsq-457709408","author":"TeeZee","deleted":false,"createdAt":"2007-07-27T00:30:46Z","message":"<p>looks cool!! *thumbs up*</p>","replies":[]},{"id":"dsq-457709410","author":"Rob","deleted":false,"createdAt":"2007-07-27T03:50:30Z","message":"<p>YAY! That is something I wanted to see!</p><p>It would be nice, \"while your in there,\" to have an aspect ratio crop option too. A check box \"crop using an aspect ratio\" and a place to enter the ratio or a dropdown to pick the ratio.</p><p>Looking good!</p>","replies":[]},{"id":"dsq-457709411","author":"kibab","deleted":false,"createdAt":"2007-07-27T04:10:18Z","message":"<p>Perhaps this is more of a gimp/krita feature, but I have always wanted to say 'crop to YYxZZ dimensions' and then have the selection box enforce the aspect ratio without forcing me to set the size.</p><p>For example, I could tell it that I want to crop down to an 8x10, I could then choose the area that I want to see, and know that I'm going to end up with the correct aspect ratio.  As almost all of my editing is simple, this would speed it up a lot when I go to crop images for printing.</p><p>Thanks for the help, the great tool, and working on the new version!</p>","replies":[]},{"id":"dsq-457709413","author":"Aurélien","deleted":false,"createdAt":"2007-07-27T12:57:53Z","message":"<p>Yes, I do plan to add support for crop ratio later. For now I am back to polish some other parts of Gwenview code, but I will eventually come back to finish this.</p>","replies":[]},{"id":"dsq-457709415","author":"mark cox","deleted":false,"createdAt":"2007-08-01T09:27:58Z","message":"<p>any plans for lossless crop?</p>","replies":[]},{"id":"dsq-457709417","author":"Aurélien","deleted":false,"createdAt":"2007-08-01T20:26:11Z","message":"<p>@mark: not for now, but it could be done.</p>","replies":[]},{"id":"dsq-457709418","author":"Werner Hartnagel","deleted":false,"createdAt":"2007-08-11T13:32:36Z","message":"<p>This are good news! I hope you decide to support lossless jpeg crop too. Thats such a useful but not much used feature! There are currently no good gui applications available for this job.</p><p>Thanks for continue your work Gwenview, i know u decide to stop already in the past :)</p>","replies":[]},{"id":"dsq-457709420","author":"Anders","deleted":false,"createdAt":"2007-11-12T00:18:49Z","message":"<p>Please consider adding some sort of aspect controls! As a minimum 'keep aspect', but an option to input aspect values would be great.</p>","replies":[]}]