[{"id":"dsq-457710994","author":"mario","deleted":false,"createdAt":"2010-05-11T00:30:27Z","message":"<p>absolutely awesome! that has to get merged into KDE! im waiting years for a decent implementation of this menubar.</p>","replies":[{"id":"dsq-457711000","author":"Sunil","deleted":false,"createdAt":"2010-05-11T05:51:03Z","message":"<p>Me too! <br>Thank you for this, especially for the netbook implementation :)</p>","replies":[]}]},{"id":"dsq-457710990","author":"Keith","deleted":false,"createdAt":"2010-05-11T00:37:17Z","message":"<p>Wow nice job. I can't wait for this :D. But the only question is. My application uses a Tab widget that's in the menubar just like KDevelop4 IDE does. What will happen when I use this in the global menubar?</p>","replies":[{"id":"dsq-457712251","author":"Aurélien","deleted":false,"createdAt":"2010-05-11T01:17:31Z","message":"<p>Not sure how KDevelop4 would behave with this. I need to try it. In the worse case an application can decide to opt-out from the global menubar by using QApplication::setAttribute(Qt::AA_DontUseNativeMenuBar, true)</p>","replies":[{"id":"dsq-457712256","author":"Christian","deleted":false,"createdAt":"2010-05-11T12:25:33Z","message":"<p>KDevelop4 is broken this way, but a blacklist or opt-out option could help here.</p>","replies":[{"id":"dsq-457712286","author":"John M.","deleted":false,"createdAt":"2010-05-20T17:30:37Z","message":"<p>Why is it \"broken\", just because it doesn't comply with *your* idea of what an application should do with it's title bar space?</p><p>Other applications like Palapeli also put custom stuff like tabs in their menu bars. Kexi2 has even merged the menu and tool bars in an interesting way. On the non-FOSS front, we have Microsofts innovative ribbon UI.<br>As a user, I find all this this very useful and worth pursuing more, so a distribution/desktop environment should try it's best to play nice with Applications that experiment with such modern and creative approaches, rather than just label these apps as \"broken\".</p><p>Nowadays, it's common practice for applications to have tons of innovative controls and interactive elements in their *toolbars*, but *menu bars* are mostly still boring, text-only and sterile like in the 1990's. Why criticize applications that try to change this?</p>","replies":[{"id":"dsq-457712646","author":"Aurélien","deleted":false,"createdAt":"2010-05-20T17:39:53Z","message":"<p>I think what Christian meant was that the global menubar breaks KDevelop4, not that KDevelop4 is broken.</p>","replies":[{"id":"dsq-457712764","author":"John M.","deleted":false,"createdAt":"2010-05-20T20:16:57Z","message":"<p>Oops, you're right. I totally misinterpreted his comment.<br>Sorry for that...</p>","replies":[{"id":"dsq-457712896","author":"eigenraum","deleted":false,"createdAt":"2010-05-20T21:03:10Z","message":"<p>Yes, Aurélien is right, I didn't mean that KDevelop4 is broken but that the global menu bar is breaking it[1]. But your points are right. Application developer should be able to prevent that the menu bar is extracted from the application window.</p><p>[1]: Other applications that have problems with a global menu: dolphin - it shows a \"Show menu bar\" in the context menu; and the menus in VirtualBox (but only in the window of a running instance in the new version 3.2)</p>","replies":[]}]}]}]}]}]},{"id":"dsq-457711068","author":"Stefan","deleted":false,"createdAt":"2010-05-20T19:22:54Z","message":"<p>@keith: If your application uses this pattern, and KDevelop does, too, and Palapeli does, too, it might be the right time to think about a generic solution.</p>","replies":[]}]},{"id":"dsq-457710987","author":"Rp","deleted":false,"createdAt":"2010-05-11T00:37:34Z","message":"<p>Nice!! Keep the good work!</p>","replies":[]},{"id":"dsq-457710991","author":"Fri13","deleted":false,"createdAt":"2010-05-11T00:40:57Z","message":"<p>I would really hope this would be added for KDE SC 4.5. But if it is not possible then at least to 4.6 release.</p><p>Just looks so awesome!</p>","replies":[{"id":"dsq-457712248","author":"Aurélien","deleted":false,"createdAt":"2010-05-11T01:18:14Z","message":"<p>It is too late for KDE SC 4.5, hopefully it should be ready for 4.6.</p>","replies":[{"id":"dsq-457712262","author":"Christian","deleted":false,"createdAt":"2010-05-11T12:26:25Z","message":"<p>It would be nice to have it in Kubuntu 10.10 anyways.</p>","replies":[]}]}]},{"id":"dsq-457710986","author":"Livio","deleted":false,"createdAt":"2010-05-11T00:52:22Z","message":"<p>Awesome. Wish to see a GTK app integrated too. Willing to show us a video :&gt; ?</p>","replies":[{"id":"dsq-457712252","author":"Aurélien","deleted":false,"createdAt":"2010-05-11T01:12:01Z","message":"<p>OK, when I get it running on my machine, I'll record a new screencast.</p>","replies":[{"id":"dsq-457712643","author":"Livio","deleted":false,"createdAt":"2010-05-11T01:12:47Z","message":"<p>Thank you in advance :) .</p>","replies":[]}]}]},{"id":"dsq-457710985","author":"Andreas","deleted":false,"createdAt":"2010-05-11T01:10:03Z","message":"<p>Fantastic! Please commit to appropriate places so we can get this goodness :)</p>","replies":[]},{"id":"dsq-457710983","author":"Alex","deleted":false,"createdAt":"2010-05-11T01:10:15Z","message":"<p>WANTWANTWANTWANTWANT</p><p>Seriously, this is something I have long dreamed of.  \"Awesome\" doesn't quite do it justice.</p>","replies":[]},{"id":"dsq-457710980","author":"atomopawn","deleted":false,"createdAt":"2010-05-11T01:18:11Z","message":"<p>Very nice.  I'm curious, though -- how does this interact with keyboard shortcuts?  Is it still be possible to hit \"Alt-f s\" to save and so forth when using the menubar this way?</p>","replies":[{"id":"dsq-457712249","author":"Aurélien","deleted":false,"createdAt":"2010-05-11T01:20:25Z","message":"<p>It does not work right now, but this is something I want to add to the final version.</p>","replies":[{"id":"dsq-457712271","author":"Chani","deleted":false,"createdAt":"2010-05-12T03:51:55Z","message":"<p>when you do, tell me how you did it...</p>","replies":[]}]}]},{"id":"dsq-457710977","author":"ChALkeR","deleted":false,"createdAt":"2010-05-11T01:22:50Z","message":"<p>Cool. Hope it will be standart (fdo?) and not so buggy as bespin implementation.</p>","replies":[]},{"id":"dsq-457710970","author":"pano","deleted":false,"createdAt":"2010-05-11T01:27:19Z","message":"<p>I wonder how this would behave when using apps that do not have a \"real\" menu bar (e.g. rekonq).</p>","replies":[{"id":"dsq-457710973","author":"Keith","deleted":false,"createdAt":"2010-05-11T01:46:48Z","message":"<p>probably be just like chromium</p>","replies":[]},{"id":"dsq-457712247","author":"Aurélien","deleted":false,"createdAt":"2010-05-11T01:51:26Z","message":"<p>Rekonq is not affected by this and just shows nothing in the menubar right now.</p>","replies":[]}]},{"id":"dsq-457710962","author":"furanku","deleted":false,"createdAt":"2010-05-11T02:00:34Z","message":"<p>Great! Thank you very much, I missed that feature since the first days of KDE 4!</p>","replies":[]},{"id":"dsq-457710966","author":"Markus","deleted":false,"createdAt":"2010-05-11T02:02:56Z","message":"<p>I hope you act wiser than your Canonical colleagues who implement stuff without coordinating with upstream at all. (Please don't do Windicator shit)</p><p>Btw, I wrote a netbook GUI proposal a while back: <a href=\"https://kamikazow.wordpress.com/2010/04/09/plasma-netbook-mockup/\" rel=\"nofollow noopener\" title=\"https://kamikazow.wordpress.com/2010/04/09/plasma-netbook-mockup/\">https://kamikazow.wordpress...</a></p><p>The discussion is in the plasma-devel archives.<br>My proposal was not that well received, I might add in all fairness. But considering that most of the points in my proposal are built on existing Plasmoids a distributor could draw from my proposal, possibly enhance the existing Plasmoids, and ship something like that without tainting KDE's Plasma with unupstreamable code.</p>","replies":[{"id":"dsq-457711001","author":"Aurélien","deleted":false,"createdAt":"2010-05-11T10:24:33Z","message":"<p>Thanks for the pointer, I am going to have a look at it.</p>","replies":[]}]},{"id":"dsq-457710961","author":"crabman","deleted":false,"createdAt":"2010-05-11T02:05:25Z","message":"<p>Very cool!<br>What happens if an application has custom widgets inside its menu?<br>I mean things like the radiobuttons ins amaroks view menu or e.g a zoom slider, a spinbox, a lineEdit and so on?<br>Thinking this even further: what happens when a Qt app has a spinbox in its menu and is run in GNOME? Is it rendered by Qt inside of the gtk+ toolbar?</p>","replies":[{"id":"dsq-457711002","author":"Aurélien","deleted":false,"createdAt":"2010-05-11T10:27:54Z","message":"<p>We plan to extend DBusMenu to support more custom widgets, but it won't be able to support everything one can create in a QMenu. We need to work on a case by case basis with developers of applications which use custom widgets in their menus.</p><p>If you have some applications in mind, please share their names: we are going to do a review of what is shipped in Ubuntu, but the more people we have to look the less likely we might miss one application.</p>","replies":[]}]},{"id":"dsq-457710959","author":"Sean Tilley","deleted":false,"createdAt":"2010-05-11T02:33:22Z","message":"<p>FINALLY! I HAVE A REASON TO LIVE STILL!</p>","replies":[]},{"id":"dsq-457710958","author":"FiNeX","deleted":false,"createdAt":"2010-05-11T03:10:30Z","message":"<p>I like it... but what about the \"show/hide\" menu entry on the menus (and the common CTRL+M shortcut) ??????</p>","replies":[{"id":"dsq-457711003","author":"Aurélien","deleted":false,"createdAt":"2010-05-11T10:28:55Z","message":"<p>This action makes little sense with a global menubar, so I think it should be disabled/hidden when the global menubar is enabled.</p>","replies":[{"id":"dsq-457711060","author":"FiNeX","deleted":false,"createdAt":"2010-05-13T19:58:32Z","message":"<p>Don't forget about it :-)</p>","replies":[]},{"id":"dsq-457711070","author":"Thales Oliveira","deleted":false,"createdAt":"2010-05-23T19:54:01Z","message":"<p>maybe you can use the Ctrl + M shortcut to switch from a \"Panel Menu\" to the \"Button Menu\" like you've already have in your post =]</p>","replies":[]}]}]},{"id":"dsq-457710995","author":"Emmanuel Lepage Vallee","deleted":false,"createdAt":"2010-05-11T03:18:29Z","message":"<p>Aurélien, you just made my GSoC much easier ;P. The global menubar was the worst part, now, it is done! I can focus on plugable menu item and editable context menu instead of wasting my time on global code while it is not that important for my project. Just a question like that, how do you handle menu QWidgets and corner widgets? Does KDevelop work fine with your implementation. While doing some test, I fould it to be quite problematic.</p><p>Canonical/You talked about systray menu now being a little more plugin friendly when it come to adding new entry in a menu, does it apply to global menu too? Or is it necessary to apply it in the native menu so applications not using global menu bar can have plugable menus entry?</p><p>About the keyboard shortcut, I think it need to be separated from the menu code, so any applications/plasmoid/gnome shell can query the list of  (K)Actions to make some sort of \"discover your keyboard shortcut\" style plasmoid.</p><p>One last thing, context menu also need to be part of this effort. The current model for context menu does not work well for touch screen or MID/smartphone devices. Having them as a d-bus signal instead of a popup menu would allow the view to draw them with such devices in mind.</p><p>Of course, starting may 24, I will work on that too, expanding your base to handle more of these senario. My proposal is all about contextual actions, macro and improving the whole XMLGui thing (with d-bus), so you saved me a lot of time :)</p>","replies":[{"id":"dsq-457711005","author":"Aurélien","deleted":false,"createdAt":"2010-05-11T10:29:39Z","message":"<p>Glad I saved you some work! Can you add a pointer to your GSoC project?</p>","replies":[]},{"id":"dsq-457711055","author":"mado lamothe","deleted":false,"createdAt":"2010-05-13T08:19:04Z","message":"<p>Not that thrilled by it. Then again, I hate every default that comes with KDE and prefer things MY way.</p><p>I was reading about the systray menu now being a little more plugin friendly and was wondering (offtopic) if there has been any work done to it to allow the icons in the systray to be bigger.<br>It is by far the biggest complaint I get from older users and those with bad eyesight: they can make everything bigger and easier to see EXCEPT the systray icons which is often then rendered useless.</p><p>I know its OT but it just hit me now and its been something thats been user unfriendly towards older users and those with vision problems.</p><p>Cheers.</p>","replies":[{"id":"dsq-457712284","author":"Aurélien","deleted":false,"createdAt":"2010-05-13T11:10:14Z","message":"<p>Since the new systray is all rendered by the plasma widget, it should be possible to add support for scaling icons to it. Please file a bug on <a href=\"http://bugs.kde.org\" rel=\"nofollow noopener\" title=\"http://bugs.kde.org\">http://bugs.kde.org</a> about this.</p>","replies":[]}]}]},{"id":"dsq-457710996","author":"Kubuntiac","deleted":false,"createdAt":"2010-05-11T03:53:27Z","message":"<p>How about saving more space and looking slicker at the same time by replacing the big, ambiguous button labled menu (menu for what, exactly?) with the icon of the app.</p><p>Smaller<br>Clearer that it relates to the current app<br>More visual<br>Multiligual by definition</p>","replies":[{"id":"dsq-457711007","author":"Aurélien","deleted":false,"createdAt":"2010-05-11T10:31:02Z","message":"<p>Good point. The \"Menu\" button is still an experimental feature. I agree it would probably be nicer and more space efficient this way.</p>","replies":[]},{"id":"dsq-457712255","author":"zayed","deleted":false,"createdAt":"2010-05-11T11:26:29Z","message":"<p>+1.</p><p>What if we but the menu button inside the application itself ?</p>","replies":[{"id":"dsq-457712264","author":"Aurélien","deleted":false,"createdAt":"2010-05-11T12:28:46Z","message":"<p>This is an idea I like as well, but it's a totally different approach. Not much code from DBusMenu or the Qt patch would be useful to implement it.</p>","replies":[]},{"id":"dsq-457712267","author":"Adam","deleted":false,"createdAt":"2010-05-12T03:22:43Z","message":"<p>I don't see how that would save screen space, because the menu bar would still take up space at the top of the window, even if it's empty.</p>","replies":[{"id":"dsq-457712277","author":"Aurélien","deleted":false,"createdAt":"2010-05-12T11:01:22Z","message":"<p>When the menubar is reduced to a button and embedded in an existing panel, your window can use the vertical space previously used by the menubar.</p>","replies":[]}]}]}]},{"id":"dsq-457710999","author":"Dotan Cohen","deleted":false,"createdAt":"2010-05-11T11:40:59Z","message":"<p>Thanks! You might want to look at this feature request on BKO:</p><p>\"\"\"Collapse menu bar into icon\"\"\"<br><a href=\"https://bugs.kde.org/show_bug.cgi?id=211304\" rel=\"nofollow noopener\" title=\"https://bugs.kde.org/show_bug.cgi?id=211304\">https://bugs.kde.org/show_b...</a></p>","replies":[]},{"id":"dsq-457711008","author":"TZ","deleted":false,"createdAt":"2010-05-11T12:11:19Z","message":"<p>I hope it's style-independent?</p>","replies":[{"id":"dsq-457711010","author":"Aurélien","deleted":false,"createdAt":"2010-05-11T12:27:21Z","message":"<p>It is: it is implemented as a patch for Qt.</p>","replies":[]}]},{"id":"dsq-457711009","author":"Christian","deleted":false,"createdAt":"2010-05-11T12:23:31Z","message":"<p>Wow, this is awesome, even on a normal desktop computer :-)</p><p>If it can't be in KDE 4.5, it would be great to have it (maybe as an option) in Kubuntu.</p><p>For sure there are some bugs at this early stage (e.g. Kontact is missing a lot of menu items like \"Folder\"). I like the the button form factor a lot, but it should not disappear if there is no supported application in focus - the button should just be disabled - otherwise it's hard to move the widget and other widgets are moved every time I switch between support and non supported applications.</p><p>Thanks for your great work, looking forward to it!</p>","replies":[{"id":"dsq-457711011","author":"Aurélien","deleted":false,"createdAt":"2010-05-11T12:29:46Z","message":"<p>Yes, the whole widget needs some polish. Moving the widget is problematic right now.</p>","replies":[]}]},{"id":"dsq-457711014","author":"zayed","deleted":false,"createdAt":"2010-05-11T13:25:00Z","message":"<p>What I like more in this, it is does not required to modify the applications. It is done in Qt for all application for FREE.</p>","replies":[]},{"id":"dsq-457711016","author":"Jonathan Verner","deleted":false,"createdAt":"2010-05-11T13:52:03Z","message":"<p>Really great!!! You made my day :-) Thank you so much!</p>","replies":[]},{"id":"dsq-457711018","author":"thorGT","deleted":false,"createdAt":"2010-05-11T14:10:25Z","message":"<p>What I most like about this is that there are no icons in menus...... that's just so awesome...... please, leave it like this, there must be a reason Apple does it this way.</p>","replies":[]},{"id":"dsq-457711020","author":"thorGT","deleted":false,"createdAt":"2010-05-11T14:37:57Z","message":"<p>Apologize if I'm commenting off-topic (my previous comment on the subject was apparently removed, or maybe lost), but I'd like to say that this is awesome work and I especially like the absence of icons in the menus, which, in my opinion, is the way to go.</p>","replies":[{"id":"dsq-457711023","author":"Aurélien","deleted":false,"createdAt":"2010-05-11T14:47:31Z","message":"<p>(Your comment was not removed, it was just waiting for me to approve it :))</p><p>Thanks for the nice words, but icons will be back. They are not there right now because of a dependency issue which should be already solved.</p>","replies":[{"id":"dsq-457712265","author":"thorGT","deleted":false,"createdAt":"2010-05-11T15:17:38Z","message":"<p>Ah, so that's how it works. It was there \"Awaiting moderation\" and then disappeared, so I thought it'd been modded :) And as far as the dependency issue, yes, I know, I'm following plasma-devel..... would be nice if there was an option \"Show icons in application menus\", similar to what Oxygen has for regular buttons. For Oxygen and buttons, it's the style that is responsible for that, but your plasma representation could intercept menu icons request and allow to choose whether to show icons or not independent of the widget style used. That would be consistent with Oxygen. And nice for people like me who, well, like Apple ;)</p>","replies":[]}]}]},{"id":"dsq-457711024","author":"elcuco","deleted":false,"createdAt":"2010-05-11T15:39:50Z","message":"<p>I am a little worried about RTL implementations.</p><p>What happens when the language (direction) of the application does not match the direction of the panel? For example, I run a \"Hebrew\" dekstop, but then an \"English\" Application?</p><p>You need (somehow) to detect the direction of the application, and then set topMenu-&gt;setLayoutDirection(thatOtherApplicationDirection). This should be done EACH time you change application, and when applications change \"direction\" (you can always change the layoutDirection() of your main window.</p><p>Aurélien, contact me, my email is trivila to guess (add @kde.org to it) and you also have my GMail.</p>","replies":[{"id":"dsq-457711025","author":"Aurélien","deleted":false,"createdAt":"2010-05-11T16:09:00Z","message":"<p>Very good point. I haven't tested RTL support. I just added this to my list of things to check/implement.</p>","replies":[]}]},{"id":"dsq-457711026","author":"Magnus","deleted":false,"createdAt":"2010-05-11T16:27:44Z","message":"<p>How does global menus work when using window focus following the mouse pointer?</p>","replies":[{"id":"dsq-457712266","author":"Aurélien","deleted":false,"createdAt":"2010-05-11T16:46:44Z","message":"<p>Probably not very well I am afraid. Except if you use a shortcut to focus the menubar (this is not in yet). There may be other, more appropriate, visualisations for this case though. Since the content of the menubar is exposed on DBus, one could imagine KWin displaying the menubar in its title bar (without Windicators!)</p>","replies":[{"id":"dsq-457712645","author":"Adam","deleted":false,"createdAt":"2010-05-12T03:20:25Z","message":"<p>I use this in KDE 3.5 by setting a delay before windows are activated.  This way, if the cursor has to move across another window before it reaches the menu bar, I can just move it there quickly, and it arrives before the other window activates.  Certainly, I wouldn't recommend this as a default setting, but it lets me save screen space on my laptop and save clicks by using \"focus follows.\"</p>","replies":[{"id":"dsq-457712649","author":"Aurélien","deleted":false,"createdAt":"2010-05-12T10:56:35Z","message":"<p>Interesting solution, thanks for sharing.</p>","replies":[]}]}]}]},{"id":"dsq-457711029","author":"Dirk","deleted":false,"createdAt":"2010-05-12T03:12:56Z","message":"<p>Nice work, but to me this is bullshit!</p><p>There is a logical connection between the window and it’s menu. Why the hell would someone (who is not a mac user thinking macs are superior) loose this connection by putting the menu outside the window?</p>","replies":[{"id":"dsq-457711041","author":"Aurélien","deleted":false,"createdAt":"2010-05-12T10:55:57Z","message":"<p>Thanks for the nice words :(</p><p>To me the primary advantage of this work is to save space by embedding the menubar in the panel.</p>","replies":[{"id":"dsq-457711043","author":"Dirk","deleted":false,"createdAt":"2010-05-12T15:30:03Z","message":"<p>And you need a panel there to display the menu = waste of space. If i want to use the space as best as possible, i use wmii :)</p><p>Oh, and what about the “saved” space? You save – lets say – 20 pixels in the window but you lose 20 pixels on the top or the bottom of the desktop.</p>","replies":[{"id":"dsq-457711046","author":"Vide","deleted":false,"createdAt":"2010-05-12T17:43:09Z","message":"<p>You smart, you lose 20 px on the top (the panel) but you gain N*20px where N is the number of apps you are running. Obviously these are not all pixel on the same physical screen but pixel in the, let's call it so, \"applications-virtual-screen\".</p><p>And yes, this is a copycat of OSX but this has been present in KDE 3.x for years</p>","replies":[{"id":"dsq-457712280","author":"Dirk","deleted":false,"createdAt":"2010-05-12T17:59:47Z","message":"<p>No, you don’t lose N*20px, you do not “stack“ the application windows (or do you stack them?). If you order your windows in a kind of column, THEN (and only then) you really save pixels, but if you use multiple “layers” (overlapping windows) then you save nothing, but in the end you’re not losing any space.</p>","replies":[{"id":"dsq-457712647","author":"Livio","deleted":false,"createdAt":"2010-05-12T22:42:11Z","message":"<p>Don't want it - don't use it. And keep silent as many others want it.</p>","replies":[{"id":"dsq-457712761","author":"Dirk","deleted":false,"createdAt":"2010-05-13T06:03:18Z","message":"<p>Says who?</p>","replies":[{"id":"dsq-457712898","author":"FrancescoK","deleted":false,"createdAt":"2010-05-13T11:01:27Z","message":"<p>Putting the menu bar on top, predictably and consistently, makes me access the menus quicker than when they are integrated in the window, because it takes almost no precision to aim for the edge of the screen, while it takes quite a bit more effort to correctly hit the menu bar of a single window which may be anywhere. The workaround, obviously, is to work with all the windows always-maximized, as many Windows users do, which to me counters the whole idea of multiple windows.</p><p>The space-saving to me comes less from vertically stacking windows - something I sometimes actually do - but especially because you would want to put the K-Menu and applet indicators in the same container, not considering autohiding. Yes, like Mac OS, copying be damned.</p><p>In the end, maybe it's not something you may want to put as default for KDE, but as an option it's something quite a number of users would love to have. Me for one.</p><p>And, regarding the \"logical connection\": The logical connection is between the menu and the active program and window, not between the menu and any window of any program. Granted, KDE tends to lump \"window\" and \"program\" together most of the time, but just as keyboard shortcuts only work within the active window of the active program. So, to me, the menu, just like keyboard shortcuts, are something only related to the active task at hand, and more suited to a system-wide single implementation at a predictably consistent and easy-to-reach position.</p><p>Just because it takes a bit of getting used to if you are used to menus on windows doesn't make it a stupid idea, a broken design or something no-one wants :)</p>","replies":[]}]}]},{"id":"dsq-457712300","author":"FiNeX","deleted":false,"createdAt":"2010-08-16T13:27:35Z","message":"<p>Probably the idea behind a single menu bar is to have the desktop like a big MDI application.</p>","replies":[]}]}]},{"id":"dsq-457711050","author":"Aurélien","deleted":false,"createdAt":"2010-05-12T20:29:04Z","message":"<p>If I am using the button form factor, one can embed the menu in an existing panel so the menubar space is really saved. This panel can even be setup to autohide if vertical space is running out.</p>","replies":[]}]}]}]},{"id":"dsq-457711030","author":"Adam","deleted":false,"createdAt":"2010-05-12T03:18:14Z","message":"<p>Thank you for your work on this feature, and for sharing it here.  I am very much looking forward to having this feature back in KDE 4.</p>","replies":[]},{"id":"dsq-457711039","author":"furanku","deleted":false,"createdAt":"2010-05-12T07:34:02Z","message":"<p>Is it just me or do you also miss a comment  from A. Siego? NIH- and \"Master  of the Game\"- Syndrome here we come! :(</p>","replies":[{"id":"dsq-457711042","author":"Aurélien","deleted":false,"createdAt":"2010-05-12T11:04:54Z","message":"<p>You are confused here. Aaron has been a great supporter of dbusmenu, the technology used for the global menu. He strongly backed me up after my not-so-great commit introducing dbusmenu as a kde dependency in trunk.</p>","replies":[]}]},{"id":"dsq-457711044","author":"Andreas","deleted":false,"createdAt":"2010-05-12T15:41:56Z","message":"<p>@Dirk,</p><p>The space needed to render the menu or the menu bar is about the same yes, so if you only have 1 window per desktop you would gain nothing. If one on the other hand have &gt;1 window one have saved  (#windows-1)*sizeof(menu)...</p><p>I loved the feature in KDE3, which however had one slight problem: with focus follows mouse, it's hard to get the pointer to the menubar without chaning context...</p>","replies":[]},{"id":"dsq-457711051","author":"Stefan Majewsky","deleted":false,"createdAt":"2010-05-12T20:35:37Z","message":"<p>Will API be provided to let the app determine whether its menubar has been moved out of the window?</p><p>I'm asking because of my creative abuse of the menubar in Palapeli (a screenshot is at <a href=\"http://majewsky.wordpress.com/2009/10/02/palapeli-library-transactions/\" rel=\"nofollow noopener\" title=\"http://majewsky.wordpress.com/2009/10/02/palapeli-library-transactions/\">http://majewsky.wordpress.c...</a> for example). I assume that the current Palapeli would display just \"Settings\" and \"Help\" in the global menubar and leave the tabs inside the window, which is clearly suboptimal, so I'd like to implement an optimised layout for the global-menubar case.</p>","replies":[{"id":"dsq-457712274","author":"Aurélien","deleted":false,"createdAt":"2010-05-13T00:03:25Z","message":"<p>Yes, you will be able to query whether the global menubar is available with QMenuBar::isNativeMenuBar()</p>","replies":[]}]},{"id":"dsq-457711054","author":"lelamal","deleted":false,"createdAt":"2010-05-12T23:54:39Z","message":"<p>Hey, thanks for sharing. I'm sure this is gonna be an awesome feature! I hope to see it implemented in Kubuntu 10.10!</p>","replies":[]},{"id":"dsq-457711064","author":"mario","deleted":false,"createdAt":"2010-05-20T15:37:47Z","message":"<p>when will the patch land in qt trunk? or is it already?</p>","replies":[{"id":"dsq-457711067","author":"Aurélien","deleted":false,"createdAt":"2010-05-20T17:38:35Z","message":"<p>No it's not in trunk yet. And it won't reach Qt until Qt 4.8 because 4.7 is in beta.</p>","replies":[]}]},{"id":"dsq-457711061","author":"Yaohan Chen","deleted":false,"createdAt":"2010-05-31T10:22:31Z","message":"<p>It would be nice if the menu bar, task bar, system tray and a bunch of other widgets could fit in one panel. I think this solution would work well for me:</p><p>The menu bar and task bar share a segment of the panel; if they are too long to be both displayed fully, the menu bar will take precedence, but at least a little of the task bar will still be shown (with a gradient fade out effect to show it's truncated), and when and only when the mouse hovers on the partial task bar, the task bar expands, and the menu bar is partially cut off.</p><p>Maybe there should be a general way to combine any two adjacent widgets in a panel this way, letting them share space and both remain functional. Could this be done with a containment?</p>","replies":[{"id":"dsq-457712281","author":"Aurélien","deleted":false,"createdAt":"2010-05-31T12:08:59Z","message":"<p>You can already put everything in the same panel, but the menu and task bars compete for space, so there are a lot of resizes. I find that using the menu bar in button mode is a nicer way to operate if the panel contains a task bar.</p>","replies":[]}]},{"id":"dsq-457711071","author":"docidu","deleted":false,"createdAt":"2010-06-03T03:44:21Z","message":"<p>Well, this is one of the things i hated most about OSX, but as long as it isnt turned on by default, more options are a good thing....</p>","replies":[]},{"id":"dsq-457711073","author":"Merlin","deleted":false,"createdAt":"2010-06-28T22:46:26Z","message":"<p>I've been waiting for this for SOOOO long!!!</p><p>will we be able to download it from <a href=\"http://kde-apps.org???\" rel=\"nofollow noopener\" title=\"kde-apps.org???\">kde-apps.org???</a></p><p>I would really like to get my hands on this right now!!!</p>","replies":[{"id":"dsq-457712289","author":"Aurélien","deleted":false,"createdAt":"2010-06-29T14:10:38Z","message":"<p>This requires a Qt patch so it can't be made available on <a href=\"http://kde-apps.org\" rel=\"nofollow noopener\" title=\"kde-apps.org\">kde-apps.org</a>. If you run Kubuntu you can give a try to the PPA mentionned in the article. If you are familiar with building software from source, you can apply the patch and build the plasma menubar yourself.</p>","replies":[]}]},{"id":"dsq-457711082","author":"Thales Oliveira","deleted":false,"createdAt":"2010-07-18T23:03:47Z","message":"<p>So, when is it gonna be ready to use?<br>Have you tested it on KDE 4.4? (I don't know if there's a difference)<br>I tried this menu last month and I messed up my hole KDE ^^</p>","replies":[{"id":"dsq-457712296","author":"Thales Oliveira","deleted":false,"createdAt":"2010-07-18T23:05:12Z","message":"<p>sorry I wanted to say: KDE 4.5</p>","replies":[{"id":"dsq-457712299","author":"Aurélien","deleted":false,"createdAt":"2010-07-19T12:19:30Z","message":"<p>You need the appmenu Qt patch for this to work. Kubuntu will ship the patch in their version of Qt 4.7. We plan to get the patch integrated in upstream Qt for 4.8.</p><p>This means to get it to work on your desktop you need either to apply the Qt patch yourself, use Kubuntu Qt 4.7, wait for the patch to be in upstream Qt 4.8. Then you only need to build/install the Plasma menubar widget, which is independant (for now) of the KDE release.</p>","replies":[{"id":"dsq-457712301","author":"Thales Oliveira","deleted":false,"createdAt":"2010-07-31T20:51:01Z","message":"<p>So it means that we can already use it? As I said I tried to install it, and it did not work. Is there a way to make a tutorial explaining how to install and configure it for people like me who don't really know how to do it?</p><p>Thanks anyway,</p><p>Thales</p>","replies":[{"id":"dsq-457712650","author":"Aurélien","deleted":false,"createdAt":"2010-08-04T00:16:50Z","message":"<p>It's still quite experimental. I would suggest not trying it if you need stability and don't feel comfortable playing with alpha code. By the time Ubuntu Maverick is out, it should be usable by everybody (otherwise I am going to run into trouble with my manager :) )</p>","replies":[{"id":"dsq-457712762","author":"Thales Oliveira","deleted":false,"createdAt":"2010-08-04T01:33:26Z","message":"<p>Okay, I got it, thank you anyway :) I'm so anxious to use it.<br>Would you like any help? I'm a web developer/programmer so I think I cannot help with codes, but if you need something like tests or another thing let me know, ok?</p><p>Thank you very much again,</p><p>Thales</p>","replies":[{"id":"dsq-457712899","author":"Aurélien","deleted":false,"createdAt":"2010-08-04T01:49:55Z","message":"<p>Testers are always welcome. Especially checking applications behave correctly as some applications do weird things with menubars. The easiest way to test is probably through Kubuntu daily CDs. Give it a try and report bugs on Launchpad. You can learn more about this from here: <a href=\"https://wiki.ubuntu.com/DesktopExperienceTeam/ApplicationMenu\" rel=\"nofollow noopener\" title=\"https://wiki.ubuntu.com/DesktopExperienceTeam/ApplicationMenu\">https://wiki.ubuntu.com/Des...</a></p>","replies":[{"id":"dsq-457712904","author":"Thales Oliveira","deleted":false,"createdAt":"2010-08-16T06:52:27Z","message":"<p>it finally worked! the gtk apps doesnt work at all, but anyway :)</p>","replies":[]}]}]}]}]}]}]}]},{"id":"dsq-457711080","author":"strife","deleted":false,"createdAt":"2010-09-06T20:01:24Z","message":"<p>Hope this gets available for desktop kubuntu aswell and not just the notebook version!!!!</p><p>I want!</p>","replies":[{"id":"dsq-457711084","author":"Aurélien","deleted":false,"createdAt":"2010-09-07T00:14:16Z","message":"<p>It is available for both versions, no problem.</p>","replies":[]}]},{"id":"dsq-457711079","author":"Praveesh K P","deleted":false,"createdAt":"2010-10-06T18:26:06Z","message":"<p>Really awesome . It not only is useful in netbooks , but also in desktop computers too . Iam using it in my desktop pc (Kubuntu Maverick RC)and I have to say it is absolutely awesome. If possible, please send the patch to upstream</p>","replies":[]},{"id":"dsq-457711075","author":"Merlin","deleted":false,"createdAt":"2010-10-26T20:24:27Z","message":"<p>So tell me,</p><p>is the patch still going to get into QT4.8??</p><p>What news do you have about this?</p><p>Tks</p>","replies":[{"id":"dsq-457712292","author":"Aurélien","deleted":false,"createdAt":"2010-10-27T17:14:37Z","message":"<p>Yes it is.</p>","replies":[{"id":"dsq-457712653","author":"Merlin","deleted":false,"createdAt":"2010-10-28T19:18:12Z","message":"<p>GREAT!!! :) \"Native\" support, finally!! :D (sad that so many months are still ahead... but will still be great:)))))</p>","replies":[]}]}]},{"id":"dsq-457711074","author":"Zephyr","deleted":false,"createdAt":"2010-10-31T03:30:37Z","message":"<p>Thanks for your terrific work Aurelien!</p><p>Global Menubar works great yet I have an idea about implementing it as a KWin Decoration Button.<br>Please have a look at this link:</p><p><a href=\"http://forum.kde.org/brainstorm.php#idea91172_page1\" rel=\"nofollow noopener\" title=\"http://forum.kde.org/brainstorm.php#idea91172_page1\">http://forum.kde.org/brains...</a></p><p>Also when plasma widget appmenu gets upstream into KDE SC and if my proposal is made true, a KCM that has 3 options (1. \"old\" bahavior - 2. add plasma-panel with appmenu - 3. use kwin button menu) could be useful.</p>","replies":[{"id":"dsq-457712290","author":"Aurélien","deleted":false,"createdAt":"2010-11-02T02:23:49Z","message":"<p>Interestingly, one of the Kubuntu devs played a bit with this idea back when we started to work on the appmenu. It requires some work on the way the appmenu plasma applet is implemented for this to be possible, but when it's done (and it should hopefully be done for next Kubuntu), it should be possible to implement a kwin decoration to show menubars (or a menubutton as you suggested).</p>","replies":[]}]},{"id":"dsq-457711077","author":"Zephyr","deleted":false,"createdAt":"2010-11-02T17:52:02Z","message":"<p>I see! That's great!</p><p>Thank you very much and keep rocking!</p>","replies":[]},{"id":"dsq-457711087","author":"drja","deleted":false,"createdAt":"2010-11-06T17:58:24Z","message":"<p>Hi,<br>So I installed menubar plasma widget on my fully updated Kubuntu Maverick and, well, it really helps getting some screen space without sacrificing usability :)<br>One question though: how are things going when it comes to support of sudo/kdesudo Qt apps? At my desk, running, say, Dolphin as root (whichever way) makes it display its menubar the classic way - plasma widget seems to do nothing about that, with just File-&gt;Quit available. Well, I guess this is not the intended behaviour... Any options to fix that?<br>Thanks for your work anyways :)</p>","replies":[{"id":"dsq-457712303","author":"Aurélien","deleted":false,"createdAt":"2010-11-06T21:28:13Z","message":"<p>It is indeed a problem, but we haven't defined any workaround yet. Not sure what we could do to avoid that.</p>","replies":[]}]},{"id":"dsq-457711088","author":"Antony","deleted":false,"createdAt":"2011-04-29T13:39:28Z","message":"<p>This is a great though. I have a tablet pc, so it's a touch screen device, and right clicking to show the context menus doesn't exist. This way you can access always the context menu and it's even better of having to hold pressed the left click because you could miss click, or hold down the click for the wrong amount of time needed etc. The Only thing i found missing is the \"open with\" option. at least in the kubuntu 10.10 version i'm using i couldn't find it. Even though you can launch an application from terminal (having it as an option in dolphin) with any program you want, an open with option in the context menu it would be great. <br>Is there a way that someone could insert this option or generally menu voices alone or it has to be implemented by you?</p>","replies":[]},{"id":"dsq-457711090","author":"Benji","deleted":false,"createdAt":"2012-02-10T06:54:56Z","message":"<p>Hi,</p><p>Since, apparently, KDE 4.9 will support QT 4.8 what else (beside qt 4.8, kde 4.9 and the respective Plasmoid) does one need to get this working?</p><p>I've read something about appmenu-qt. Does that come with kde or do one has to install it as well?</p>","replies":[{"id":"dsq-457712304","author":"Benji","deleted":false,"createdAt":"2012-02-10T07:00:14Z","message":"<p>and that appmenu-qt plugin... will it come with kde or will we have to manually install it?! :(</p>","replies":[{"id":"dsq-457712313","author":"Aurélien","deleted":false,"createdAt":"2012-02-10T13:56:36Z","message":"<p>\"That appmenu-qt plugin\", as you say, is hosted on Launchpad, not on KDE git repository. I don't think it is going to change. But that is not relevant. What matters is what your distribution ships. Now that the Qt patch has been included, there is nothing preventing any distribution from shipping appmenu-qt and the plasma-widget-menubar plasmoid.</p>","replies":[]}]},{"id":"dsq-457712307","author":"Aurélien","deleted":false,"createdAt":"2012-02-10T13:53:07Z","message":"<p>You need appmenu-qt, the Qt plugin which exposes the menubar of Qt applications so that the plasmoid can display them. If you want menubars from GTK applications to be exposed as well, you need appmenu-gtk.</p>","replies":[]}]},{"id":"dsq-645750625","author":"cturkel","deleted":false,"createdAt":"2012-06-16T21:29:29Z","message":"<p>I just installed this and wow! Awesome!</p><p>BTW anyway to change the fonts or font styles?</p>","replies":[]},{"id":"dsq-645750628","author":"Ken","deleted":false,"createdAt":"2012-08-06T08:38:00Z","message":"<p>Hi Aurélien, I\\’ve been enjoying using this in KDE already and it seems fantastic.</p><p>    The only problem I\\’m noticing is that if you have multiple monitors, you really want them to show up where each monitor gets its own menu bar. One natural way to approach this is to have two panels, one on each monitor, and create two applets. Unfortunately the second applet doesn\\’t work.</p><p>    Any recommendations?</p>","replies":[{"id":"dsq-645751152","author":"Aurélien","deleted":false,"createdAt":"2012-08-06T11:36:38Z","message":"<p>The major problem of the applet is it cannot be used twice, indeed. Unfortunately I do not work on this much anymore now that it is no longer part of my job :(</p>","replies":[{"id":"dsq-645781006","author":"Ken","deleted":false,"createdAt":"2012-08-07T01:03:44Z","message":"<p>Ah, well I can't blame you.</p><p>I've never done any KDE development before, but I thought I'd just peek at the code. I found this, but it hasn't been updated since 2008, so I assume it's the wrong place to look:</p><p><a href=\"http://lxr.kde.org/source//playground/base/plasma/applets/menubar/\" rel=\"nofollow noopener\" title=\"http://lxr.kde.org/source//playground/base/plasma/applets/menubar/\">http://lxr.kde.org/source//...</a></p><p>Can you tell me where I would find the current canonical copy of the source code for the applet? I'd like to take a look at how it works. Thanks!</p>","replies":[{"id":"dsq-645781022","author":"Aurélien","deleted":false,"createdAt":"2012-08-07T16:34:19Z","message":"<p>Great to hear! The applet is hosted on Launchpad: <a href=\"http://launchpad.net/plasma-widget-menubar\" rel=\"nofollow noopener\" title=\"http://launchpad.net/plasma-widget-menubar\">http://launchpad.net/plasma...</a> . You may want to get in touch with the Oxygen Appmenu developers as well: they started the necessary work to be able to run two applets on the same desktop.</p>","replies":[]}]}]}]}]
