[{"id":"dsq-649678297","author":"","deleted":true,"createdAt":"2012-09-13T23:23:35Z","message":"","replies":[]},{"id":"dsq-649685906","author":"Mark","deleted":false,"createdAt":"2012-09-13T23:32:30Z","message":"<p>... ups, pressed post, before I wanted. I am not sure, if the following would qualify as an extra mile bug: All or nearly all plasma-components do not have a \"report bug\" feature like all KDE apps which makes it more difficult to report bugs on them, because one has to find the right component. The same goes for the systemsettings modules. I have reported some of them as bugs, but given up, since no one seems to care. The best would be if all plasmoids and all systemsettings modules would kind of automatically receive a report bug function. I believe this would be a great help for users reporting bugs and for the volunteers who have adjust the bug components manually. <br>At least adding it to all the plasmoids should meet the criteria \"easy to fix\".<br>I would report this as an extra mile bug, if you agree that it fits in the category, </p>","replies":[{"id":"dsq-650795890","author":"Aurélien Gâteau","deleted":false,"createdAt":"2012-09-14T21:48:05Z","message":"<p>It is a bit \"meta\", as in: fixing this would help people write better bug report, but I agree that could help improve the quality of Plasma applets and SystemSettings modules, so I would vote yes.</p><p>The question is, where should this link be added. A possible candidate for Plasma applets would be to add a Help button on the left of the config dialog, which would be a menu with entries like \"About this applet\" and \"Report a Bug\". Something similar could be done for SystemSettings modules by turning the existing Help button into a menu button.<br></p>","replies":[{"id":"dsq-650883734","author":"Mark","deleted":false,"createdAt":"2012-09-14T23:33:02Z","message":"<p>The config dialogue seems like a good place, but the context menu where it exists could also be an option.</p>","replies":[{"id":"dsq-651416878","author":"Aurélien Gâteau","deleted":false,"createdAt":"2012-09-15T13:56:17Z","message":"<p>Adding a \"Report Bug\" entry to the context menu would be a bit too much I think, but maybe this help submenu could also appear in the context menu.</p>","replies":[]}]},{"id":"dsq-650885315","author":"Mark","deleted":false,"createdAt":"2012-09-14T23:35:00Z","message":"<p> Just in case this is turned into an extra mile bug, would I need to open reports for every systemsettings module and plasmoid?</p>","replies":[{"id":"dsq-651414471","author":"Aurélien Gâteau","deleted":false,"createdAt":"2012-09-15T13:52:32Z","message":"<p>Hopefully not: I hope we can address this in the  components used to create Plasma applets and system settings modules, so that it does not require changes to all of them.</p>","replies":[]}]}]}]},{"id":"dsq-650053746","author":"","deleted":true,"createdAt":"2012-09-14T07:19:06Z","message":"","replies":[]},{"id":"dsq-650153232","author":"LL","deleted":false,"createdAt":"2012-09-14T09:56:00Z","message":"<p><a href=\"https://bugs.kde.org/show_bug.cgi?id=233053This\" rel=\"nofollow noopener\" title=\"https://bugs.kde.org/show_bug.cgi?id=233053This\">https://bugs.kde.org/show_b...</a> bug particulary bugs me :P Its there since 2010. <br>As far as I understand it was already fixed for the messages but not for the progressbar. <br>It can be fixed so easily by first making the info icon appear in the tray and then displaying the progressbar. <br></p>","replies":[{"id":"dsq-650800320","author":"Aurélien Gâteau","deleted":false,"createdAt":"2012-09-14T21:53:00Z","message":"<p> This bug report is about the position of notifications displayed when Plasma Notifications are disabled. Those are the light gray boxes with thick black borders which appear at the top of the screen.</p><p>I think you are referring to a different bug which happens when one use the Plasma Notifications but its icon is set to autohide. Is this the case?<br></p>","replies":[{"id":"dsq-651218573","author":"LL","deleted":false,"createdAt":"2012-09-15T07:58:21Z","message":"<p>Yes exactly. When autohiding in tray is activated.</p>","replies":[{"id":"dsq-651413349","author":"Aurélien Gâteau","deleted":false,"createdAt":"2012-09-15T13:50:40Z","message":"<p>OK. I think there must be an existing bug report for this issue in Bugzilla. Would be great if you could look for it and mark it as extramile.</p>","replies":[{"id":"dsq-651474515","author":"Mark","deleted":false,"createdAt":"2012-09-15T15:18:32Z","message":"<p>I have added the systemsettings bug to extramile, for the plasmoids I only found one even though I thought I created more. Should I create a generic one for plasmoids?</p>","replies":[]}]}]}]}]},{"id":"dsq-650207215","author":"Svempa","deleted":false,"createdAt":"2012-09-14T11:24:56Z","message":"<p>Just wanted to thank you for doing these things. :-)</p>","replies":[]},{"id":"dsq-650244937","author":"Lukáš Tinkl","deleted":false,"createdAt":"2012-09-14T12:17:42Z","message":"<p>Very nice initiative!</p>","replies":[]},{"id":"dsq-651310340","author":"Mark","deleted":false,"createdAt":"2012-09-15T10:44:26Z","message":"<p>Another proposition for an extra mile bug: <br>Show a KAuth dialog when copying/moving file(s) to an unaccessible folder<br><a href=\"https://bugs.kde.org/show_bug.cgi?id=243156\" rel=\"nofollow noopener\" title=\"https://bugs.kde.org/show_bug.cgi?id=243156\">https://bugs.kde.org/show_b...</a></p>","replies":[]},{"id":"dsq-658175928","author":"Anonymous","deleted":false,"createdAt":"2012-09-21T19:40:31Z","message":"<p>Thanks a lot for this initiative!</p>","replies":[]},{"id":"dsq-685862997","author":"ikeofkc","deleted":false,"createdAt":"2012-10-18T04:09:30Z","message":"<p>Dark themes (application color themes) have a lot of problems in some KDE programs. Rekonq sometimes incorrectly renders the background of some things the dark color. Libre office will have a dark background without manually adjusting (not KDE, so may be out of scope). there are a hand full of others</p>","replies":[]},{"id":"dsq-740731413","author":"dhunter","deleted":false,"createdAt":"2012-12-17T13:37:58Z","message":"<p>Add \"soft-scaling\" to Gwenview and we'll talk. ;)</p>","replies":[]}]
