[{"id":"dsq-457711847","author":"Blablabla","deleted":false,"createdAt":"2011-06-24T03:16:53Z","message":"<p>Hallelujah!</p>","replies":[]},{"id":"dsq-457711851","author":"didrocks","deleted":false,"createdAt":"2011-06-24T10:50:13Z","message":"<p>Congrats on the merge! Appy that this plugin system your write can benefit other distros as well. Let's hope the same can happen with SNI!</p>","replies":[]},{"id":"dsq-457711853","author":"Michael","deleted":false,"createdAt":"2011-06-24T13:24:31Z","message":"<p>Sweet! I'd like to see this evolve into the same context that the Firefox 4.0 menu has in the browser's title/tab bar.</p>","replies":[]},{"id":"dsq-457711854","author":"Burke","deleted":false,"createdAt":"2011-06-24T13:35:59Z","message":"<p>And  how about the menubutton, like the one in F4 and F5?</p>","replies":[{"id":"dsq-457711859","author":"gnumdk","deleted":false,"createdAt":"2011-06-24T13:42:30Z","message":"<p>It' should be ready for KDE 4.8 ;)</p>","replies":[]},{"id":"dsq-457712511","author":"Aurélien","deleted":false,"createdAt":"2011-06-24T14:07:06Z","message":"<p>The Plasma widget has a button form factor. Creating a FF-like menubutton is another story. I know other devs are working on it.</p>","replies":[]}]},{"id":"dsq-457711855","author":"gnumdk","deleted":false,"createdAt":"2011-06-24T13:41:37Z","message":"<p>Yeah,  you rocks ! :)</p><p>Do you think appmenu-gtk have any chance to merge with GTK ?</p>","replies":[{"id":"dsq-457711862","author":"Aurélien","deleted":false,"createdAt":"2011-06-24T14:05:54Z","message":"<p>I don't really know the status there. All I know is there are some political issues involved I don't want to get in.</p>","replies":[]}]},{"id":"dsq-457711845","author":"Noughmad","deleted":false,"createdAt":"2011-06-24T14:46:33Z","message":"<p>This is great, I'm looking forward to using it on something other than Kubuntu. It's really a spacesaver on a wide-screen laptop.</p><p>Thanks and congratulations!</p>","replies":[]},{"id":"dsq-457711838","author":"me","deleted":false,"createdAt":"2011-06-24T15:00:40Z","message":"<p>Just for completeness; this was sponsored by Canonical through it's Ayatana program?</p>","replies":[{"id":"dsq-457712508","author":"Aurélien","deleted":false,"createdAt":"2011-06-24T16:03:36Z","message":"<p>Yes, creating appmenu-qt was done as part of my work for Canonical.</p>","replies":[{"id":"dsq-457712515","author":"me","deleted":false,"createdAt":"2011-06-25T15:27:57Z","message":"<p>Then thanks to Mark and you for bringing back this great feature!</p>","replies":[]}]}]},{"id":"dsq-457711839","author":"Ernesto Manriquez Mendoza","deleted":false,"createdAt":"2011-06-24T16:09:21Z","message":"<p>Excellent. I always wanted the appmenu-qt plugin to be upstreamed! This is real feature parity with KDE 3.5!</p>","replies":[]},{"id":"dsq-457711841","author":"JanKusanagi","deleted":false,"createdAt":"2011-06-24T20:24:13Z","message":"<p>Congratulations :D</p>","replies":[]},{"id":"dsq-457711843","author":"thorGT","deleted":false,"createdAt":"2011-06-24T22:23:52Z","message":"<p>Awesome!</p><p>Now Aurelien, I'd love to ask you to share the method for getting patches inside Qt. They sometimes seem to ignore incoming review requests or process them for quite some time. Maybe you could tell us which people one should ask or be familiar with in order fr one's patch to be integrated into Qt with guarantee? ;)</p><p>Really, you have been very lucky. Congrats Aurelien, keep up the good work.</p><p>Regards,<br>--thorGT</p>","replies":[{"id":"dsq-457712510","author":"Aurélien","deleted":false,"createdAt":"2011-06-24T23:53:32Z","message":"<p>Persistence is key! :)</p><p>More seriously, there is no method. All Qt developers I know welcome external contributors but :<br>1. It is important that they remain picky about what gets into Qt, otherwise quality will go down<br>2. They are overwhelmed by the amount of incoming merge requests, which I take as a healthy problem to have. Judging from what I heard about Open Governance in the Qt Contributor Summit session, it should help to address this issue.</p>","replies":[]}]},{"id":"dsq-457711863","author":"Markus","deleted":false,"createdAt":"2011-06-27T01:51:05Z","message":"<p>Does this mean that the way is now paved to push the plasma-menubar upstream to KDE (to be part of plamsa-addons or so)?<br>I'd really like to close the ages-old bug report as FIXED.</p>","replies":[{"id":"dsq-457712514","author":"Aurélien","deleted":false,"createdAt":"2011-06-27T21:53:23Z","message":"<p>I am not sure I would get authorization to move the widget to be part of KDE git, will ask. But at least it means other distributions will be able to ship it without having to patch Qt.</p>","replies":[{"id":"dsq-457712520","author":"Markus","deleted":false,"createdAt":"2011-07-02T02:26:30Z","message":"<p>Well, as I wrote: Doesn't have to be in the default installation. plasma-addons, Extragear or whatever should be enough.<br>If I have to guess, I'd say it won't be accepted until Qt 4.8 is shipped and menubar doesn't need any unsupported patches. Maybe \"playground\" is fit for now.<br>Being inside KDE means better translations, to be a proper testbed for the menubutton in window decorations, and being able to close one of the most voted feature requests on Bugzilla.</p>","replies":[{"id":"dsq-457712697","author":"Aurélien","deleted":false,"createdAt":"2011-07-08T12:11:58Z","message":"<p>I am afraid it's not going to happen. Canonical company policy is that all projects created by Canonical must be hosted on Launchpad.</p>","replies":[]}]}]}]},{"id":"dsq-457711865","author":"raf","deleted":false,"createdAt":"2011-06-28T13:33:11Z","message":"<p>Aurélien, I use the plasma widget to get menus out of application in my main panel (on top of the screen), but sometimes when i change from a window to another window, some menus overlap one on top the other. Example:<br>archive an edit in the same place a space and then the rest of menus</p><p>With this patch, could be a solution for this problem?</p><p>My system is kubuntu x64, kde 4.6.4 (it also happens with 4.6.3)</p>","replies":[{"id":"dsq-457712521","author":"Aurélien","deleted":false,"createdAt":"2011-06-28T16:08:51Z","message":"<p>No, the patch won't help. Kubuntu already had the patch, what changed is that the patch has now been integrated into Qt itself, so other distributions can benefit from it. I suggest reporting your bug here: <a href=\"https://bugs.launchpad.net/plasma-widget-menubar\" rel=\"nofollow noopener\" title=\"https://bugs.launchpad.net/plasma-widget-menubar\">https://bugs.launchpad.net/...</a></p>","replies":[]}]},{"id":"dsq-457711866","author":"Javi","deleted":false,"createdAt":"2011-06-29T13:46:14Z","message":"<p>Congratulations, there were a lot of people waiting for this to go in trunk.</p><p>As usually, you have done a great job, thank you very much.</p>","replies":[]}]