[{"id":"dsq-956812685","author":"Jacky Alcine","deleted":false,"createdAt":"2013-07-09T22:14:26Z","message":"<p>Awesome! Ever considered making external source imports for Akregator like from Feedly or what not? I'm guessing it's not done because Akregator doesn't have a plug-in system for feed sources.</p><p>It'd be a bit like how Amarok can pull music from Google Music, <a href=\"http://Last.fm\" rel=\"nofollow noopener\" title=\"Last.fm\">Last.fm</a> and other sources.</p>","replies":[{"id":"dsq-956817965","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-07-09T22:21:02Z","message":"<p>Thanks! There is a akonadi_port of Akregator which brings something close to what you want. I haven't tried it yet, but I have been told it already has tinytinyrss support.</p>","replies":[{"id":"dsq-956878266","author":"Jacky Alcine","deleted":false,"createdAt":"2013-07-09T23:40:15Z","message":"<p>That's quite interesting. I've been moving away from the browser to desktop apps and the only thing left was really just the RSS reader. Time to flex those C++ muscles, haha!</p>","replies":[]},{"id":"dsq-956986911","author":"Ernesto Manríquez","deleted":false,"createdAt":"2013-07-10T02:17:00Z","message":"<p>I was going to ask what happened to Akregator2.</p>","replies":[]}]}]},{"id":"dsq-956953376","author":"tanghus","deleted":false,"createdAt":"2013-07-10T01:27:53Z","message":"<p>Great! I deeply appreciate every fix made to Akregator, as I use it every day, all of the day. Yes, I procrastinate a lot ;)<br>The #2 issue that bothers me most, is that I have to open an external browser to get the feed URL of a site I have browsed to in the internal browser.<br>#1 is that it crashed frequently when using webkit, but that seems to be the qtwebkit version shipped with (K)ubuntu. Maybe time to try KHTML again.</p>","replies":[]},{"id":"dsq-956996385","author":"ChallisTowerBks","deleted":false,"createdAt":"2013-07-10T02:31:01Z","message":"<p>Akregator is part of my daily routine too, so thanks for the fixes Aurelien! While everyone rushes around madly trying to find a substitute to Google Reader, my life remains calm and serene. :)</p><p>Kaz Augustin</p>","replies":[]},{"id":"dsq-957138116","author":"Boudewijn Rempt","deleted":false,"createdAt":"2013-07-10T06:53:39Z","message":"<p>Awesome! I have wondered for so long why ongoing was broken, but I always was too lazy to try and figure it out :-)</p>","replies":[]},{"id":"dsq-957884712","author":"Tom","deleted":false,"createdAt":"2013-07-10T20:44:55Z","message":"<p>Very kind of you, thanks. I use Akregator daily too (espaecailly too read the Planet KDE feed :). Most obvious bug to me is, that \"Back\" &amp; \"Forward\" neither work in the context menu nor in the toolbar icons nor the shortcuts (alt+left/right), BUT backspace works...</p>","replies":[]}]