[{"id":"dsq-1777418754","author":"Robert","deleted":false,"createdAt":"2015-01-07T23:27:32Z","message":"<p>What happened was a terrible and horrifying act of terrorism. I am shocked as you. MY condolences goes out to the families of the victims. And I hope that the modern and open societies will never the less prevail over ignorance, intolerance and xenophobia.</p>","replies":[]},{"id":"dsq-1778331539","author":"Birseba The Mage","deleted":false,"createdAt":"2015-01-08T14:46:33Z","message":"<p>We live in a world where war is possible. What did we do about it? Not much.</p>","replies":[]},{"id":"dsq-1780142271","author":"Jo Øiongen","deleted":false,"createdAt":"2015-01-08T23:11:22Z","message":"<p>Je suis Charlie.</p>","replies":[]},{"id":"dsq-1784382098","author":"isemenov","deleted":false,"createdAt":"2015-01-10T14:11:17Z","message":"<p>And I'm Russian and you European guys don't write \"je suis Donetsk\" when thousands are killed here in South Ukraine, whereas your Chralie bastards worked to ensure that people of different religions hate each other. So how about your rule \"no politics in Planet KDE\", eh? Dual standards? Sure thing!</p>","replies":[{"id":"dsq-1784427932","author":"Aurélien Gâteau","deleted":false,"createdAt":"2015-01-10T14:54:19Z","message":"<p>&gt; you European guys don't write \"je suis Donetsk\"<br>True. I did not write \"je suis Donetsk\". But I did not forbid you from doing so.</p><p>&gt; your Chralie bastards<br>I did not insult the deads in Donetsk either.</p><p>&gt; So how about your rule \"no politics in Planet KDE\"<br>I never heard about such a rule. Can you point me to a place where it is written?</p>","replies":[{"id":"dsq-1784436963","author":"isemenov","deleted":false,"createdAt":"2015-01-10T15:02:08Z","message":"<p>How about what  those people promoted? My family lost its home because of an ethnical conflict in Baku (Azerbakijan vs Armenia) that had similarly been organised from the USA or Europe. We rightfully hate any person who provokes ethnical or religious conflicts. Freedom is nice, until it steps on someone's else beliefs, culture or religion.</p><p>Rule - when you join planet kde, by clicking the \"add your blog\" link, there is a note about the blog contents. Also there may be a similar rule in the KDE code of conduct.</p>","replies":[{"id":"dsq-1785835381","author":"Aurélien Gâteau","deleted":false,"createdAt":"2015-01-10T21:15:11Z","message":"<p>&gt; Freedom is nice, until it steps on someone's else beliefs, culture or religion.</p><p>First, Freedom is not \"nice\", it is a fundamental right. It is in fact the first word of France motto.</p><p>Second: when one steps on someone else beliefs, the right course of action is to file a complaint, not to murder the offenders with assault rifles, murdering other innocent people on the way.</p><p>&gt; Rule - when you join planet kde, by clicking the \"add your blog\" link, there is a note about the blog contents.</p><p>Quoting the relevant parts of this note:</p><p>\"Blog content should be mostly KDE themed, English language and not liable to offend.\"</p><p>\"The majority of content in your blog should be about KDE and your work on KDE.  Blog posts about personal subjects are also encouraged since Planet KDE is a chance to learn more about the developers behind KDE.\"</p><p>\"KDE covers a wide variety of people and cultures.  Profanities, prejudice, lewd comments and content likely to offend are to be avoided.\"</p><p>I believe my blog in general and this post in particular follow those rules, especially since I did not write about politics or religion but about the murder of someone who I loved watching while he was drawing in a TV show for kids.</p><p>If you disagree, you should get in touch with the Community Working Group.</p><p>&gt; Also there may be a similar rule in the KDE code of conduct.</p><p>There is nothing about politics in the code of conduct.</p>","replies":[{"id":"dsq-1787732341","author":"isemenov","deleted":false,"createdAt":"2015-01-12T00:53:16Z","message":"<p>In short: you don't get what religious and ethnical hatred is and how they helped crate it. Nice. I didnt say ti was good to kill them, dont invent, please. I said no sane person qwho understands WHAT those bastards were doing is going to say \"Im Charlie, I'm with them\".</p><p>Your very own Duke d Anjou or hows it spelled said they served to create religious hatred. You obviously dont understand what it is when people come and throw your mother out of your window coz you're different nation.</p><p>That's what we had in Baku, that's what people like Charlie work for. Period. So - read what your own Duke, member of the Royal family, said.</p><p>Do you file a complaint when the above happens? And wait for a response? I guess no.</p><p>So it's not that bad after all when people who provoke this get shut up forever, you know.</p><p>Although yes killing is a crime and all such, bad bad. Sure. It's illegal and the people who did it are dead already.</p><p>#JesuisDonetsk #JenesuisCharlie or hows it spelled</p><p>PS let em state it clear: whatever is in YOUR motto, here were HATE those who post things like Charlie. Got it? Hitler had a motto too - Russians should be cleared out. Guess here he is now? Right, where Charlie is now.</p>","replies":[{"id":"dsq-1788081538","author":"Aurélien Gâteau","deleted":false,"createdAt":"2015-01-12T08:22:56Z","message":"<p>&gt; In short: you don't get what religious and ethnical hatred is.</p><p>It turns out I happen to know  what ethnic   hatred is because part of my family is Jewish and flew Poland during WW2. Most of them got caught in the so called \"rafle du Vel d'Hiv\" (<a href=\"http://en.wikipedia.org/wiki/Vel%27_d%27Hiv_Roundup\" rel=\"nofollow noopener\" title=\"http://en.wikipedia.org/wiki/Vel%27_d%27Hiv_Roundup\">http://en.wikipedia.org/wik...</a> ) and were sent to Auschwitz. A few managed to avoid that and joined the Foreign Légion to fight back. One of them, my great uncle, was too young for the Foreign Légion and joined the Resistance group of Manouchian instead. He was executed at the age of 18 (<a href=\"http://en.wikipedia.org/wiki/Wolf_Wajsbrot\" rel=\"nofollow noopener\" title=\"http://en.wikipedia.org/wiki/Wolf_Wajsbrot\">http://en.wikipedia.org/wik...</a> ).</p><p>I am not going to dive any further into that rabbit hole. I understand that you are pissed of, but I am not going to remove this post anyway. If you want to get it removed from Planet KDE, get in touch with the Community Working Group (<a href=\"https://ev.kde.org/workinggroups/cwg.php\" rel=\"nofollow noopener\" title=\"https://ev.kde.org/workinggroups/cwg.php\">https://ev.kde.org/workingg...</a> )</p>","replies":[{"id":"dsq-1788213454","author":"isemenov","deleted":false,"createdAt":"2015-01-12T11:27:24Z","message":"<p>Then we're in the same boat, man! We had war heroes in our family too. (Although the sort of conflict we had here is a bit different, but it's indeed a rabbit hole.)</p><p>But even though your family is partly Jewish, you're alright with the fact that they laugh at Jews in the picture, too?.. Freedom is indeed higher for you than anything else. Well, that's a view on life, what can I do, we have different value stacks.</p><p>Anyway, people died, it's a fact, and not just the offenders, but also the policemen, the hostages, and other innocent people. And regardless they all have families (except one artist, IIRC), so rest in peace and let those who are alive stay strong and get through this.</p><p>I don't ask you to remove the post, it's your position, let it be..</p>","replies":[{"id":"dsq-1789131385","author":"Aurélien Gâteau","deleted":false,"createdAt":"2015-01-12T21:08:44Z","message":"<p>Yes, I am usually fine with people laughing at Jews. The line between being satyric and being antisemitic is sometimes fuzzy and I will call people out if I consider a joke to be distasteful, but I am not going to try to murder them to silence them.</p><p>I am glad we can close this discussion this way: indeed, we have different value stacks.</p>","replies":[]}]}]}]},{"id":"dsq-1787733275","author":"isemenov","deleted":false,"createdAt":"2015-01-12T00:54:08Z","message":"<p>Please, do so that YOUR freedom does not step om MINE and that of many Muslims and Jews, alright? We have a freedom too. IT's in your motto.</p>","replies":[]}]}]}]}]}]
