[{"id":"dsq-985332951","author":"Jo Øiongen","deleted":false,"createdAt":"2013-08-02T03:49:21Z","message":"<p>Do not KDE have a GUI solution for this? Seriously, I thought KDE did?</p>","replies":[{"id":"dsq-985411548","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-08-02T06:42:16Z","message":"<p>KDE has a System Settings module to configure global shortcuts. It would be possible to use it to assign KSnapshot to another key, but this module cannot be used to reassign a key to another key (in my case, reassign \"Print Screen\" to \"Menu\"). The Xmodmap solution also has the advantage of being cross-desktop, so it also works when I am in my minimalist mood and run Openbox.</p>","replies":[]}]},{"id":"dsq-985439565","author":"András Bíró","deleted":false,"createdAt":"2013-08-02T07:49:39Z","message":"<p>I never really used the menu buttonm, so I just mapped krunner to it with kde's system settings.</p>","replies":[]},{"id":"dsq-985449774","author":"","deleted":true,"createdAt":"2013-08-02T08:14:07Z","message":"","replies":[{"id":"dsq-985459714","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-08-02T08:36:41Z","message":"<p>It's a X1 Carbon Touch. Apart from the keyboard, I got annoyed with the CPU not running at full speed while compiling (that's material for another article) and I am also constantly running out of disk space because I went for a 120GB SSD (big mistake because I run KDE master built from source in full debug mode and I am getting involved in KDE Frameworks as well, which means building Qt5 and the frameworks branch of kdelibs)</p>","replies":[]}]},{"id":"dsq-985485587","author":"YoYo","deleted":false,"createdAt":"2013-08-02T09:25:11Z","message":"<p>I got used to remapping kyes via setkeycodes, it affects directly what kernel reports for the keys, so is more 'syste wide' (works also on consoles and you can start X in ways that won't load user's xmodmap). It was also the only option for some keys/buttons on thinkpad tablets (some of them returned scancodes that were not mapped to anything...</p><p>Just find out the scancode and keycode you wish  to map to each other (showkey -s, showkey -k, be sure to run it under console, not X), then put something like:</p><p>setkeycodes SCANCODE1 KEYCODE1  SCANCODE2 KEYCODE2....</p><p>into some script that would be run on startup  (say /etc/local.d/setkeycodes.start on gentoo, not sure for other distros)</p><p>Snip from my old x41t configuration, which had forward/backward keys near cursor keys instead of pg up/down and didn't have a 'win' key (but had a '&amp;&lt;' key left of Z):</p><p>IBM_KEYS=(<br># tablet keys<br>67      56      # Reset? (used as Alt)<br>6c      147     # Rotate<br># 68    171     # Tools<br>68      157     # MyComputer, fluxbox doesn't react to XF86Tools, why?? so I use XF86MyCmp..<br>6b      1       # Esc<br>69      28      # Enter<br>#6b     56      # reset (used as Alt)<br>6d      103     # up<br>6e      108     # down (or reversed ;)</p><p>e06a    104     # Back/Forward -&gt; PgUp/PgDown<br>e069    109<br>56      125     # Win instead of *&amp;&lt;<br>)<br>setkeycodes \"${IBM_KEYS[@]}\"</p>","replies":[{"id":"dsq-985506238","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-08-02T09:42:19Z","message":"<p>Nice alternative, thanks for sharing!</p>","replies":[]}]},{"id":"dsq-1094801887","author":"Rhys","deleted":false,"createdAt":"2013-10-24T09:23:33Z","message":"<p>Hi, I'd really like to do this on my thinkpad but I'm not as computer savvy as you. Could you post instructions for a less experienced user?</p>","replies":[{"id":"dsq-1094827256","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-10-24T10:11:24Z","message":"<p>- Start a text editor such as Kate or Kwrite.<br>- Copy and paste the four lines I posted in.<br>- Save the file as .Xmodmap in your home folder.<br>- Log out and log back in. Should be good.</p>","replies":[{"id":"dsq-1094832900","author":"Rhys","deleted":false,"createdAt":"2013-10-24T10:21:51Z","message":"<p>It's a work laptop so I'm unable to download Kate or Kwrite and install. Can I use any windows based programme? Also, by home folder, do you mean direct to C:\\</p>","replies":[{"id":"dsq-1095018637","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-10-24T13:06:18Z","message":"<p>Sorry, this workaround only works on X11-based system, not on Windows.</p>","replies":[]}]}]}]}]