[{"id":"dsq-457711899","author":"steve","deleted":false,"createdAt":"2011-07-29T15:13:13Z","message":"<p>What would be cool, would be if it remembered that sometimes on your laptop you have 2 screens and 'remembered' those settings. It fails everytime for me, yet gnome/unity remembers everytime,</p>","replies":[{"id":"dsq-457711905","author":"Brian","deleted":false,"createdAt":"2011-07-29T18:59:19Z","message":"<p>+1<br>Some form of easily-switchable configuration profiles would be greatly appreciated! For example, when at work one might have an external monitor, on the go it's just the laptop screen, and finally connected to the living room HDTV.</p>","replies":[]}]},{"id":"dsq-457711902","author":"Beat Wolf","deleted":false,"createdAt":"2011-07-29T15:19:05Z","message":"<p>Awesome work :) I love that multiscreen gets some love, as i use it all the time!</p><p>So one suggestion, that i know isn't easy to do. It would be nice if the display visualization was more interactive. For example, if you have 2 screens that you could drag them around to change which one is on the right or left. Right click to select the main output or deactivate/activate it (VGA, LVDS1 etc is not always easy to understand for certain users, but having the visual representation makes it much easier).</p><p>keep up the grad work!</p>","replies":[]},{"id":"dsq-457711903","author":"dhaumann","deleted":false,"createdAt":"2011-07-29T16:53:06Z","message":"<p>If you don't know what the term \"Unify Outputs\" means, I think it's hard to get the meaning right.<br>Does it mean \"Clone mode\"? Or does it mean \"Use same size for all screens\"?</p><p>There certainly is more room for improvement :-)</p>","replies":[{"id":"dsq-457711906","author":"Aurélien","deleted":false,"createdAt":"2011-07-29T20:23:56Z","message":"<p>I agree. Gnome version used to say \"Use same image on all screens\" which is more explicit in my opinion (now it says \"Mirror displays\", which I like less). Alex, if you are reading this, what do you think of this?</p>","replies":[]}]},{"id":"dsq-457711908","author":"pvandewyngaerde","deleted":false,"createdAt":"2011-07-29T21:47:35Z","message":"<p>is there a before image ?</p>","replies":[{"id":"dsq-457712532","author":"Aurélien","deleted":false,"createdAt":"2011-07-30T02:09:28Z","message":"<p>I don't have one right now, you can run \"kcmshell4 randr\" and compare. Do not expect anything really spectacular though.</p>","replies":[]}]},{"id":"dsq-457711909","author":"BajK","deleted":false,"createdAt":"2011-07-30T04:04:24Z","message":"<p>I fixed that annoying bug that the prompt upon plugging in a new monitor appeared although you had the kcm open already but it wouldn't let me cherry pick it into the 4.7 branch. Could you please change this for 4.7.1 as well?<br>The dbus Service name checked for needs to change from kcm_display (or so) to kcm_randr in randrmonitor.cpp :)</p>","replies":[{"id":"dsq-457711911","author":"Aurélien","deleted":false,"createdAt":"2011-08-01T17:04:16Z","message":"<p>Sounds good! but I am not the randr kcm maintainer so I don't feel entitled to do backports. I am not really sure who is the maintainer (I just got Alex to review mine before merging them into master), I suggest you ask on kde-core-devel mailing list.</p>","replies":[]}]},{"id":"dsq-457711910","author":"Bernhard","deleted":false,"createdAt":"2011-07-30T16:34:21Z","message":"<p>Very nice! When I saw afiestas' demo I immediately felt that moving \"Unify outputs\" to the top would improve the UI quite a bit. Thanks for implementing this so quickly :)</p><p>Despite the unclear meaning, I figure the \"Unify Outputs\" label will stay during 4.7.x for string compatibility?</p>","replies":[]},{"id":"dsq-457711912","author":"Aurélien","deleted":false,"createdAt":"2011-08-01T17:09:33Z","message":"<p>\"Unify Outputs\" is not in 4.7. It can and will be changed in master.</p>","replies":[]},{"id":"dsq-457711915","author":"Ernesto Manríquez","deleted":false,"createdAt":"2011-08-08T09:51:03Z","message":"<p>What would be amazing: UI for choosing the norm of your TV output. I tried to use TV output with Nouveau, my TV output worked well, but I needed a command to switch it from PAL-M to NTSC. Can you simplify that in your RandR KCM?</p>","replies":[]}]