[{"id":"dsq-457711416","author":"okcomputer","deleted":false,"createdAt":"2010-12-10T21:29:43Z","message":"<p>One of the best articles ever! It is currently the small things, as the those you described, that make kde not living in its full potential.</p><p>So, keep up the good work!</p>","replies":[]},{"id":"dsq-457711419","author":"Pau Garcia i Quiles","deleted":false,"createdAt":"2010-12-10T21:42:55Z","message":"<p>The problem with the new layout for KMix is it does not match the expressions we use in human language, at least in English, Spanish or Catalan. In these languages, we use the expression \"turn up/down the volume\" to mean \"increase/decrease the volume\".</p><p>In addition to that, moving the slider left is usually perceived to mean \"keep volume on the left speaker at 100% and decrease the volume on the right speaker accordingly\". Idem for moving slider right.</p><p>IMHO that makes the new layout very ununtuitive.</p>","replies":[{"id":"dsq-457712396","author":"TheBlackCat","deleted":false,"createdAt":"2010-12-10T22:16:50Z","message":"<p>There is also the issue that he mute buttons don't look like buttons, so it would not be outlandish to think that they represent the end of the slider where there is no sound.  So moving towards the right would mean reducing the volume, when it really means increasing it.  This, of course, would reverse and would be correct if the sound wasn't muted.  But it would be nice if there was some clear way to indicate which end is high volume and which end is low volume.</p>","replies":[]},{"id":"dsq-457712392","author":"Andrei","deleted":false,"createdAt":"2010-12-10T22:42:59Z","message":"<p>I agree with this. In my oppinion, in kmix the plaback devices and playback streams could be merged together. This would reduce the number of tabs to only two, which i find more manageable.</p>","replies":[]},{"id":"dsq-457712391","author":"Elvis Stansvik","deleted":false,"createdAt":"2010-12-10T22:50:13Z","message":"<p>I agree. And also I find it much easier to move the slider with high fidelity with my mouse if it is vertical. I mean it's easier to control my arm movements when moving the mouse up/down instead of right/left.</p>","replies":[]},{"id":"dsq-457711426","author":"Aurélien","deleted":false,"createdAt":"2010-12-11T03:09:25Z","message":"<p>I agree we use the expression \"turn up/down\", but on the other hand most of our real world volume controls are potentiometers (with the notable exception of mix tables). So if we were to replicate real world we would have to use <a href=\"http://doc.qt.nokia.com/4.7/qdial.html\" rel=\"nofollow noopener\" title=\"http://doc.qt.nokia.com/4.7/qdial.html\">QDial</a> widgets, which would not be very easy to use.</p><p>Horizontal sliders to adjust volumes are not a new idea. You can find them in GNOME, Mac OS X, YouTube. Maybe the slider need some muted and loud icons around them like there is on Mac OS? (See <a href=\"http://davidchambersdesign.com/application-specific-volume-control-in-mac-os-x/\" rel=\"nofollow noopener\" title=\"http://davidchambersdesign.com/application-specific-volume-control-in-mac-os-x/\">this screenshot</a>)</p><p>I personally think both orientations are usable, but KMix now comes with a few tabs. We could argue on whether all these tabs are needed but it's too late to get rid of them for KDE SC 4.6. Given this constraint, I think the interface looks better if all tabs are visible. This means the window gets quite wide. Since most tabs usually contain only one or two sliders, it makes more sense to orient them horizontally, as it makes a better use of the available space.</p>","replies":[{"id":"dsq-457711488","author":"Jan Molnár","deleted":false,"createdAt":"2010-12-12T18:22:03Z","message":"<p>I agree with the article, but I also do not agree with the horizontal slider. There are many reasons:<br>Recently I switched to PulseAudio, but before that I had a lot of sliders (10?) in each tab, horizontal sliders would be a huge wasting of space.<br>It's a little bit annoying to move the slider such a long distance (downscaling would solve it, of course).<br>It looks like a slider for left/right speaker (Pau Garcia i Quiles).<br>It’s easier to control arm movements up/down instead of right/left (Elvis Stansvik).<br>Do not consider me to be a troll, I really love the other changes you have made, but I would like to point these facts (in my opinion) to improve it a little bit more. Good job!</p>","replies":[{"id":"dsq-457711498","author":"Aurélien","deleted":false,"createdAt":"2010-12-12T19:25:29Z","message":"<p>&gt; Recently I switched to PulseAudio, but before that I had a lot of sliders (10?) in each tab, horizontal sliders would be a huge wasting of space.<br>When there are more than one sliders, they stack on top of each others so I don't see how it wastes space.</p><p>&gt; It looks like a slider for left/right speaker (Pau Garcia i Quiles).<br>Do you feel like you are adjusting the balance when adjusting the volume of a YouTube video?</p><p>&gt; It’s easier to control arm movements up/down instead of right/left<br>I would love to read a study proving this. I don't think it is so evident, otherwise all sliders in all user interfaces would be oriented vertically. I don't think it is a question of precision, but rather a question of habit: we have been using vertical sliders in mixer for years so it feels weird to try another orientation.</p>","replies":[{"id":"dsq-457711499","author":"Pau Garcia i Quiles","deleted":false,"createdAt":"2010-12-12T20:00:49Z","message":"<p>&gt; Do you feel like you are adjusting the balance when adjusting the volume of a <br>&gt; YouTube video?</p><p>In the volume control of YouTube videos there is a triangle which grows from left to right. That makes quite clear you are increasing the volume. Maybe adding that triangle is the solution for KMix?</p>","replies":[{"id":"dsq-457711504","author":"Aurélien","deleted":false,"createdAt":"2010-12-13T13:07:48Z","message":"<p>I don't see any growing triangle on YouTube volume control, but I think you mean something like the Amarok 1.4 volume slider. That could be a good idea indeed.</p>","replies":[{"id":"dsq-457711512","author":"Jan Molnár","deleted":false,"createdAt":"2010-12-13T18:56:16Z","message":"<p>I like this solution. I would also like something else which would express decreasing volume on the left side and increasing volume in the right side (the <a href=\"http://davidchambersdesign.com/application-specific-volume-control-in-mac-os-x/\" rel=\"nofollow noopener\" title=\"http://davidchambersdesign.com/application-specific-volume-control-in-mac-os-x/\">Mac OS way</a> is OK). The problem is both of these solutions are still vertically space wasting (see the Mac OS picture) which is multiplied by unused space on sides of sliders.</p>","replies":[]}]}]},{"id":"dsq-457711510","author":"Jan Molnár","deleted":false,"createdAt":"2010-12-13T14:28:52Z","message":"<p>1) Display is usually much wider than higher, in my case it is 800x1280 (and there is a horizontal panel, which cannot be also counted), having more than a few sliders would lead to vertical scrolling (which would be a pain multiplied by free space on left and right margin of the sliders).<br>2) I am used to horizontal sliders, I have been using computers for a while, in my opinion it is a quite good solution (maybe not so intuitive but space saving) bellow video box, but our case is another scenario. It is probably seen differently by new users and experienced users.<br>3) I can ask someone from our Department of Interaction, but I do not see them much often.</p>","replies":[{"id":"dsq-457711513","author":"Aurélien","deleted":false,"createdAt":"2010-12-13T22:42:28Z","message":"<p>&gt;  I can ask someone from our Department of Interaction, but I do not see them much often.<br>I would be very interested in such an information!</p>","replies":[{"id":"dsq-457711514","author":"Jan Molnár","deleted":false,"createdAt":"2010-12-14T14:52:04Z","message":"<p>Finally I wrote them an email and this morning I got a long reply. Here are some main points:<br>There are studies focused on Fitt's law (<a href=\"http://www.sciencedirect.com/science?_ob=ArticleURL&amp;_udi=B6VDC-3VR6C9B-6&amp;_user=640811&amp;_coverDate=01%2F01%2F1999&amp;_rdoc=1&amp;_fmt=high&amp;_orig=search&amp;_origin=search&amp;_sort=d&amp;_docanchor=&amp;view=c&amp;_searchStrId=1578490913&amp;_rerunOrigin=google&amp;_acct=C000032309&amp;_version=1&amp;_urlVersion=0&amp;_userid=640811&amp;md5=37d6e4dbfcab42121bd558c0a3ca78fc&amp;searchtype=a\" rel=\"nofollow noopener\" title=\"http://www.sciencedirect.com/science?_ob=ArticleURL&amp;_udi=B6VDC-3VR6C9B-6&amp;_user=640811&amp;_coverDate=01%2F01%2F1999&amp;_rdoc=1&amp;_fmt=high&amp;_orig=search&amp;_origin=search&amp;_sort=d&amp;_docanchor=&amp;view=c&amp;_searchStrId=1578490913&amp;_rerunOrigin=google&amp;_acct=C000032309&amp;_version=1&amp;_urlVersion=0&amp;_userid=640811&amp;md5=37d6e4dbfcab42121bd558c0a3ca78fc&amp;searchtype=a\">Analysis of cursor movements with a mouse</a>, <a href=\"http://www.sciencedirect.com/science?_ob=ArticleURL&amp;_udi=B6VDC-3VWPYGJ-B&amp;_user=640811&amp;_coverDate=12%2F31%2F1996&amp;_rdoc=1&amp;_fmt=high&amp;_orig=search&amp;_origin=search&amp;_sort=d&amp;_docanchor=&amp;view=c&amp;_searchStrId=1578499853&amp;_rerunOrigin=google&amp;_acct=C000032309&amp;_version=1&amp;_urlVersion=0&amp;_userid=640811&amp;md5=fe6fb219e570c0b18e499049a67472cf&amp;searchtype=a\" rel=\"nofollow noopener\" title=\"http://www.sciencedirect.com/science?_ob=ArticleURL&amp;_udi=B6VDC-3VWPYGJ-B&amp;_user=640811&amp;_coverDate=12%2F31%2F1996&amp;_rdoc=1&amp;_fmt=high&amp;_orig=search&amp;_origin=search&amp;_sort=d&amp;_docanchor=&amp;view=c&amp;_searchStrId=1578499853&amp;_rerunOrigin=google&amp;_acct=C000032309&amp;_version=1&amp;_urlVersion=0&amp;_userid=640811&amp;md5=fe6fb219e570c0b18e499049a67472cf&amp;searchtype=a\">Effects of angle of approach on cursor movement with a mouse: Consideration of Fitts' law</a>), which don't prove my statement. I was probably wrong, but these studies are focused on <a href=\"http://en.wikipedia.org/wiki/Fitts%27s_law\" rel=\"nofollow noopener\" title=\"http://en.wikipedia.org/wiki/Fitts%27s_law\">Fitts' law</a> which is not exactly the same, we are talking about (Fitts' law is focused on many criterion, but we have another metrics - e.g. we need to be more precise).<br>Horizontal movements seems to be faster.<br>There is a significant difference between horizontal/vertical and diagonal movements.<br>My hypothesis could be backed up by the fact, that we use only fingers (thumb, ring/little finger) for vertical movements and the whole wrist for horizontal movements.</p>","replies":[{"id":"dsq-457712409","author":"Aurélien","deleted":false,"createdAt":"2010-12-15T02:02:08Z","message":"<p>Thanks a lot for sharing this information. Too bad the article are not available for free. I am considering purchasing them.</p>","replies":[]}]}]}]}]}]}]},{"id":"dsq-457711437","author":"Mark","deleted":false,"createdAt":"2010-12-11T05:20:20Z","message":"<p>I think you meant to say.. moving a slider toward the right is \"increasing\" the volume.  To the left means decreasing the volume.  I have no issue with up/down or increase/decrease.  To me they are the same.  This from a native US English speaker.</p>","replies":[]},{"id":"dsq-457711483","author":"Maxoud","deleted":false,"createdAt":"2010-12-12T14:54:20Z","message":"<p>I agree with that. Also as I know all audio hardware normally have vertical sliders.</p><p>Great article, Aurélien! Hats off!</p><p>Unfortunately, tweaking KDE little by little is time consuming everyday work. But KDE's advantage is that it's easy tweakable at all.</p>","replies":[]}]},{"id":"dsq-457711417","author":"annma","deleted":false,"createdAt":"2010-12-10T21:50:44Z","message":"<p>If you run KDE in French you will immediately spot the bad dialogs. Look at that one for example <a href=\"http://bugsfiles.kde.org/attachment.cgi?id=53938\" rel=\"nofollow noopener\" title=\"http://bugsfiles.kde.org/attachment.cgi?id=53938\">http://bugsfiles.kde.org/at...</a><br>I fixed a few layouts recently in kcm where labels for example were not set properly in Qt Designer. Maybe one next post should be about layouting in Designer...<br>The worse are too big or too high dialogs. KPresenter opens with a window higher than my laptop high. Some translated dialogs gets too wide, some columns too large,...<br>It's nice to have a blog to make devels conscious of those traps!</p>","replies":[{"id":"dsq-457711429","author":"Aurélien","deleted":false,"createdAt":"2010-12-11T03:15:36Z","message":"<p>Indeed, running KDE under another language is a good advice (which I must confess I should follow more often). The example you gave is edifying, I think you should blog about it!</p><p>I plan to write a post about reducing waste of space in dialogs, which can be help to keep them to a reasonable size, even if it does not solve all problems.</p>","replies":[{"id":"dsq-457711442","author":"Markus","deleted":false,"createdAt":"2010-12-11T07:36:39Z","message":"<p>\"Indeed, running KDE under another language is a good advice (which I must confess I should follow more often)\"</p><p>Developers should always set their workspace language to \"x-test\". It simply adds \"xx\" at the beginning and end of every string.</p><p>\"I plan to write a post about reducing waste of space in dialogs, which can be help to keep them to a reasonable size, even if it does not solve all problems.\"</p><p>Mac OS X's preference windows resize automatically. Firefox also has that feature when \"browser.preferences.animateFadeIn\" is set to true (performance is bad under Linux, though, but still gives the right idea when one doesn't know Mac OS X).<br>That has the advantage that dialogs grow accordingly when a language has longer strings.<br>Wasted space is also usually not a problem then.</p>","replies":[]}]}]},{"id":"dsq-457711411","author":"TheBlackCat","deleted":false,"createdAt":"2010-12-10T22:21:12Z","message":"<p>It would be nice of the column view automatically resized to make the sort column as easy to read as possible.  And it would be nice if it never automatically made columns larger than needed to view the text, as it does with Date and Unread here, unless it doesn't have enough text to fill each cell in the row.</p><p>Is it possible to make Akregator show the unread count in the same cell as the feed (in parentheses, perhaps) if the unread column is hidden?</p>","replies":[]},{"id":"dsq-457711409","author":"thorGT","deleted":false,"createdAt":"2010-12-10T22:57:06Z","message":"<p>And you DO get this in? Oh, the status of a hired (official) developer must change a lot in this world, really. I wouldn't even dare post any of these changes for request, especially when it comes to the kdelibs module, myself. Do you create a review request for that or simply get it in without any review or asking anybody first, btw? That's really interesting to me.</p>","replies":[{"id":"dsq-457712386","author":"Aurélien","deleted":false,"createdAt":"2010-12-11T01:12:14Z","message":"<p>I think you are mistaken. First, the KMix changes are not in, I sent a patch to the main developer, waiting for his approval. Second, my job has nothing to do with this. The work I did on KMix was done on my free time.<br>As for how I work, pretty much like every other contributor: when there is a reviewboard group for the project I am working on I create a review request, otherwise I send a patch to the author. If the fix is really obvious I may commit it directly, CC'ing the author of the change.</p>","replies":[]}]},{"id":"dsq-457711412","author":"Robert Knight","deleted":false,"createdAt":"2010-12-10T22:58:20Z","message":"<p>Hi Aurelien,</p><p>For the columns, we implemented a variation of QHeaderView that supports the concept of 'stretch factors' that are seen in Qt's layouts, this lets us specify that space should be divided up in certain proportions within the current viewport space (eg. 1/3rd, 1/3rd, 1/6th, 1/6th).  If the user resizes the header manually, the proportions are saved rather than the actual size, so if the viewport size changes, the saved proportions are applied to the new viewport size.</p><p>Code at <a href=\"http://www.mendeley.com/client/libMendeley-0.9.5.tar.bz2\" rel=\"nofollow noopener\" title=\"http://www.mendeley.com/client/libMendeley-0.9.5.tar.bz2\">http://www.mendeley.com/cli...</a></p>","replies":[{"id":"dsq-457711430","author":"Aurélien","deleted":false,"createdAt":"2010-12-11T03:20:08Z","message":"<p>Thanks for sharing Robert. Stretch factors is something I was surprised was not implemented in header views, given that such a concept exists in layouts. I will have a look at it, but this may probably be too intrusive for 4.6.</p>","replies":[{"id":"dsq-457711453","author":"Jan Kundrát","deleted":false,"createdAt":"2010-12-11T17:26:09Z","message":"<p>You might be interested in the <a href=\"http://libqxt.bitbucket.org/doc/0.6/qxtheaderview.html\" rel=\"nofollow noopener\" title=\"http://libqxt.bitbucket.org/doc/0.6/qxtheaderview.html\">QxtHeaderView</a> class.</p>","replies":[]}]}]},{"id":"dsq-457711408","author":"Stefan","deleted":false,"createdAt":"2010-12-10T23:50:27Z","message":"<p>For part 2, I suggest the following topic: \"Over-engineered tab widgets\". On my system, KMix (4.6) offers three tab designs: \"Playback devices\", \"Capture devices\", \"All devices\". In this case, it would be much easier to just have two static tabs. Or, better yet, some interface that allows you to collapse the uninteresting categories, because that accommodates the \"All devices\" view as well.</p>","replies":[{"id":"dsq-457712387","author":"Stefan","deleted":false,"createdAt":"2010-12-10T23:53:45Z","message":"<p>Seems like wordpress ate my closing irony tag &lt;/irony&gt; at the end of the first sentence.</p>","replies":[]},{"id":"dsq-457711433","author":"Aurélien","deleted":false,"createdAt":"2010-12-11T03:22:19Z","message":"<p>Interestingly my 4.6 KMix does not have \"All devices\", it has the tabs you can see on my screenshot. See my answer to Pau Garcia regarding reworking the tabs (executive summary: not really something which can be done for 4.6)</p>","replies":[]}]},{"id":"dsq-457711406","author":"apol","deleted":false,"createdAt":"2010-12-11T00:16:31Z","message":"<p>The correct way to provide a default size is to reimplement QWidget::sizeHint, not to call resize... at least it's what i've always seen in the doc and in the end, it makes sense.</p>","replies":[{"id":"dsq-457711424","author":"Aurélien","deleted":false,"createdAt":"2010-12-11T02:56:51Z","message":"<p>You are right. I reworked this paragraph to only mention sizeHint(). It should be more accurate now.</p>","replies":[{"id":"dsq-457711473","author":"Parker","deleted":false,"createdAt":"2010-12-11T19:55:59Z","message":"<p>Since we're talking about initial default window sizes, an even simpler solution than reimplementing sizeHint() is to just pass a default size to KXmlGuiWindow::setupGui(). This size is used when the launching an app the first time with an empty configuration. Of course setting a size hint might also be a good idea, but in many cases giving a default size is enough, if your app is KXmlGuiWindow based.</p>","replies":[{"id":"dsq-457712401","author":"Aurélien","deleted":false,"createdAt":"2010-12-11T20:01:40Z","message":"<p>Interesting, thanks for your comment.</p>","replies":[]}]}]}]},{"id":"dsq-457711401","author":"kriko","deleted":false,"createdAt":"2010-12-11T00:16:47Z","message":"<p>Those are neat and very welcome changes.<br>Will the kmix change be part of 4.6 release?</p>","replies":[]},{"id":"dsq-457711403","author":"John van Spaandonk","deleted":false,"createdAt":"2010-12-11T01:10:09Z","message":"<p>Aurelian,</p><p>I am normally not one to reply to blogs.<br>This is the exception.<br>I really thank you for bringing these matters to a broader attention.<br>A wrong default size is only one of kmix's problems.<br>It also does not remember the size (kde 4.5 beta 2)<br><a href=\"https://bugs.kde.org/show_bug.cgi?id=253913\" rel=\"nofollow noopener\" title=\"https://bugs.kde.org/show_bug.cgi?id=253913\">https://bugs.kde.org/show_b...</a></p><p>And it would be extremely useful if it does not pop up in some random place<br>on the screen. I fully expect such things to behave like the calendar<br>widget, which stays above the clock button.</p><p>Thanks again for this work. I prefer for the kde developers to clean up<br>the basis use cases, about one thousand times more than working on<br>new blingbling...</p><p>John</p>","replies":[{"id":"dsq-457711491","author":"Jan Molnár","deleted":false,"createdAt":"2010-12-12T18:27:19Z","message":"<p>&gt; \"... pop up in some random place on the screen...\"<br>It is probably caused by this bug <a href=\"https://bugs.kde.org/show_bug.cgi?id=253858\" rel=\"nofollow noopener\" title=\"https://bugs.kde.org/show_bug.cgi?id=253858\">https://bugs.kde.org/show_b...</a> (please, confirm it if you have the same problem).</p>","replies":[]},{"id":"dsq-457711503","author":"Andrew","deleted":false,"createdAt":"2010-12-13T10:31:37Z","message":"<p>\"Thanks again for this work. I prefer for the kde developers to clean up<br>the basis use cases, about one thousand times more than working on<br>new blingbling…\"</p><p>Fortunately it doesn't matter what you prefer. The KDE developers aren't paid and are doing this for fun and to hack on what interests them. So if you find something that _your_ interested in, it would be more useful if _you_ actually fixed it,  instead of trying to tell other people what to do with their spare time.</p><p>I think these kind of comments are actually quite rude.  It's like your neighbor offering to mow your lawn while she's doing hers and you saying \"That's great but I'd prefer you to clean my gutters\"</p>","replies":[{"id":"dsq-457711509","author":"Aurélien","deleted":false,"createdAt":"2010-12-13T13:11:47Z","message":"<p>&gt; I think these kind of comments are actually quite rude.<br>Actually I think your comment is rude. Sure, nobody should try to force developers to work on something they are not interested in, but that does not mean people shouldn't be allowed to express their opinion on what they think is needed for KDE, even if they are not developers.</p>","replies":[]}]}]},{"id":"dsq-457711420","author":"John van Spaandonk","deleted":false,"createdAt":"2010-12-11T01:13:02Z","message":"<p>And pardon me for misspelling your name :-)</p>","replies":[]},{"id":"dsq-457711421","author":"Roland","deleted":false,"createdAt":"2010-12-11T01:51:17Z","message":"<p>In addition, when you choose a feed in Akregator and click on the first item in that feed, you had better be careful, because if you are off just a little bit, BOOM!, all the articles get resorted by Title. Surprise!</p>","replies":[{"id":"dsq-457711497","author":"Jan Molnár","deleted":false,"createdAt":"2010-12-12T18:39:43Z","message":"<p>This happens to me almost every day. To get it sorted I have to click to 'Date' twice, which is also not too pleasant. The fact is, I do not know how to fix it the most usable way.<br>Adding extra space within item and sorters would look strange in case of larger space (and moreover it would waste space) and little space would not solve the problem.<br>A better solution would be making sorters only out of the arrows on them, but it could be a little bit confusing to those used to click on column titles. I am getting to like this solution more and more.</p>","replies":[]}]},{"id":"dsq-457711432","author":"DanaKil","deleted":false,"createdAt":"2010-12-11T03:34:10Z","message":"<p>It's great that you point out these size problems, thank you :)</p><p>And my 2 cents : about KMix and the new layout, I always found that vertical sliders are more intuitive for volume (\"up\" and \"down\") whereas horizontal sliders are better for time representation</p>","replies":[{"id":"dsq-457711468","author":"Stefan","deleted":false,"createdAt":"2010-12-11T19:29:41Z","message":"<p>This can be observed best with the \"Now playing\" applet. Its interface consists of the four usual playback buttons (back, forward, play/pause, stop) and two untitled sliders. Because one of the sliders is horizontal and the other one vertical, one can immediately identify which of both is for the volume and which for the playback position/time.</p>","replies":[{"id":"dsq-457711472","author":"Aurélien","deleted":false,"createdAt":"2010-12-11T19:54:23Z","message":"<p>I personally always thought this applet looked really ugly with this vertical slider. Especially since it tries to look like a media player. I personally would have layouted the bottom of the applet like this:</p><p></p><pre>( &lt; ) ( || ) ( &gt; ) @ [==|----]<br>[======|---------------------]<br></pre><p></p><p>Where @ is a small speaker icon (which could also double as a mute button!)</p>","replies":[{"id":"dsq-457711500","author":"g","deleted":false,"createdAt":"2010-12-13T00:20:28Z","message":"<p>Aurélien, I agree with you.</p>","replies":[]}]}]}]},{"id":"dsq-457711435","author":"Volker","deleted":false,"createdAt":"2010-12-11T05:07:56Z","message":"<p>You are right with the bad default sizes, and I always suffered from the default width of the kmix window, which is reset at each call, which is very annoying with many tabs and volume sliders. But I hope, that I still can display them vertically. I invested much work for kde-4.5 to make the vertical view beautiful, and don't like the horizontal view. kmix was always capable to switch between both. although I would not mind, if the _default_ change.</p>","replies":[{"id":"dsq-457711445","author":"Aurélien","deleted":false,"createdAt":"2010-12-11T14:53:51Z","message":"<p>Yes, this changes the default orientation. If the patch is accepted you will still be able to make the sliders vertical again.</p>","replies":[]}]},{"id":"dsq-457711440","author":"Carlos Licea","deleted":false,"createdAt":"2010-12-11T05:39:36Z","message":"<p>Great! We need more people that care for the small details. Those are the ones people remember. Thank you!</p>","replies":[]},{"id":"dsq-457711443","author":"damipereira","deleted":false,"createdAt":"2010-12-11T08:04:38Z","message":"<p>Really nice you pointed out these issues, I've always had to re-arrange the wholke akregator gui before I could use it, about the slider in kmix, I also feel up/down felt better, but entering the mixer is not something really common, at least for me, I always change volume from the little slider on the tray.<br>Anyway I think the horizontal sliders can be improved by  putting a button with a mute icon and the word \"mute\" on the left, and a icon with a speaker with 3 lines at the right.</p>","replies":[]},{"id":"dsq-457711444","author":"IAnjo","deleted":false,"createdAt":"2010-12-11T14:20:34Z","message":"<p>I just noticed: what is a \"new tab\" button on kmix supposed to do?</p><p>The only thing that comes to mind is that because the tabs are closeable, that way you can open them again, but if that is the case, isn't it easier to remove the button and not make the tabs closeable?<br>(If it's really needed, move that config into the configuration dialog, instead of being right there.)</p><p>Also, maybe less text could be used if the tabs had icons: instead of playback/capture devices you could have just playback/capture with a hardware icon, and instead of playback/capture streams maybe just playback/capture with a musical note or something?</p><p>Thanks for all your hard work!</p>","replies":[]},{"id":"dsq-457711446","author":"tk","deleted":false,"createdAt":"2010-12-11T15:15:40Z","message":"<p>Finally somebody notices this. I love KDE and I \"spread the word\" but the badly chosen default size is really annoying. One thing that bugs me the most is the default size of the \"Create from template\"-dialogue from KOffice / now Calligra. It easily fills a 20\" screen and is almost empty. This odd behaviour is present from version 1.4 and is still around... :-(</p>","replies":[]},{"id":"dsq-457711449","author":"Dario","deleted":false,"createdAt":"2010-12-11T17:10:00Z","message":"<p>Now, THIS is what we need. Keep it up!</p>","replies":[]},{"id":"dsq-457711450","author":"Jan Kundrát","deleted":false,"createdAt":"2010-12-11T17:18:21Z","message":"<p>Dear Aurelien, it was cool to read the article, up from the very first sentecne almost to the end. I absolutely agree that it takes time to set up size hints properly, and was caught by how hard is to set up a QListView reasonably. BTW, it's really recommended to call setUniformRowHeights() if you use lazy loading from the model).</p><p>However, I do have a serious problem with the proposed redesign of KMix. Isn't <a href=\"http://dev.gentoo.org/~jkt/tmp/kmix.png\" rel=\"nofollow noopener\" title=\"http://dev.gentoo.org/~jkt/tmp/kmix.png\">this screenshot</a> a much more reasonable one?</p><p>I have quite a lot of volume sliders, because that's what my simple integrated audio card offers. The window should indeed be wide enough, but rotating the sliders doesn't look like a good approach to me.</p><p>As of a QDial -- we're designing an application for a computer, not a physical device. It's sompletely normal to grab a physical gnob by two fingers and tweak it, but completely alien to do the same with a QDial. Oh, and all of the professioal audio equipment where one has to move several \"knobs\" would use linear (in the geometric sense, not in actual gain/attenuation) controls.</p>","replies":[{"id":"dsq-457711455","author":"Aurélien","deleted":false,"createdAt":"2010-12-11T17:42:53Z","message":"<p>I dislike that KMix screenshot: it mixes horizontal and vertical text, columns have varying width... When KMix is setup to display all those options, I always prefer horizontal sliders.</p><p>Since we use PulseAudio by default nowadays, all those options are gone (I guess you can probably get them back if you use a different audio backend). In PulseAudio world I think both orientations work, even if I prefer horizontal.</p>","replies":[{"id":"dsq-457711459","author":"Markus","deleted":false,"createdAt":"2010-12-11T18:16:46Z","message":"<p>Have you looked into VeroMix? It's a Plasmoid that for PA users should be able to replace KMix for most cases.</p>","replies":[{"id":"dsq-457712397","author":"Aurélien","deleted":false,"createdAt":"2010-12-11T18:37:26Z","message":"<p>Interesting. I like the fact that it uses horizontal sliders! However my goal here was to compensate for saying nasty things about KMix by trying to improve it, not to switch to another application :)</p>","replies":[{"id":"dsq-457712402","author":"Markus","deleted":false,"createdAt":"2010-12-11T21:18:22Z","message":"<p>Well, KMix has two use cases: As drop down applet and as full-blown mixing application.<br>Your changes (which I like!) only affect the latter portion of KMix.<br>This still leaves the applet in the same state as before: Vertical slider (inconsistent with the full application) and also not following Plasma's theme which makes KMix look out of place next to the device notifier.</p><p>My comment was intended as subtle suggestion to ship VeroMix with Kubuntu as Kubuntu uses PA.</p>","replies":[]}]}]},{"id":"dsq-457711470","author":"Stefan","deleted":false,"createdAt":"2010-12-11T19:31:28Z","message":"<p>No PulseAudio running here on openSUSE.</p>","replies":[{"id":"dsq-457711477","author":"Markus","deleted":false,"createdAt":"2010-12-11T21:21:10Z","message":"<p>Same here. Doesn't change the fact that VeroMix is worth a look for those people who use PA.</p>","replies":[]}]}]}]},{"id":"dsq-457711457","author":"Psychotron","deleted":false,"createdAt":"2010-12-11T17:44:53Z","message":"<p>While I can't agree more with the problems you identified (you have to resize a lot with KDE), the suggested solution for KMix looks... weird. The originial sliders might be too small, but now they are pretty long. I also think it's a lot more common to have those mixers vertically laid out. Btw. what about the main mixer popup? It should have the same orientation as the other mixers. Also note that you seem to use PA. With this (crap) removed and only ALSA you have a lot more controls per tab, so you might get height problems with these small 16:9 displays used nowadays.</p>","replies":[{"id":"dsq-457711462","author":"Aurélien","deleted":false,"createdAt":"2010-12-11T18:50:56Z","message":"<p>&gt; The originial sliders might be too small, but now they are pretty long.<br>I agree, they could probably use a bit of extra padding.</p><p>&gt; I also think it’s a lot more common to have those mixers vertically laid out.<br>The only other environment I know of which has vertical sliders is Windows, Mac OS X and GNOME use horizontal sliders nowadays.</p><p>&gt; what about the main mixer popup? <br>A bit out of my scope for now: I was just interested in fixing the default size of KMix window</p><p>&gt; With this (crap) removed and only ALSA you have a lot more controls per tab, so you might get height problems with these small 16:9 displays used nowadays.<br>If your mixer is so complex that horizontal sliders and controls for it does not fit in say 600px (typical netbook vertical resolution), then I think you will have a hard time finding your way if KMix uses vertical sliders, and you will spend a lot of time tilting your head 90° to read the rotated texts.</p><p>In the worst case, the mix window could show a vertical scrollbar to solve this issue.</p>","replies":[]}]},{"id":"dsq-457711461","author":"Matthias Welwarsky","deleted":false,"createdAt":"2010-12-11T18:39:53Z","message":"<p>The sliders are a bit too long for my liking. It requires a lot of mouse movements to reach the min and max. I usually prefer to require only moderate movement with the mouse to cover the full range of slider controls.<br> Also, the layout looks \"stretched\" to me, like desperately trying to fill the available space. Adding a bit of unused area usually gives a lighter, easier impression.</p><p>What paradigm do you follow for adjusting the sliders? Coarse with mouse, fine with wheel, or vice versa?</p>","replies":[{"id":"dsq-457711464","author":"Aurélien","deleted":false,"createdAt":"2010-12-11T18:52:42Z","message":"<p>&gt; Also, the layout looks “stretched” to me, like desperately trying to fill the available space. Adding a bit of unused area usually gives a lighter, easier impression.<br>I agree. It would probably be nicer to define a max width and center the sliders in the available space. I might give it a try.</p><p>&gt; What paradigm do you follow for adjusting the sliders? Coarse with mouse, fine with wheel, or vice versa?<br>I don't know, I do not maintain KMix :)</p>","replies":[{"id":"dsq-457711478","author":"damipereira","deleted":false,"createdAt":"2010-12-11T22:57:08Z","message":"<p>Maybe just removing the close buttons, and the new tab button would help making the window less wide, and so help with this \"streched\" feeling. Another option would be to reduce text, maybe putting together, streams in 1 tab and devices in another one? Also it might be a good idea to make sliders more narrow vertically by putting the label of the name on the left of the slider not above it.</p>","replies":[]}]}]},{"id":"dsq-457711466","author":"bilgisayar teknik servis","deleted":false,"createdAt":"2010-12-11T19:26:48Z","message":"<p>The originial sliders might be too small, but now they are pretty long.<br>I agree, they could probably use a bit of extra padding.</p>","replies":[]},{"id":"dsq-457711474","author":"Benoit Jacob","deleted":false,"createdAt":"2010-12-11T20:46:50Z","message":"<p>Great work! If you are interested in fixing more KDE dialogs, a very important one is the Desktop Settings dialog. Under Wallpaper, select Type-&gt;Mandelbrot. The default window size does not allow for all the explanatory text to fit, so it's truncated.</p>","replies":[]},{"id":"dsq-457711482","author":"Gres","deleted":false,"createdAt":"2010-12-11T23:21:17Z","message":"<p>Thank you! Polishing the interface is very important!<br>A computer is better if it is easy to use, than complicated.</p><p>Sure no everybody wants the volume sliders to be horizontal or vertical, but what is better? <br>I believe that if in Mac OS X, the volume sliders are horizontal, it is the right way to go, because Apple has many usability experts, sure they know that is better for this.</p>","replies":[{"id":"dsq-457712406","author":"IAnjo","deleted":false,"createdAt":"2010-12-11T23:43:38Z","message":"<p>I would caution against doing some change \"because that's what apple does\".<br>After all the free desktop should not be OSX for cheapskates, but the best of its kind.</p>","replies":[{"id":"dsq-457712408","author":"Gres","deleted":false,"createdAt":"2010-12-14T02:57:01Z","message":"<p>Yes, the best, but the Apple product are very easy to use, the interface is polished. It is a good example to learn something about, especially since they have many usability experts and artists for the interface. I'm not speaking about Apple hardware, that's another story.</p>","replies":[]}]}]},{"id":"dsq-457711487","author":"Kappa","deleted":false,"createdAt":"2010-12-12T16:17:36Z","message":"<p>&gt; You may think “Why should I care? It is really easy to resize a window or a column!”</p><p>I do, indeed! And while I do, I also wonder why don't you set up to fix a couple of bugs related to Gwenview, including its integration in Konqueror, for example. Actually, we do care about those a tiny bit more than cosmetic trifles. Thanks for listening!</p>","replies":[{"id":"dsq-457712405","author":"Aurélien","deleted":false,"createdAt":"2010-12-12T17:35:01Z","message":"<p>&gt; I also wonder why don’t you set up to fix a couple of bugs related to Gwenview, including its integration in Konqueror<br>What is wrong with Konqueror integration?</p>","replies":[]}]},{"id":"dsq-457711502","author":"g","deleted":false,"createdAt":"2010-12-13T00:46:40Z","message":"<p>Thank you very much for your efforts and for this post. I fully agree that the default size of the window should be decent and a lot of developers neglect this fact (I sometimes forget it myself until I there is a bug report that my app crashes on first startup and then I remove my configurations to find out that this is indeed true and furthermore the default size of my window, the splitters, dock widgets, ... is not good).</p><p>However, I find it hard to find the right sizes, because for example in one app I have a text editor and I want it to be large enough to be approximately 80 characters wide and 20 lines high. How do you that if you don't know the font size in advance? How can you ensure that the size of a window (or part of it like a text editor) doesn't exceed the screen size? How to choose the size of a label when you know that in other languages the text in the label will be (much) longer?</p>","replies":[]},{"id":"dsq-457711515","author":"Mick","deleted":false,"createdAt":"2010-12-17T02:28:53Z","message":"<p>Good job. Now there are only 998 cases like this left in KDE that need to be fixed. In effect, all these horrible defaults are what made me switch to Ubuntu where things just work out of the box. This is sad since KDE is technically superior.</p>","replies":[]},{"id":"dsq-457711518","author":"monex.com","deleted":false,"createdAt":"2010-12-22T05:09:44Z","message":"<p>This is possible by specifying 2 as the fourth argument to QGridLayout addWidget ..When you use a layout you dont need to pass a parent when constructing the child widgets. The Basic Layouts example uses this feature to create a complex dialog..</p>","replies":[{"id":"dsq-457712411","author":"Aurélien","deleted":false,"createdAt":"2010-12-22T14:05:27Z","message":"<p>Not sure what you are referring to. Can you give more context?</p>","replies":[]}]},{"id":"dsq-457711519","author":"the dsc","deleted":false,"createdAt":"2011-10-13T09:02:48Z","message":"<p>Just renaming the .kde folder to something like .kde-custom saves so much trouble if someone has made lots of customizations to the KDE interface. And it's in effect a \"backup\", only without all the wasted time copying what needs only to be renamed. \"Ok, that was how deault KDE looks like, I didn't remember. Wow, huge fonts and huge icons all around, instead of the narrow fonts and detailed lists any sane person would prefer. Hum. Ok, back to how things should be. Rm .kde, mv .kde-back .kde\"</p>","replies":[]}]