[{"id":"dsq-1609697619","author":"Eyad (CTown)","deleted":false,"createdAt":"2014-09-28T18:48:50Z","message":"<p>Nice, these shortcuts seem very consistent. I feel these shortcuts fit in well with the recent initiatives to make Plasma all around consistent.</p><p>Also, would that leave \"ctrl\" (and \"ctrl+shift\") for applications only? </p>","replies":[{"id":"dsq-1609766211","author":"Aurélien Gâteau","deleted":false,"createdAt":"2014-09-28T19:49:31Z","message":"<p>Yes, my idea is that all global shortcuts must use the Win modifier and apps must not. This reduces the conflict risks.</p>","replies":[]}]},{"id":"dsq-1609705723","author":"Victor Varvariuc","deleted":false,"createdAt":"2014-09-28T18:56:12Z","message":"<p>+1. I also use Win+Left mouse click to move windows and Win+L to lock session.</p>","replies":[]},{"id":"dsq-1609724929","author":"XuetianWeng","deleted":false,"createdAt":"2014-09-28T19:13:31Z","message":"<p>meta + left / right / up are being used to tiling to left / tiling to right / maximize on other platforms (windows, gnome). I think we should follow that instead of using a different meaning.</p>","replies":[{"id":"dsq-1609767511","author":"Aurélien Gâteau","deleted":false,"createdAt":"2014-09-28T19:50:39Z","message":"<p>I like this idea as well, and it probably makes sense as a default because virtual desktops are for more \"advanced\" users, but I use them a lot so this setup suits me well.</p>","replies":[]}]},{"id":"dsq-1609735501","author":"Roy Bellingan","deleted":false,"createdAt":"2014-09-28T19:23:02Z","message":"<p>I use a similar setup, I've added win + b and nearby key for amarok.<br>But for window handling I use altr + ...</p>","replies":[]},{"id":"dsq-1609750741","author":"lemondawn","deleted":false,"createdAt":"2014-09-28T19:36:22Z","message":"<p>I have a heavy-keyboard setup as well, although quite different to yours:<br>win+left - move window to left (on the same desktop); same for other arrows<br>win+home/end - tile window on the left/right half<br>win+insert/delete/pageup/pagedn - tile window on the 1/4 of the screen topleft/bottomleft/...<br>win+space/m - maximize/minimize<br>win+number - switch to a VD<br>win+alt+number - move current window to a VD</p>","replies":[]},{"id":"dsq-1609835899","author":"Bugreporter","deleted":false,"createdAt":"2014-09-28T20:45:10Z","message":"<p>I have created a shortcut to search for the currently selected/clipboad text in the pubmed databse (scientific literature database). The command string is:</p><p>&gt; firefox \"<a href=\"http://www.ncbi.nlm.nih.gov/pubmed/?term=\" rel=\"nofollow noopener\" title=\"http://www.ncbi.nlm.nih.gov/pubmed/?term=\">http://www.ncbi.nlm.nih.gov...</a>`qdbus org.kde.klipper /klipper getClipboardContents`\"</p><p>This is very handy and worked very well for me. It should work with any other search engine/URL, too.</p>","replies":[]},{"id":"dsq-1609843772","author":"DanaKil","deleted":false,"createdAt":"2014-09-28T20:52:51Z","message":"<p>\"There is a logical link between a shortcut and its meaning. For example, the shortcut to maximize a window is Win + M\"<br>This is not a new problem but this only works with language for which the action begins with a \"M\" of course. Do you thinks that shortcuts must be localized or is this even possible ?</p><p>Otherwise, I like your shortcuts. Maybe you could export your settings so that other people can play with this new set ?</p><p>And the first and only keyboard shortcut change I really need for each new KDE install is \"ctrl+space\" for KRunner but your \"win+space\" fits perfectly my needs too.</p>","replies":[{"id":"dsq-1609897533","author":"Aurélien Gâteau","deleted":false,"createdAt":"2014-09-28T21:24:57Z","message":"<p>Indeed, M for Maximize does not work for all languages, but I don't think it's a good idea to localize shortcuts, as it would means retraining when you use a computer set up for another language and it would make it harder for developers to choose shortcuts. With this in mind, maybe GNOME shortcuts (Win + Left: maximize left, Win + Up: maximize, Win + Right, maximize right) are more universal.</p>","replies":[{"id":"dsq-1611546605","author":"Jos Poortvliet","deleted":false,"createdAt":"2014-09-29T20:38:18Z","message":"<p>Yes, those are very logical and simple, I use them too...</p>","replies":[]}]}]},{"id":"dsq-1610115400","author":"Aleix Pol","deleted":false,"createdAt":"2014-09-28T23:42:10Z","message":"<p>I think that the maximize shortcut is vital, it has completely enhanced my workflow. On the other hand I never minimize.</p><p>Regarding using Win+OtherKey, I like it too. I'm unsure what's the correct way to introduce that without messing up with people's workflows.</p>","replies":[]},{"id":"dsq-1610288827","author":"Danni Coy","deleted":false,"createdAt":"2014-09-29T03:19:38Z","message":"<p>I use the win+space combo for run -<br>I also use win+tilde for yakuake</p>","replies":[]},{"id":"dsq-1610405834","author":"Sudhir Khanger","deleted":false,"createdAt":"2014-09-29T06:40:24Z","message":"<p>Plasma has a very weird Keyboard setting. Application Keyboard Shortcuts are in fact global as they work across applications. And Global Keyboard shortcuts are for individual applications. I don't know why that it.</p><p>Something like should be adopted by Plasma and applications.</p>","replies":[{"id":"dsq-1611551689","author":"Jos Poortvliet","deleted":false,"createdAt":"2014-09-29T20:41:42Z","message":"<p>The application keyboard shortcuts configure the keyboard behaviour *in* applications, hence the name. The global ones act global - no matter what application you are in, but various workspace components have them so you have to switch between them to configure them. I am not saying it is great logic, just saying there is some 😎</p><p>Yes, it can use some work...</p>","replies":[{"id":"dsq-1611560171","author":"Sudhir Khanger","deleted":false,"createdAt":"2014-09-29T20:47:49Z","message":"<p>Not going to happen until Wayland. I read the mailing list discussion about using Meta keys as a trigger for KRunner which current Plasma doesn't support and developer point of view was that X11 just doesn't have a novel solution for this problem.</p>","replies":[{"id":"dsq-1612175017","author":"Aurélien Gâteau","deleted":false,"createdAt":"2014-09-30T07:19:51Z","message":"<p>If I am not mistaken, Wayland is needed to be able to use Meta as a plain key instead of a modifier, so that you can press Meta alone and trigger something. Wayland is not needed to be able to use Meta as a modifier for Plasma global shortcuts.</p>","replies":[{"id":"dsq-1612186359","author":"Sudhir Khanger","deleted":false,"createdAt":"2014-09-30T07:40:34Z","message":"<p>That is correct.</p>","replies":[]}]}]}]}]},{"id":"dsq-1610451079","author":"Heiko Tietze","deleted":false,"createdAt":"2014-09-29T08:00:41Z","message":"<p>It makes sense to combine meta with window management, absolutely. But in case of meta+tab to switch between windows, I would miss the trilogy with alt+tab and ctrl+tab (mdi/tab switch). And how to toggle through activities? (perhaps AltGr+Tab *g*)</p>","replies":[{"id":"dsq-1610678321","author":"Aurélien Gâteau","deleted":false,"createdAt":"2014-09-29T11:43:08Z","message":"<p>Regarding activities, I wonder if there really is a need for keyboard shortcuts to switch between them: if you have, say, a work and a home activity, switching from one to the other is not something you do so often that it requires shortcuts. Maybe a Win + A shortcut to open the activity list would be good enough? I think the problem here is that not everybody uses activities the same way or with the same granularity.</p>","replies":[{"id":"dsq-1612249365","author":"Jos Poortvliet","deleted":false,"createdAt":"2014-09-30T09:14:18Z","message":"<p>I agree. Also, most 'normal' people barely use virtual desktops - activities are ANOTHER layer of complexity, and badly supported in most apps anyway. Unless we simplify the concept, it isn't going to be used much...</p><p>(I would suggest to merge virtual desktops and activities, to make activities usable for &gt;50% of our users, rather than the 0.1% today - but this will annoy the 0.001% who care about having BOTH Activities AND virtual desktops and as KDE usually optimizes for the 0.001%, I guess this won't happen. Too bad, Activities is a great thing in theory... Sorry for the passive aggressiveness but this is of course stupid and thus annoying me as I don't care about the 0.0001% but want KDE to be successful for the other 99.99%)</p>","replies":[]}]}]},{"id":"dsq-1610496619","author":"Floris (FlowRiser)","deleted":false,"createdAt":"2014-09-29T09:12:24Z","message":"<p>Nice shortcuts, I also use shortcuts based on meta for workspaces. The only thing I would contribute to this post is mentioning my meta+w shortcut that opens a new tab in the browser of choice. Since I don't like the clutter of browser windows it comes like a nice change ^^</p>","replies":[]},{"id":"dsq-1611544093","author":"Jos Poortvliet","deleted":false,"createdAt":"2014-09-29T20:36:27Z","message":"<p>I have been using Win+arrows for tile left/right, maximize (up) and minimize (down). Very nice, logical. I also use the run x command dialog (dedicated key, if on keyboard, otherwise alt-f2) and alt-tab (switch app), ctrl-tab (switch desktop), f11 (fullscreen - binding in Kwin so it always works), f12 (yakuake), and last but not least ctrl-~ for klipper's menu (i use it a lot and this is a very easy, fast shortcut). Of course ctrl-c/x/v too.</p>","replies":[{"id":"dsq-1612176077","author":"Aurélien Gâteau","deleted":false,"createdAt":"2014-09-30T07:21:48Z","message":"<p>I don't like globally binding F11 to fullscreen because it prevents applications from adjusting their user interface to a fullscreen mode (like Firefox or Gwenview do)</p>","replies":[{"id":"dsq-1612247012","author":"Jos Poortvliet","deleted":false,"createdAt":"2014-09-30T09:10:14Z","message":"<p>Actually, it works just fine in Firefox and Chromium. It doesn't in Gwenview - perhaps that can be considered a bug ;-)</p><p>I guess FF detects if it is full screen and adjusts.</p>","replies":[{"id":"dsq-1612249209","author":"Aurélien Gâteau","deleted":false,"createdAt":"2014-09-30T09:14:03Z","message":"<p>Oh interesting, I was not aware of that.</p>","replies":[]}]}]}]},{"id":"dsq-1611552804","author":"Gregor Mi","deleted":false,"createdAt":"2014-09-29T20:42:29Z","message":"<p>Feels good. Some remarks:</p><p>1) Does it mean to abandon Alt+Tab (Alt+Shift+Tab) in favour of the Win key variant? Though I like the consistency of the scheme, I think the Alt+Tab combination is pretty settled and should at least also work.</p><p>2) I like Win+Esc as a much better alternative to Alt+F4. What about Win+Q for the small-handed to \"quit\" a window? Or Win+W (similar to Ctrl+W to close a tab, though I would not have associated the W with closing something and thus rule it out).</p><p>3) I also use Win+L to lock. And additionally Win+D to show the desktop. D for Desktop. ;-)</p><p>4) Thanks to your post I found out that Ctrl+Shift+F or Win+F switch fullscreen applications to non-fullscreen. I would find it consistent if Win+D also would work in fullscreen applications (exit fullscreen and show desktop). The Win+Tab (Alt+Tab) should also work there (which it currently does not).</p>","replies":[{"id":"dsq-1612177715","author":"Aurélien Gâteau","deleted":false,"createdAt":"2014-09-30T07:24:50Z","message":"<p>1) Those are just personal experiments, I do not plan to do any lobbying to get the defaults changed, though I think some of them make sense :)</p><p>2) I used Win+Q at first, but I always ended up being confused about whether I should use Ctrl or Win.</p>","replies":[]}]},{"id":"dsq-1612287837","author":"Jens Reuterberg","deleted":false,"createdAt":"2014-09-30T09:40:20Z","message":"<p>Ah I got for the \"Meta+\" set up personally trying to make certain that I can access all shortcuts with my left hand only. So with windows I have Meta+Q as close, Meta+Z as \"maximize\", Meta+X as \"Tile left\", Meta+C for \"Tile Right\", Meta+V for \"lower window\" and Meta+B for \"fullscreen\".<br>Meta+A is \"Show all desktops\" and Meta+S is \"Show all windows current desktop\". I use Ksuperkey so I have Meta only as a way to start launcher, Meta+Space for Krunner and Alt+Space for Yakuake.<br>My plan is to change the Virtual Desktops shortcuts soonish so I can use that too with only the left hand.</p>","replies":[]},{"id":"dsq-1614359584","author":"Andreas Hartmetz","deleted":false,"createdAt":"2014-10-01T09:01:50Z","message":"<p>The most important thing to me is an easy shortcut for KRunner, so I have it on Alt-Space. Why is the default still Alt-F2 anyway, how about changing it to something easy like (say) Meta-Space?</p>","replies":[{"id":"dsq-1623395975","author":"mck182","deleted":false,"createdAt":"2014-10-07T13:01:44Z","message":"<p>In Plasma5, the default shortcut for KRunner has been changed to alt+space for quite some time already; plus alt+f2 should still be working as an alternate shortuct too.</p>","replies":[]}]},{"id":"dsq-1617797109","author":"Matija „hook“ Šuklje","deleted":false,"createdAt":"2014-10-03T11:06:21Z","message":"<p>There’s a thread on the forum as well:<br><br><a href=\"http://agateau.com/2014/experimenting-with-keyboard-shortcuts/\" rel=\"nofollow noopener\" title=\"http://agateau.com/2014/experimenting-with-keyboard-shortcuts/\">http://agateau.com/2014/exp...</a></p>","replies":[{"id":"dsq-1617797789","author":"Matija „hook” Šuklje","deleted":false,"createdAt":"2014-10-03T11:07:20Z","message":"<p>Em, sorry, here’s the right link:</p><p><a href=\"https://forum.kde.org/viewtopic.php?f=83&amp;t=121205\" rel=\"nofollow noopener\" title=\"https://forum.kde.org/viewtopic.php?f=83&amp;t=121205\">https://forum.kde.org/viewt...</a></p>","replies":[]}]}]