[{"id":"dsq-457711235","author":"damian","deleted":false,"createdAt":"2010-11-05T04:49:55Z","message":"<p>I think This is definetly a very good idea!, Maybe if I have some spare money I'll help too.</p>","replies":[]},{"id":"dsq-457711236","author":"Roman","deleted":false,"createdAt":"2010-11-05T06:31:47Z","message":"<p>I hope this turns out well for you :) Always good to be able to work on your own things.</p>","replies":[]},{"id":"dsq-457711234","author":"Andre","deleted":false,"createdAt":"2010-11-05T11:01:48Z","message":"<p>Wow. Honestly, I admire you're determination. Hope this works out well for you.</p><p>All the best</p>","replies":[]},{"id":"dsq-457711232","author":"Zézinho","deleted":false,"createdAt":"2010-11-05T11:42:36Z","message":"<p>Nice idea. In fact, I work only 3,5 days a week and still live well. I think you can also even manage to live without any extra income.</p><p>\"Être riche, ce n'est que dépenser moins que ce que l'on gagne.\"</p>","replies":[{"id":"dsq-457711245","author":"Aurélien","deleted":false,"createdAt":"2010-11-05T18:46:25Z","message":"<p>That's quite possible indeed, but these two kids around here seem to burn quite some money :) Anyway, we'll see how this works out.</p>","replies":[]}]},{"id":"dsq-457711233","author":"Gaël Beaudoin","deleted":false,"createdAt":"2010-11-05T11:49:08Z","message":"<p>Quelle courageuse idée :)<br>J'espère que tu vas réussir et que ça passera financièrement!</p><p>Penses-tu proposer des \"bounty\", un peu comme le fait le développeur de choqok ? Trouver une fonctionnalité très demandée et à partir de quelques donateurs bosser dessus ? Flattr aussi est une idée peu être ?</p><p>En tout cas, bon courage :)</p>","replies":[{"id":"dsq-457711250","author":"Aurélien","deleted":false,"createdAt":"2010-11-05T18:52:40Z","message":"<p>Je ne suis pas trop fan du concept des bounties parce que je pense que ça peut avoir des effets négatifs du genre \"je paye donc j'exige que cette fonctionnalité soit implémentée\". Mais il ne faut jamais dire jamais : je démarre avec ce nouveau mode de fonctionnement, on verra comme ça se passe. Peut être que je reviendrai sur l'idée des bounties.</p><p>Merci pour les encouragements !</p>","replies":[]}]},{"id":"dsq-457711231","author":"Gaël Beaudoin","deleted":false,"createdAt":"2010-11-05T11:55:16Z","message":"<p>I've just donate a little. I hope many will follow.</p>","replies":[{"id":"dsq-457711247","author":"Aurélien","deleted":false,"createdAt":"2010-11-05T18:49:24Z","message":"<p>Thanks a lot, Gaël!</p>","replies":[]}]},{"id":"dsq-457711230","author":"Miquel","deleted":false,"createdAt":"2010-11-05T11:56:16Z","message":"<p>Hi Aurélien!</p><p>this is an awesome step you are taking. Trying to earn at least part of a work day by writing articles and community/fan donations is a bold, interesting path.</p><p>However, I think just putting a link to a nearly empty donations page (<a href=\"http://agateau.wordpress.com/support)\" rel=\"nofollow noopener\" title=\"http://agateau.wordpress.com/support)\">http://agateau.wordpress.co...</a> is not a good way to go about this.</p><p>If you really want to get a group of followers that sustainably supports your work, here are some things you can do.</p><p>In general, treat supporters as clients, no, better yet, as investors. They want and deserve to know what you are \"doing with their money\". That is more important than it may seem at first sight, because it is a powerful way of continuously motivating them to further share some of their resources (money) with you, so that you do things they care about.</p><p>Knowing that you work to improve KDE is nice, but not enough. You need to clearly explain what areas or projects you are going to work at. You can even say \"This month I will be dedicating a third of my (one day a week) time to this, and two thirds to that\", even if you change plans afterwards.</p><p>Also, bring up regular roadmap and progress updates (I assume you were already going to do that in your blog).</p><p>There are some people (even artists) who try to get funded by \"1000 true fans\" campaigns. You don't need that much, but I hope that just some care and organization on your part can get you a sizeable supporters group that may just help to cover that missing day of work.</p><p>I wish you the best of luck. Keep us posted!<br>Miquel</p>","replies":[]},{"id":"dsq-457711237","author":"Miquel","deleted":false,"createdAt":"2010-11-05T12:05:39Z","message":"<p>Well I forgot one important point.</p><p>To make this sustainable, it is much better to offer a way to donate other that \"give x euros\". Why not a subscription model?.</p><p>Subscriptions are a much better model because they signify a stronger bond between the two parts, and most importantly allows you to have financial stability. It also allows a donor to better judge what the project is worth to them.</p><p>Of course, it is funding a small part of the time of a single person, so people won't be willing to pay much. But you could offer a 2€ subscription besides the normal donate button.</p><p>You can even use the blog to explore what the sweet spot would be:<br>\"Hey readers! how would you rather contribute? a one-time 10€ donation? or a 1€, 2€ or 3€ 1-year subscription?\"</p><p>Regards,<br>Miquel</p>","replies":[{"id":"dsq-457711257","author":"Aurélien","deleted":false,"createdAt":"2010-11-05T19:07:04Z","message":"<p>Thanks for these interesting advices, Miquel. Announcing what I will work is indeed a good idea to let people know what they get with their money. I am still new to this so I need to find my marks and figure out how to best make it work.</p>","replies":[]}]},{"id":"dsq-457711238","author":"Miquel","deleted":false,"createdAt":"2010-11-05T12:07:46Z","message":"<p>I meant a \"2€ monthly, 1-year subscription\"<br>;-)</p>","replies":[]},{"id":"dsq-457711240","author":"murrayy","deleted":false,"createdAt":"2010-11-05T12:21:43Z","message":"<p>Wow, hope this works out for you.<br>Could you tell us on what you plan to work on your day off, <br>so we can better decide if we want to donate for that work?</p>","replies":[{"id":"dsq-457711258","author":"Aurélien","deleted":false,"createdAt":"2010-11-05T19:10:20Z","message":"<p>Yes, will do so. It makes sense to let people know what their money will be used for.</p>","replies":[]}]},{"id":"dsq-457711241","author":"Diederik van der Boor","deleted":false,"createdAt":"2010-11-05T16:40:21Z","message":"<p>&gt; Some may argue Canonical could do like other companies such as Google, 3M or Atlassian,<br>&gt; which let their engineers spend a percentage of their week on personal projects.<br>&gt; I think this is a great idea, but it probably wouldn’t help in my situation:<br>&gt; these personal projects usually must be approved by their managers</p><p>Lol, isn't the point of these 20% projects that they don't need much management approval?</p><p>How to you sell a e-mail service or online photo service to your manager who believes they are a search engine company? About 50% of Google's innovations happen in those 20% projects, and subsequently give insight how that could be marketed into a project.</p><p>&gt;and must end up benefiting the company.<br>&gt; Like it or not, Canonical focus is on GNOME.<br>&gt; Improving KDE would not be very useful for the company.</p><p>Ok, that gives at least some reasoning. Yet I wonder how that relates to my emailservice  searchengine example. GMail is a 20% project.</p>","replies":[{"id":"dsq-457712359","author":"Aurélien","deleted":false,"createdAt":"2010-11-05T17:04:34Z","message":"<p>&gt;&gt; these personal projects usually must be approved by their managers<br>&gt; Lol, isn’t the point of these 20% projects that they don’t need much management approval?</p><p>I can't find a reference of this rule for Google, but I am pretty sure I read/heard it. On the other hand, in their 20% experience, Atlassian defined some similar rules:</p><p>\"So there are two mandatory checkpoints. If you want to spend more than 40 hours on one project (one developer-week), you must find three supporters within the company who agree that the project is both a good idea, and viable. After 160 hours, the project also needs to be signed off by Mike or Scott.\"</p><p>( <a href=\"http://blogs.atlassian.com/developer/2008/03/20_time_the_nuts_and_bolts.html\" rel=\"nofollow noopener\" title=\"http://blogs.atlassian.com/developer/2008/03/20_time_the_nuts_and_bolts.html\">http://blogs.atlassian.com/...</a> )</p><p>GMail is indeed a 20% project, so is Google News Reader. It has been a long time since Google stopped being only a search engine company. I think their focus nowadays is to ensure you do all your computing on the web, preferably in their servers. With this in mind, GMail makes a lot of sense as a part of Google strategy.</p>","replies":[]}]},{"id":"dsq-457711242","author":"Rezza","deleted":false,"createdAt":"2010-11-05T18:01:01Z","message":"<p>Hi,<br>sometimes I feel the same in Red Hat - not a KDE shop, same in  Fedora - we're also second class citizens. But every time I hear from users - that they like what we are working on, it makes me happy and gives me energy to work more and more ;-)</p>","replies":[]},{"id":"dsq-457711253","author":"Thales Oliveira","deleted":false,"createdAt":"2010-11-05T18:54:21Z","message":"<p>Aurélien, did you post somewhere what projects you intend to work on your \"free day\"?</p>","replies":[{"id":"dsq-457711261","author":"Aurélien","deleted":false,"createdAt":"2010-11-05T19:10:48Z","message":"<p>Not yet, will do so.</p>","replies":[{"id":"dsq-457712364","author":"Thales Oliveira","deleted":false,"createdAt":"2010-11-05T19:16:12Z","message":"<p>Please, let us know, that would make more interesting helping you know, not that \"we\" don't wanna help, but it is always good to know what we're helping with.</p><p>Anyways, good luck with that my friend.</p>","replies":[]}]}]},{"id":"dsq-457711263","author":"siliconmeadow","deleted":false,"createdAt":"2010-11-05T20:08:19Z","message":"<p>Best of luck on your endeavours with KDE - I hope it regains the ground it lost over the past few years to Gnome. The old KDE is still better than Gnome, IMHO.</p><p>I clicked on flattr in a show of support :-)</p>","replies":[]},{"id":"dsq-457711265","author":"Martin Gräßlin","deleted":false,"createdAt":"2010-11-05T21:48:24Z","message":"<p>Interesting idea. I wish you good luck for it and am interested to know if that works out well. It would be nice to have one day a week to work on KWin...</p>","replies":[{"id":"dsq-457712361","author":"Aurélien","deleted":false,"createdAt":"2010-11-06T00:14:04Z","message":"<p>Thanks Martin! For sure I will let people know how it work out.</p>","replies":[]}]},{"id":"dsq-457711270","author":"T___U","deleted":false,"createdAt":"2010-11-09T04:31:02Z","message":"<p>Way to go Aurélien. A 80% part-time job in order to do things that one really enjoys/care about, is definitely a good idea for anyone. That's my plan too in the future. Provided you don't have too many loans / expensive lifestyle, it should be managable :)</p><p>I really hope we'll soon hear from your projects again. BTW, what about a recurring payment option ?</p>","replies":[]},{"id":"dsq-457711272","author":"Free Energy Options","deleted":false,"createdAt":"2010-11-09T11:40:34Z","message":"<p>Keep it up man, I love KDE!</p><p>How long before all winblows applications are 100% compatible?</p>","replies":[]},{"id":"dsq-457711267","author":"Benjamim Góis","deleted":false,"createdAt":"2010-11-13T07:40:48Z","message":"<p>I really admire your courage and dedication. If i had any means to do same i would. KDE is really an awesome piece of software, i wish you the best with your objective !</p>","replies":[]},{"id":"dsq-457711273","author":"nuno","deleted":false,"createdAt":"2010-11-14T07:08:41Z","message":"<p>dude this is what i love about KDE the amount of personal coomitment they put into it. let me know if you need something from me (icons and thinds) huge respect for what you are doing....</p>","replies":[{"id":"dsq-457711277","author":"Aurélien","deleted":false,"createdAt":"2010-11-14T14:43:14Z","message":"<p>Thanks Nuno! For sure I'll send icon requests to you, but I don't want to disturb you from the amazing work you are currently doing on the mimetype icon refresh :)</p>","replies":[]}]},{"id":"dsq-457711276","author":"ike","deleted":false,"createdAt":"2010-11-24T00:26:32Z","message":"<p>speaking of translating the desktop experience team's work.. do you think it would be possible in kde to make the full screen like in unity, where the global menu displays the close, minimize, unmax buttons and it would cut off the window title. I like this in unity a lot and it make the full screen nice and big while still giving access to the panel. I think that would be a cool additional settings option for the appmenu widget.</p>","replies":[{"id":"dsq-457711281","author":"Aurélien","deleted":false,"createdAt":"2010-11-24T04:51:35Z","message":"<p>The plasma-netbook interface already provide something very similar. You should give it a try.</p>","replies":[]}]}]
