[{"id":"dsq-457712061","author":"Michał","deleted":false,"createdAt":"2012-01-27T20:19:33Z","message":"<p>Wrong colors in QGV are fixed in recent version of Phonon GStreamer. :-)<br>And as far as I remember I've never encountered wrong aspect ratio...</p>","replies":[]},{"id":"dsq-457712062","author":"uniq","deleted":false,"createdAt":"2012-01-27T20:23:39Z","message":"<p>Thanks for this post. Usually around a new release I read a lot about the subsequent, current developed release. This post make me looking forward to 4.8, not 4.9 :-)</p>","replies":[]},{"id":"dsq-457712058","author":"Aaron Seigo","deleted":false,"createdAt":"2012-01-27T20:44:32Z","message":"<p>really liking many of the changes in gwenview for 4.8 :))</p><p>one thing that i noticed that might be nice is to hide the birdseye view when there is no panning possible. it looks rather odd when the whole image fits in the window :)</p>","replies":[{"id":"dsq-457712587","author":"Aurélien","deleted":false,"createdAt":"2012-01-27T22:10:08Z","message":"<p>If it is still showing, then that's a bug. It is not supposed to. How do you manage to trigger this?</p>","replies":[{"id":"dsq-457712722","author":"BajK","deleted":false,"createdAt":"2012-01-27T22:15:38Z","message":"<p>Well, it is just enough to have a picture that is smaller than the screen, i.e. that fits without shrinking it and then just switching from \"Fit\" to \"100%\", then the birdeye view will show up although the entire picture fits on the screen</p>","replies":[{"id":"dsq-457712726","author":"Aurélien","deleted":false,"createdAt":"2012-01-28T01:01:04Z","message":"<p>Thanks, going to look into that.</p>","replies":[]}]}]}]},{"id":"dsq-457712060","author":"Anders Lund","deleted":false,"createdAt":"2012-01-27T21:05:00Z","message":"<p>Using this version of gwenview is truely a joy!</p><p>I mostly run in maximized state, and it is obvious that a small left margin in the sidebar views would be an improvement.</p><p>Thanks for all those wonderful improvements :)</p>","replies":[]},{"id":"dsq-457712055","author":"Dmitry","deleted":false,"createdAt":"2012-01-27T21:16:06Z","message":"<p>Thank for the post!<br>A small wish for this point:<br>&gt;More consistent behavior: SVG images can now be scrolled using the same shortcuts as &gt;scrolling raster images.<br>Could be scaling of svg made more consistent (e.g. scale as vector image not as raster, bug <a href=\"https://bugs.kde.org/show_bug.cgi?id=286099)\" rel=\"nofollow noopener\" title=\"https://bugs.kde.org/show_bug.cgi?id=286099)\">https://bugs.kde.org/show_b...</a>. Or it is fixed in 4.8.1?</p>","replies":[{"id":"dsq-457712588","author":"Aurélien","deleted":false,"createdAt":"2012-01-27T22:12:58Z","message":"<p>I haven't looked into it. It's true that it looks weird. Should dive into how Qt renders SVG to fix this.</p>","replies":[]}]},{"id":"dsq-457712054","author":"nabla","deleted":false,"createdAt":"2012-01-27T21:35:49Z","message":"<p>While the additional feature are certainly nice, wouldn't colour management support be a much more important? On a wide gamut screen, bird-eye view doesn't help much when the colours are wrong.</p><p>And it's implemented in digikam or showfoto (latter not as nice as gwenview to just browse some pics) so a similar approach could be done here...</p><p>Of course, in the end, the one who invests the time decides what to do...</p>","replies":[{"id":"dsq-457712594","author":"Aurélien","deleted":false,"createdAt":"2012-01-27T22:14:47Z","message":"<p>It is indeed a feature quite a few people have requested. Problem is I don't need for it personally so I haven't felt the urge to work on this.</p>","replies":[]}]},{"id":"dsq-457712046","author":"xsigik","deleted":false,"createdAt":"2012-01-28T00:53:53Z","message":"<p>What's new? Gwenview can't open psd files anymore... :)</p>","replies":[{"id":"dsq-457712051","author":"Aurélien","deleted":false,"createdAt":"2012-01-28T01:00:05Z","message":"<p>Something weird is indeed happening with psd: I can open them with my local build of KDE but not with the distro packages.</p>","replies":[{"id":"dsq-457712585","author":"xsigik","deleted":false,"createdAt":"2012-01-28T01:47:29Z","message":"<p>I can open it with distro package (Arch), but only for example with KuickShow or Okular.</p>","replies":[]}]}]},{"id":"dsq-457712047","author":"Thomas Thym","deleted":false,"createdAt":"2012-01-28T00:58:29Z","message":"<p>Great work. It is always a pleasure to work with gwenview. Thank you!</p>","replies":[]},{"id":"dsq-457712052","author":"fasd","deleted":false,"createdAt":"2012-01-28T01:19:36Z","message":"<p>Actually zoom tool need a lot of work!</p><p>1) Ctrl+scrolling is ok, is default on many apps but ctr click to zoom? ctrl+rightclick is even worse! I was so lost with this new zooming. Make proper zoom tool accessible from main toolbar with some hot-key (preferably \"Z\" key), make proper hand tool also. Enabling zoom tool will change cursor to magnifying glass with \"+\", make it possible to drag and select area of zooming (now if clicked it just popping zoom - and I don't know whats going on anymore), make right click menu \"fit to screen\", \"original size\" etc. alt key will change \"+\" to \"-\", look at good old photoshop zooming enough said</p><p>2) ctrl+click+movement = zoom + draging while showing zoom cursor = I think it's bug</p><p>3) if I zoom in a lot of times I need to click equal amount to zoom out (on fullscreen), top autohide menu doesn't have zoom slider either. Just look at point 1)</p><p>Is it possible to choose speed of crossfade effect? is it following \"animation speed\" of effects in system settings? This is a mess too, a) should be configurable to choose speed either in gwenview or follow kwin effects</p>","replies":[{"id":"dsq-457712579","author":"Aurélien","deleted":false,"createdAt":"2012-01-28T03:21:45Z","message":"<p>1) Ctrl+left/right click has been there since Gwenview 1. It's hardly new.<br>I don't want to have \"proper\" zoom and hand tools to Gwenview: it adds too many modes.</p><p>2) That is indeed strange. Will fix.</p><p>\"3) if I zoom in a lot of times I need to click equal amount to zoom out (on fullscreen), top autohide menu doesn’t have zoom slider either. Just look at point 1)\"<br>=&gt; I don't understand.</p><p>\"Is it possible to choose speed of crossfade effect? is it following “animation speed” of effects in system settings? This is a mess too, a) should be configurable to choose speed either in gwenview or follow kwin effects\"<br>No it is not configurable.</p><p>All in all, thank you for your positive tone. Not.</p>","replies":[{"id":"dsq-457712729","author":"Dirk","deleted":false,"createdAt":"2012-01-29T16:41:50Z","message":"<p>Thanks for the updates and explanations of the various changes.<br>I came here because I noticed wrong (shifted) colours in video playback, OK you're aware of it and where to look.</p><p>Thanks again!</p>","replies":[]}]}]},{"id":"dsq-457712036","author":"Christopher Fritz","deleted":false,"createdAt":"2012-01-29T10:09:54Z","message":"<p>This update took me by surprise.  I work with large photos of census images, and it's convenient for me to have the mouse over the lower scrollbar and just reach over and scroll to move from left to right without losing my focus on another application I'm transcribing data in.  Are there any plans to re-implement mouse-wheel scrolling without the scroll bars?  (Maybe shift+scroll for side-to-side scrolling?)  Not intending this as a feature request, but rather just curious as to whether it's being considered.  For my census transcribing, I'll probably just adjust to alt-tab, arrow key, alt-tab back.  Not a big deal there.</p><p>What I'm really wonder is whether there will be a way to visually remove the \"bird-eye view\" square.  Should I submit a bug requesting an option to disable this?</p><p>Hopefully I don't sound like I'm complaining.  I absolutely love Gwenview, and the removal of scrollbars I feel is a very strong visual improvement when viewing images larger than the screen.</p>","replies":[{"id":"dsq-457712580","author":"Aurélien","deleted":false,"createdAt":"2012-01-29T22:11:35Z","message":"<p>Mouse wheel scrolling is back in 4.8.1, not sure how I managed to miss this! I have no plan to add an option to hide the bird-eye view for now: it is the only way to know where you are in the image, now that the scrollbars are gone.</p>","replies":[{"id":"dsq-457712724","author":"gedgon","deleted":false,"createdAt":"2012-01-30T03:21:22Z","message":"<p>&gt;&gt;it is the only way to know where you are in the image, now that the scrollbars are gone.</p><p>Bird-eye view could appear on LPM+mousemove, for example.</p><p>Btw. I'm curious about these bugs/regressions. Any info/eta about that?<br><a href=\"https://bugs.kde.org/show_bug.cgi?id=291759\" rel=\"nofollow noopener\" title=\"https://bugs.kde.org/show_bug.cgi?id=291759\">https://bugs.kde.org/show_b...</a><br><a href=\"https://bugs.kde.org/show_bug.cgi?id=292635\" rel=\"nofollow noopener\" title=\"https://bugs.kde.org/show_bug.cgi?id=292635\">https://bugs.kde.org/show_b...</a></p><p>Best regards.</p>","replies":[{"id":"dsq-457712810","author":"Aurélien","deleted":false,"createdAt":"2012-01-30T15:53:25Z","message":"<p>&gt; Bird-eye view could appear on LPM+mousemove, for example.</p><p>What do you mean with LPM? I was thinking about having it autohide when the mouse is not moving, which may be what you mean.</p><p>&gt; Btw. I’m curious about these bugs/regressions. Any info/eta about that?</p><p>No eta on those bugs. I can't commit to any date for Gwenview work, but I will have a look.</p>","replies":[{"id":"dsq-457712817","author":"gedgon","deleted":false,"createdAt":"2012-01-30T16:25:16Z","message":"<p>Silly me, LPM (in Polish) = LMB (left mouse button), sorry about that.</p><p>&gt;&gt; I was thinking about having it autohide when the mouse is not moving, which may be what you mean.</p><p>Indeed, bird-eye view isn't just indicator, so mouse button is redundant.</p><p>&gt;&gt; [...] but I will have a look.</p><p>Thank you.</p>","replies":[]}]}]}]}]},{"id":"dsq-457712039","author":"John Cartwright","deleted":false,"createdAt":"2012-01-30T14:52:35Z","message":"<p>I had a bug with the Gnome image viewer that gave wrong colors for photos. No such bugs here. The OpenGL option works with Intel integrated graphics on my computer as well. A very good job.</p>","replies":[]},{"id":"dsq-457712027","author":"chris","deleted":false,"createdAt":"2012-02-04T04:08:40Z","message":"<p>Updated today to 4.8, and found a not jet mentioned problem: sometimes the bird-eye view is too small to grab (at the size of an pixel), <br>see the screenshot: <a href=\"http://i.imgur.com/dLpD0.png\" rel=\"nofollow noopener\" title=\"http://i.imgur.com/dLpD0.png\">http://i.imgur.com/dLpD0.png</a></p><p>Possible solution: min width/high and max width/high and scale in between.</p><p>I can open a new bug report if it is necessary.</p>","replies":[]},{"id":"dsq-457712026","author":"Petr","deleted":false,"createdAt":"2012-02-04T19:45:10Z","message":"<p>Hi, just upgraded Gwenview to 4.8.0 today. There is one negative change compared to the previous version:<br>1. Open an image - opens in fit-to-window mode<br>2. Switch to 1:1 mode (F key or middle mouse button)<br>3. Move to the next image (with space or mouse wheel)<br>Expected behaviour: the new image should open in 1:1 mode.<br>What happens: the new image opens in fit-to-window mode.</p><p>I didn't find any settings to change that. In 4.7.4 the view mode was preserved while walking through images, in 4.8.0 the next image always opens in fit-to-window mode.</p><p>Sticking with 4.7.4 for now...</p><p>Thanks anyway for all the good work!</p>","replies":[{"id":"dsq-457712031","author":"Aurélien","deleted":false,"createdAt":"2012-02-04T20:22:34Z","message":"<p>Indeed, that's a known bug. Will see if I can get it fixed for 4.8.x.</p>","replies":[]}]},{"id":"dsq-457712032","author":"Ariba","deleted":false,"createdAt":"2012-02-08T19:43:27Z","message":"<p>There is problem on widescreen pictures like 2560x1280 or taller. Gwenview does not show them. Is there a memory problem? It runs inside one vm and only got 2gb for use. Okular views the pictures ok. And it is ok as kde backdrop.</p>","replies":[{"id":"dsq-457712575","author":"Aurélien","deleted":false,"createdAt":"2012-02-10T13:51:30Z","message":"<p>That is very strange: I just create a picture of 2560x1280 and it is correctly displayed by Gwenview. Can you file a bug report about this and attach a picture which fails to load to it?</p>","replies":[{"id":"dsq-457712583","author":"Ariba","deleted":false,"createdAt":"2012-02-12T23:18:35Z","message":"<p>uploaded one desktop backdrop for Gwenview by here: <a href=\"http://imageshack.us/f/703/backdropx.png\" rel=\"nofollow noopener\" title=\"http://imageshack.us/f/703/backdropx.png\">http://imageshack.us/f/703/...</a><br>that will not show up with Gwenview but works for kde backdrop.<br>Thanx for your reply.</p>","replies":[{"id":"dsq-457712719","author":"Aurélien","deleted":false,"createdAt":"2012-02-17T21:40:28Z","message":"<p>I just looked at it. It seems Gwenview is confused by the fact it is a jpeg file with a .png extension. I will look into this.</p>","replies":[{"id":"dsq-457712818","author":"Aurélien","deleted":false,"createdAt":"2012-02-17T21:44:28Z","message":"<p>Mmm no, now it works. I am confused. Maybe ImageShack did something to your image. Best would be sending it to me via mail (see \"about\" page).</p>","replies":[{"id":"dsq-457712821","author":"Ariba","deleted":false,"createdAt":"2012-02-19T14:43:32Z","message":"<p>Tried to sent to you but received it back. Mail server complains on quota exceeded.<br>Zoom icon goes to <a href=\"http://img703.imageshack.us/img703/5017/backdropx.png\" rel=\"nofollow noopener\" title=\"http://img703.imageshack.us/img703/5017/backdropx.png\">http://img703.imageshack.us...</a> That is original image, in png not jpg. You can wget it.<br>Kde forum is talking over a bug at images in 2560 screen size when running on vm. They will not show at all. I will try to refind it.<br>Thanx for your reply and for making Gwenview!</p>","replies":[]}]}]}]}]}]},{"id":"dsq-457712041","author":"Adam","deleted":false,"createdAt":"2012-02-13T13:40:52Z","message":"<p>I think scrollbars should be optional.  As has been mentioned, they can be useful.  For one thing, they allow one to see where the view is in relation to the image without obscuring the image--but the birds-eye obscures the image.</p>","replies":[{"id":"dsq-457712578","author":"Aurélien","deleted":false,"createdAt":"2012-02-17T21:24:17Z","message":"<p>I had to drop scrollbars because of the switch to QGraphicsView. I think an autohiding bird-eye view should help knowing where you are in the image without obscuring it.</p>","replies":[]}]},{"id":"dsq-457712034","author":"Vangelis","deleted":false,"createdAt":"2012-02-18T21:42:26Z","message":"<p>I realized a strange behavior in zoom-to-fit :/<br>It wasn't like this in previous versions.</p><p>If I deactivate zoom-to-fit for one picture and press space bar to go to the next picture, zoom-to-fit is activated again automatically!<br>This is not desirable as sometimes I want to compare two pictures so I zoom in and press space/backspace quickly to see the detail changes in similar pictures. One might be sharper for example but this is not visible in the zoom-to-fit mode.</p><p>Can we get an option to activate/deactivate the zoom-to-fit auto enable feature?</p>","replies":[{"id":"dsq-457712038","author":"Aurélien","deleted":false,"createdAt":"2012-02-27T01:39:16Z","message":"<p>This is a known issue: zoom setting used to be kept when going through images. I plan to fix it for 4.8.x (don't know about the value of x for now)</p>","replies":[{"id":"dsq-457712577","author":"Vangelis","deleted":false,"createdAt":"2012-02-27T03:33:51Z","message":"<p>Yes, I read all of the comments after I posted this. I saw you already replied to someone mentioned the same thing. Sorry for double posting a known issue.</p><p>Can you please check this screenshot (check link below) to see another cosmetic bug? If you are working on a netbook or small vertical screen resolution, the metadata infromation looks so ugly :/</p><p>Would it be hard to implement a scrollbar there instead of squeezing the labels making the text unreadable?</p><p><a href=\"http://bugsfiles.kde.org/attachment.cgi?id=69105\" rel=\"nofollow noopener\" title=\"http://bugsfiles.kde.org/attachment.cgi?id=69105\">http://bugsfiles.kde.org/at...</a></p><p>This is the corresponding bug report.<br><a href=\"https://bugs.kde.org/show_bug.cgi?id=259141\" rel=\"nofollow noopener\" title=\"https://bugs.kde.org/show_bug.cgi?id=259141\">https://bugs.kde.org/show_b...</a></p>","replies":[]}]}]},{"id":"dsq-645750786","author":"Banifou","deleted":false,"createdAt":"2012-03-02T23:14:15Z","message":"<p>Gwenview is amazing! I'm using it for many years now. <br>Actually I'm stunning about the resize method! When I save a JPG file using resize method (without changing anything!) the file size is mostly  tremendously reduced, without any noticeable loss of quality. This can not be achieved with batch resize, unfortunately! <br>This method is very important for me because I need to handle a large bunch of images, they need to be small sized (for an internet shop). I tried Imagemagick and Gimp but couldn't achieve the performance of Gwenview.</p><p>What is the algorithm? Is there a way to use it in batch mode?</p><p>Salut</p>","replies":[{"id":"dsq-645751156","author":"Aurélien","deleted":false,"createdAt":"2012-03-03T23:34:00Z","message":"<p>Gwenview relies on Qt JPEG support to save JPEG files. What probably happens is your image contains extra information (for example large thumbnails set by the digital camera) which got dropped at save time. A tool like jhead (with the -purejpg option) can help you produce smaller jpegs.</p>","replies":[]}]},{"id":"dsq-645750784","author":"Falk","deleted":false,"createdAt":"2012-03-08T03:43:45Z","message":"<p>I'd hoped the png size bug would be gone with 4.8.1 as it seems like an easy fix to do, but it's still there. So I guess it's harder than than it looks.<br>Is there some way to help track this bug down? It's become a real annoyance as I have a load of photos as png in 2560x1920 size and Gwenview won't show any of them except as thumbnails.<br>So I'd really like to see this fixed soon.</p><p>(Sorry for writing here, but <a href=\"http://bugs.kde.org\" rel=\"nofollow noopener\" title=\"bugs.kde.org\">bugs.kde.org</a> isn't working for me at the moment.)</p>","replies":[{"id":"dsq-645751153","author":"Aurélien","deleted":false,"createdAt":"2012-03-08T04:05:31Z","message":"<p>I haven't spent much time on Gwenview this month and haven't been able to reproduce the bug so far, making it difficult (read: impossible) to fix. What makes you think it is an easy fix? Do you have any idea how to fix it?</p>","replies":[{"id":"dsq-645781026","author":"Falk","deleted":false,"createdAt":"2012-03-08T13:14:09Z","message":"<p>I don't have an idea (yet) what causes it and how to fix it.<br>My (possibly wrong) assumption is based on the fact that the bug only occurs with png images of specific sizes and there are probably not that many places in Gwenview that depend specifically on an image's size and user configuration at the same time, as this bug is user-specific too.<br>My attempts at isolating the part of KDE's config which causes this have sadly not been successful up to now. So I'd hoped you have an idea of how to triage this in a better way or some pointers as to what to look at or what to try to help you find the cause.</p><p>Also, the bugtracker seems to have recovered, here is the link: <a href=\"https://bugs.kde.org/show_bug.cgi?id=289819\" rel=\"nofollow noopener\" title=\"https://bugs.kde.org/show_bug.cgi?id=289819\">https://bugs.kde.org/show_b...</a>  I also posted a tiny example image there to fiddle with.</p><p>Still, the selectiveness of this bug puzzles me. Does Gwenview load images in fixed-size chunks and at some sizes there may a one-off error in how many chunks to allocate or display? But this would need to be user-config specific as well as it won't occur for every user on the same machine…</p><p>Someone suggested to try to set up a qemu image that can reproduce this bug. If I manage to do this I'll send it to you so you can do more proper tests.</p>","replies":[]}]}]},{"id":"dsq-645750792","author":"Sul","deleted":false,"createdAt":"2012-05-13T03:44:09Z","message":"<p>Gwenview is very cool and maybe the best image viewer for KDE/Linux, but it would be great if you could do some tweaks to make it start a little bit faster. When browsing some images in Dolphin, there is sometimes the need to open an image, only because the preview is to small, see the image, and close the Gwenview windows. If Gwenview could start faster, maybe drawing the image at first and show it, then the rest of the interface, it would be very nice.</p><p>(sorry for my bad english)</p>","replies":[]},{"id":"dsq-645750793","author":"Berend Dekens (@cyberwizzard)","deleted":false,"createdAt":"2012-06-21T13:51:21Z","message":"<p>Is it possible to either reimplement a scrollbar or improve the birdseye overview for extremely wide images? I am using Gwenview to watch PNG plots from GNUplot of waveforms of our radio receivers.</p><p>For example I have images that are 32660x1000 pixels and the overview is bigger than the screen making it impossible to quickly jump to every part.</p><p>Also, is it a design choice to limit the width of an image to 32k? I thought that I was able to use plots up to 80.000 pixels width in older versions...</p>","replies":[{"id":"dsq-645751162","author":"Aurélien","deleted":false,"createdAt":"2012-06-22T16:18:23Z","message":"<p>The bird eye view is indeed a bit painful for wide images, I am not sure how to improve it however. You should nevertheless be able to quickly scroll through images with the arrow keys (using shift to make scrolling faster).</p><p>Regarding limitation to 32k, there is no such limitation in Gwenview, but there may be one in Qt.</p>","replies":[]}]}]