[{"id":"dsq-457711777","author":"damian","deleted":false,"createdAt":"2011-04-05T04:55:49Z","message":"<p>Nice work! 1 detail about gwenview, I think the word Deselect, with the minus sign could be confused with Delete, it might be just me, but initially I read Delete, so I thinked it was 1 button for trash and 1 button for total delete, maybe \"Un-select\", but again, it might be just me.</p>","replies":[{"id":"dsq-457711779","author":"Aurélien","deleted":false,"createdAt":"2011-04-05T11:17:58Z","message":"<p>I think the icon is the right one: it is used in Dolphin and in Gwenview when you move your mouse over a selected item: clicking it \"deselects\" the item. What I am not sure about is the word \"deselect\". It is not a real English word, advices from native English speakers are welcome...</p>","replies":[{"id":"dsq-457712497","author":"damian","deleted":false,"createdAt":"2011-04-06T07:14:23Z","message":"<p>You're right about the icon now I think about it, the part that makes me think bad is the \"De\" looks too much like delete, I've searched and unselect isn't even a real word, Maybe removing the word completely, as is consistent with dolphin/gwenview file list</p>","replies":[]}]}]},{"id":"dsq-457711778","author":"Lionel Chauvin","deleted":false,"createdAt":"2011-04-05T10:35:20Z","message":"<p>Merci :)</p>","replies":[]},{"id":"dsq-457711780","author":"Guest","deleted":false,"createdAt":"2011-04-06T13:25:43Z","message":"<p>The Gwenview work looks nice, but I have one question: what is the \"Synchronize\" button for? Is that related to this feature, or something else entirely that's snuck into Master when I wasn't looking?</p>","replies":[]},{"id":"dsq-457711781","author":"Aurélien","deleted":false,"createdAt":"2011-04-06T16:21:09Z","message":"<p>It is related to compare mode: when you check \"Synchronize\", compared images are synchronized: if you scroll one image it will scroll the other accordingly. This can be used for example to compare the sharpness of two pictures: zoom in, check synchronize and scroll the images over the details to inspect.</p><p>Maybe it needs a better term than \"Synchronize\"?</p>","replies":[]},{"id":"dsq-457711782","author":"Stefan","deleted":false,"createdAt":"2011-04-06T22:19:32Z","message":"<p>I never understood why QLayouts have a non-zero margin by default. The only situation where a margin is useful IMO is when you put the widgets inside a frame, which is painted by the parent widget. But this is nearly never the case when one uses layouts.</p>","replies":[{"id":"dsq-457712496","author":"Aurélien","deleted":false,"createdAt":"2011-04-12T00:57:35Z","message":"<p>I agree. Interestingly, QLayout margin was 0 by default in the Qt3 days...</p>","replies":[]}]},{"id":"dsq-457711783","author":"olya","deleted":false,"createdAt":"2011-04-20T18:19:29Z","message":"<p>Interesting thinking...</p>","replies":[]}]
