[{"id":"dsq-860023925","author":"blackpaw","deleted":false,"createdAt":"2013-04-11T20:29:55Z","message":"<p>Thanks! I do like the new look of the installer, clean and simple, easier to scan.</p><p>If I could plug my personal bug ....</p><p><a href=\"https://bugs.launchpad.net/ubuntu/+source/ubiquity/+bug/1066223\" rel=\"nofollow noopener\" title=\"https://bugs.launchpad.net/ubuntu/+source/ubiquity/+bug/1066223\">https://bugs.launchpad.net/...</a></p><p>- Ubiquity defaults the first city in a timezone, rather than using the geoip to guess at the correct one.</p><p>Cheers.</p>","replies":[]},{"id":"dsq-860091434","author":"eyome","deleted":false,"createdAt":"2013-04-11T21:47:09Z","message":"<p>Hey, so you have tried Chakra ;)</p><p>Thank you for this post.</p>","replies":[{"id":"dsq-860608726","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-04-12T08:03:11Z","message":"<p>Actually I looked at screenshots... Not enough time in the day to try the various installers :)</p>","replies":[]}]},{"id":"dsq-860284294","author":"Michael","deleted":false,"createdAt":"2013-04-12T02:05:51Z","message":"<p>Fantastic!! :)  I'm so happy to see this getting more attention. I was plesantly surprised when I installed the first beta on my live desktop (not a VM!) and this interface came up, very clean and easy to understand.</p><p>My one and only comment is I would be happy to see some more padding in the main content area (the light gray area) at the left and right margins. To my eyes, the otherwise beautiful KDE interface seems like like the main text is pressing closely to the sides of the window/sidebar, and the text is overlong than tall. So my guess would be to add like about 30 pixels padding on each inner side of the main content area to give the main text some \"visual breathing room\".</p>","replies":[{"id":"dsq-860607907","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-04-12T08:02:12Z","message":"<p>Yes, some screens definitely need more space, but I removed some padding first to ensure texts were not truncated.</p>","replies":[{"id":"dsq-861367556","author":"Anonymous","deleted":false,"createdAt":"2013-04-12T23:29:49Z","message":"<p>Looks nice :)</p><p>I also think that at least at the left side of the main content area there should be some more padding. Also, the sidebar should have more padding at the top, i.e. \"Kubuntu [...]\" shouldn't stick to the top of the window/screen (if in fullscreen mode) that much (maybe you could give it (half) as much padding at the top as it has at the left/right or something like that?).</p><p>Some strings of the German translation were truncated, too, btw.</p>","replies":[]}]}]},{"id":"dsq-860398742","author":"BSmith1012","deleted":false,"createdAt":"2013-04-12T03:59:39Z","message":"<p>Hi! Thanks for all of your hard work. That being said, you should always get some feedback about GUI changes if you really want to do it right, since not everyone uses computers the same way or views things the same. Ubiquity is a fairly popular installer, and while it may not be perfect, there's alot of small things it does right.</p><p>I decided to email you after my small post turned into a much longer post, but here's a link to the mockups I posted in the Kubuntu G+ community about how I would like the installer to look. Thanks Aurelien!<br><a href=\"https://plus.google.com/117033421772248657862/posts/M79RvFPUUWz\" rel=\"nofollow noopener\" title=\"https://plus.google.com/117033421772248657862/posts/M79RvFPUUWz\">https://plus.google.com/117...</a></p>","replies":[{"id":"dsq-860608041","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-04-12T08:02:22Z","message":"<p>Just answered on G+.</p>","replies":[]}]}]