[{"id":"dsq-457711742","author":"Anonymous","deleted":false,"createdAt":"2011-03-27T04:48:35Z","message":"<p>Nice article. Qt/KDE everywhere, on Gnome, too :-p</p>","replies":[]},{"id":"dsq-457711744","author":"Markus","deleted":false,"createdAt":"2011-03-27T06:13:22Z","message":"<p>How about – for a change – let the GNOME side the one that is friendly to KDE/Qt?<br>KDE ports Oxygen to GTK. The GTK theme wrapper was also written by Qt/KDE. No stock GNOME theme was ever ported to KDE/Qt by its authors.<br>KDE uses the fdo icon naming specification for maximal compatibility. GNOME still doesn't fully implement it.<br>No GTK application I ever saw, adjusted to the Plasma Workspaces button order.<br>GNOME so far refuses to implement the StatusNotifier protocol, even though it was submitted to fdo.</p><p>It's not like any GNOME user would ever install a KDE application to run under GNOME – at best Qt-only applications.</p>","replies":[{"id":"dsq-457711746","author":"Keith Rusler","deleted":false,"createdAt":"2011-03-27T08:20:10Z","message":"<p>I totally agree with Markus. When will GNOME ever make an attempt to do anything for us KDE users? It seems it's always us KDE developers that do everything for them. They want us to implement their standards and make everything work great for them, but in the mean time, they won't do it back. I guess that is the GNOME community for you. Hence why I never go back to their world. KDE has proven to me over time that they are pretty much imho the only ones who really care about the Desktop Environment.</p>","replies":[{"id":"dsq-457711768","author":"Vadim Peretokin","deleted":false,"createdAt":"2011-03-29T05:41:51Z","message":"<p>Similar sentiments have been found in the recent GNOME/Canonical spat.</p>","replies":[]}]},{"id":"dsq-457711753","author":"Aurélien","deleted":false,"createdAt":"2011-03-27T11:18:03Z","message":"<p>&gt; How about – for a change – let the GNOME side the one that is friendly to KDE/Qt?<br>&gt; KDE ports Oxygen to GTK. The GTK theme wrapper was also written by Qt/KDE. No stock GNOME theme was ever ported to KDE/Qt by its authors.<br>&gt; KDE uses the fdo icon naming specification for maximal compatibility. GNOME still doesn’t fully implement it.</p><p>Things won't change with such an attitude.</p><p>&gt; No GTK application I ever saw, adjusted to the Plasma Workspaces button order.</p><p>Try GIMP.</p><p>&gt; GNOME so far refuses to implement the StatusNotifier protocol, even though it was submitted to fdo.</p><p>This failure can at least partly be attributed to fdo lack of decent protocol agreement process. If you read the archives you will see GNOME developers were interested by the spec but they wanted some changes. The changes were refused and discussion ended.</p><p>&gt; It’s not like any GNOME user would ever install a KDE application to run under GNOME – at best Qt-only applications.</p><p>That is grossly wrong. Ask digiKam devs if they don't have any GNOME users. Ask the same question to Amarok devs. Heck, I even get feedback from GNOME users for Gwenview, and it's not like there is no GNOME equivalent image viewers. Sure GNOME integrists won't install anything coming from the other side, but I don't care about them. I don't care about KDE integrists either, I care about open-minded, free software users and developers.</p>","replies":[{"id":"dsq-457711759","author":"Patrick Niedzielski","deleted":false,"createdAt":"2011-03-27T23:19:48Z","message":"<p>Well written response, +1.</p>","replies":[]},{"id":"dsq-457711762","author":"Markus","deleted":false,"createdAt":"2011-03-27T23:44:33Z","message":"<blockquote>Things won’t change with such an attitude.</blockquote><p><br>Things didn't change with Qxygen-GTK, the QtGTK theme engine, automatic button ordering,…</p><p></p><blockquote>Try GIMP.</blockquote><p><br>Oh yes, you're right. GIMP seems to do it. The only “GNOME” application that never cared about the GNOME Interface Guidelines is the only one not on a GUI crusade trying to force the GNOME HIGs on everybody else. Awesome…</p><p></p><blockquote>This failure can at least partly be attributed to fdo lack of decent protocol agreement process. If you read the archives you will see GNOME developers were interested by the spec but they wanted some changes.</blockquote><p><br>I've read that no GNOME person ever bothered to read the specs until it was too late for drastic changes.<br>There is, at least today, no real interest to adopt the specs at least as better fall-back solution than the crappy XEmbed method.<br>They say it may come in the future if anybody is ever willing to implement it. Nobody is.</p><p></p><blockquote>I don’t care about KDE integrists either, I care about open-minded, free software users and developers.</blockquote><p><br>I'm open minded in a way that I always try out the latest GNOME software but I don't think it makes sense anymore to waste resources to make KDE applications look OK in a hostile environment. Oxygen-GTK at least makes sense from a KDE POV because it makes GTK applications look good in KPW.</p><p>I understand the rationale behind your post: Unity 2D is written in Qt which means there is a likelihood that Ubuntu 11.10 will ship a few Qt applications and as a Canonical employee you don't want them to look bad. That's fine but realistically no real KDE application will be bundled with Ubuntu because the deps are too large.</p><p>For new applications using QFormLayout etc. is probably no increased workload but refactoring existing applications is, at least IMO, not worth the effort for a handful of users.</p>","replies":[{"id":"dsq-457712483","author":"Aurélien","deleted":false,"createdAt":"2011-03-28T01:53:38Z","message":"<blockquote><br>I’m open minded in a way that I always try out the latest GNOME software but I don’t think it makes sense anymore to waste resources to make KDE applications look OK in a hostile environment. Oxygen-GTK at least makes sense from a KDE POV because it makes GTK applications look good in KPW.<br></blockquote><p></p><p>If GNOME is an \"hostile environment\", I wonder what you would call Windows or Mac OS. Do you also suggest developers working on porting KDE on those platforms should stop?</p><p></p><blockquote><br>I understand the rationale behind your post: Unity 2D is written in Qt which means there is a likelihood that Ubuntu 11.10 will ship a few Qt applications and as a Canonical employee you don’t want them to look bad.<br></blockquote><p></p><p>This is my personal blog. The rationale behind my post is to share with other Qt and KDE developers the little amount of wisdom I think I gathered. Nothing written here has ever been suggested by Canonical or any other company I used to work for.</p><p></p><blockquote>That’s fine but realistically no real KDE application will be bundled with Ubuntu because the deps are too large.</blockquote><p></p><p>There I agree with you. This is why I hope the work on modularizing kdelibs will be a success.</p>","replies":[{"id":"dsq-457712488","author":"Markus","deleted":false,"createdAt":"2011-03-28T07:00:46Z","message":"<blockquote>If GNOME is an “hostile environment”, I wonder what you would call Windows or Mac OS. </blockquote><p><br>Users of Mac OS X and Windows are largely indifferent about the used toolkit. Mac users don't care as long as it integrates nicely while Windows users never cared at all about consistent GUIs.</p><p>GNOME users are the only user group I know that is (at least for a large part, I grant you that there is a small fraction that uses Amarok and digiKam) actively boycotting anything KDE-related.</p>","replies":[{"id":"dsq-457712493","author":"Aurélien","deleted":false,"createdAt":"2011-03-28T11:32:07Z","message":"<p>I guess there is no way to change your mind. Feel free to continue spreading your hatred. I would appreciate however if you would do so on your own blog rather than here.</p>","replies":[{"id":"dsq-457712688","author":"Pawlo","deleted":false,"createdAt":"2011-03-29T12:46:41Z","message":"<p>He doesn't spread hatred, but he describes reality. Btw. GIMP doesn't suck in KDE, because GIMP is not a gnome application.</p>","replies":[{"id":"dsq-457712789","author":"Aurélien","deleted":false,"createdAt":"2011-03-30T12:07:20Z","message":"<p>Maybe hatred is too strong a word. Still, excluding users just because they use the GNOME desktop is at best discrimination.</p>","replies":[{"id":"dsq-457712923","author":"Markus","deleted":false,"createdAt":"2011-04-05T04:22:22Z","message":"<p>Nobody is talking about excluding GNOME users, ie. checking whether GNOME runs and then refuse to execute the application. That would be mean.</p><p>I'm also not saying that for new applications it'll make perfect sense to take care and follow your advises. After all, it's no added work, right?</p><p>The only aspect that IMO does not make sense is to redo all existing applications because the workload is high (depending on the amount of KDE'isms used, of course) for little gain.<br>I'd rather see the developers fix actual bugs than to redo cosmetics for a tiny fraction of users.<br>Heck, even when I use GTK apps under KPW I'd rather see a crah bug fixed than to “fix” some benign button placement “bug”.</p>","replies":[]}]}]}]}]}]}]},{"id":"dsq-457711765","author":"yman","deleted":false,"createdAt":"2011-03-28T01:16:53Z","message":"<p>The KDE devs wanted a spec that gave the workspace complete control over the presentation of the StatusNotifier while the GNOME devs wanted a spec that gave complete control to the apps. The fundamental design goals were different so it's not surprising that many of the changes proposed by the GNOME were rejected, nor that GNOME has refused to adopt a protocol that it believes to be fundamentally flawed. Fortunately, it seems everyone else besides GNOME agrees with KDE, and once that approach is proven, perhaps GNOME will fall in line.</p>","replies":[{"id":"dsq-457712489","author":"Markus","deleted":false,"createdAt":"2011-03-28T07:04:12Z","message":"<blockquote>The KDE devs wanted a spec that gave the workspace complete control over the presentation of the StatusNotifier while the GNOME devs wanted a spec that gave complete control to the apps.</blockquote><p><br>That doesn't make sense. What part eg. of the Juk tray icon is controlled by Plasma?</p>","replies":[{"id":"dsq-457712494","author":"Aurélien","deleted":false,"createdAt":"2011-03-28T11:38:53Z","message":"<p>Not saying I agree with the idea that apps should be in control of status notifiers, but it is true the workspace has complete control over the presentation. Juk (or any other application) is merely asking for its icon to be displayed. The workspace is free to use it or to substitute it with another one. The Plasma applet will substitute icons with versions matching the current Plasma theme if there are available alternatives. And it is a good thing because it helps providing consistency.</p>","replies":[]}]}]}]}]},{"id":"dsq-457711748","author":"Pawlo","deleted":false,"createdAt":"2011-03-27T14:03:18Z","message":"<p>@Markus, Keith</p><p>+1</p><p>Gnome makes everything to be INCOMPATIBLE with KDE. There's any good will from their side. Thus, I don't see a single reason to make applications compatible with gnome. I don't care about gnome at all, it can die and I won't notice.</p>","replies":[{"id":"dsq-457712478","author":"Anonymous","deleted":false,"createdAt":"2011-03-27T19:37:57Z","message":"<p>Huhu there are you again. Trolling against Gnome this time? Was communism and the dirty muslims threating honest citizens within the EU and UN not enough? Gnome is free software after all and you won't get any Gnome users if you can't show them off nice KDE features/apps in the first place. Even though KDE has far less support than Gnome from commercial vendors that is why it is soooo nicely working and successful in the end. Not because KDE devs flame other fanboys without arguments... Have you ever used Gnome? It is pretty well done compared to Windows XP/Vista/7... <br>Man, you really have to think about your aggressions. You are the perfect subject for right wing/conspiracy manipulation. Not only you have problems with the world after all...</p>","replies":[{"id":"dsq-457712485","author":"Pawlo","deleted":false,"createdAt":"2011-03-27T20:21:06Z","message":"<p>I gave evidences unlike you. I don't have any problems with Muslims. I prefer Muslims than the Left. Looking how both DEs are evolving it seems KDE has superior support compared to gnome. Just check plasma and gnome shell and guess which one is disaster? Gnome isn't successful at all. Canonical and Ubuntu are. I used gnome when KDE 4.0 arrived, but I switched immediately when 4.1 appeared. I used gnome few times later too. Read Aarons posts and comments, there are many evidences about gnome being unfriendly to outside world. Summing up, those are gnome folks who have problems with others. According to manipulation check the facts about novell, ximians and gnome foundation. Isn't supporting ms makes novell and gnome foundation hypocrites?</p>","replies":[]}]}]},{"id":"dsq-457711747","author":"kz","deleted":false,"createdAt":"2011-03-27T15:31:46Z","message":"<p>Nice, I'm now using openbox as my primary desktop shell because I have an old laptop, but I still use mainly KDE apps. GTK/Qt/KDE integration matters for me.</p>","replies":[]},{"id":"dsq-457711752","author":"Joachim Mairböck","deleted":false,"createdAt":"2011-03-27T16:37:03Z","message":"<p>Slightly off-topic: Gwenview on Windows XP has the same text color problems with the native Windows XP Qt style (using current stable KDE on Windows, which is still 4.5.4).</p>","replies":[{"id":"dsq-457712480","author":"Aurélien","deleted":false,"createdAt":"2011-03-27T17:36:24Z","message":"<p>If you have a development setup, can you try modifying the code to see if hardcoding Plastique would fix the issue? A crude way to test is to open app/startpage.cpp, and add a \"return true;\" as the first line of the \"styleIsGtkBased()\" function.</p>","replies":[]}]},{"id":"dsq-457711749","author":"Pau Garcia i Quiles","deleted":false,"createdAt":"2011-03-27T16:55:14Z","message":"<p>As always, an interesting article!</p><p>For the icons, if you use Qt 4.6 or newer, you can use <a href=\"http://doc.qt.nokia.com/4.7/qicon.html#fromTheme\" rel=\"nofollow noopener\" title=\"http://doc.qt.nokia.com/4.7/qicon.html#fromTheme\">QIcon::fromTheme</a> to show the icons that are the best fit for the current theme.</p>","replies":[{"id":"dsq-457712482","author":"Aurélien","deleted":false,"createdAt":"2011-03-27T17:27:35Z","message":"<p>Very good suggestion Pau! I just added a paragraph about QIcon::fromTheme() to the Icons section.</p>","replies":[{"id":"dsq-457712686","author":"Pau Garcia i Quiles","deleted":false,"createdAt":"2011-03-27T19:17:11Z","message":"<p>When possible, I use QIcon::fromTheme in combination with QStyle::StandardPixmap for the fallback. For instance, for the DVD icon:</p><p>QIcon::fromTheme(\"drive-optical\", qApp-&gt;style()-&gt;standardIcon(QStyle::SP_DriveDVDIcon));</p><p>Or with your own icon in case Qt does not provide a suitable fallback.</p>","replies":[]}]}]},{"id":"dsq-457711758","author":"robert","deleted":false,"createdAt":"2011-03-27T21:40:39Z","message":"<p>Guys,<br>I use both DE's. However, I don't see the point of this article. The two screenshots (under Double margins and Others) look really the same. I admit that I didn't wear my glasses but if I had to wear them to notice a difference, then something is wrong.</p><p>Or is the point that this article wants to make, that KDE is much more straight forward to develop for in stead of Gnome?</p>","replies":[]},{"id":"dsq-457711764","author":"momentum","deleted":false,"createdAt":"2011-03-28T01:04:14Z","message":"<p>No offence, but may I ask what gnome you have in mind? Old gnome with panels etc aka \"GNOME legacy\", new GNOME Shell or maybe Unity? There is such a mess in gnome land now, that there is really hard to support something</p>","replies":[{"id":"dsq-457712486","author":"Aurélien","deleted":false,"createdAt":"2011-03-28T01:44:06Z","message":"<p>I don't have any particular GNOME desktop in mind. I believe the suggestions I make in this post should help blending KDE applications in any GNOME-based desktop, be it GNOME 2, GNOME Shell or Unity.</p>","replies":[]}]},{"id":"dsq-457711767","author":"Vadim Peretokin","deleted":false,"createdAt":"2011-03-29T05:44:41Z","message":"<p>Thank you for looking this way :)</p>","replies":[]},{"id":"dsq-457711770","author":"Andrew M","deleted":false,"createdAt":"2011-03-31T08:40:31Z","message":"<p>Please ignore the people commenting about GNOME not trying to integrate. As you have probably already figured out, none of them would have contributed a single line of code to either GNOME or KDE so this doesn't actually affect them at all.</p>","replies":[{"id":"dsq-457711773","author":"Markus","deleted":false,"createdAt":"2011-04-05T04:27:38Z","message":"<p>I don't contribute to KDE? That's news to me…<br>In fact before Aurélien made it his personal crusade to improve KDE GUIs, I felt like I was the only one who even cared.</p><p>If you eg. noticed any stupid placeholder questionmark icons turning into proper icons during the releases, thank me for that.</p>","replies":[]}]},{"id":"dsq-457711771","author":"Roshan","deleted":false,"createdAt":"2011-04-01T23:45:06Z","message":"<p>I've liked this series very much. Do keep writing. I hope you don't get too drawn into some of the obvious flamebait in the comments.</p>","replies":[{"id":"dsq-457711772","author":"Aurélien","deleted":false,"createdAt":"2011-04-02T00:46:53Z","message":"<p>Thanks! Don't worry I don't plan to stop.</p>","replies":[]}]}]