[{"id":"dsq-457710308","author":"leo","deleted":false,"createdAt":"2009-02-14T19:24:52Z","message":"<p>i've always had good success with the creative soundblaster live!.</p><p>it's really quite old, and you can find it for $5 on ebay usually, but it has a good hardware mixing chip (emu10k1), unlike most new soundcards that are hardly supported.</p>","replies":[]},{"id":"dsq-457710311","author":"Johannes","deleted":false,"createdAt":"2009-02-14T20:15:42Z","message":"<p>Hi,</p><p>last year i bought a usb sound card for dj-ing on a party with my laptop. Now i have this model from Speedlink:<br><a href=\"http://www.speed-link.com/?p=2&amp;cat=16&amp;pid=2810&amp;paus=1&amp;act_lang=en\" rel=\"nofollow noopener\" title=\"http://www.speed-link.com/?p=2&amp;cat=16&amp;pid=2810&amp;paus=1&amp;act_lang=en\">http://www.speed-link.com/?...</a></p><p>It was recognized from ubuntu 8.10 without any configuration to do. I have used it with mixxx 1.6.1 on the party and it works also fine with skype.</p><p>The only thing i had to do is the modification of the audio device configuration in mixxx.</p><p>The output from this soundcard is good for my ears, but i haven't much knowledge about audio-devices and sound quality.</p><p>Greetings from Germany<br>Johannes</p>","replies":[]},{"id":"dsq-457710313","author":"Peter Grasch","deleted":false,"createdAt":"2009-02-14T20:15:52Z","message":"<p>USB Soundcards seem to follow a specific standard so there is a generic snd-usb-audio module which works for a lot of models.</p><p>For example it worked instantly and very well with an alesis io|2: <a href=\"http://www.techfabrik.de/alesis/produkte/io2.html\" rel=\"nofollow noopener\" title=\"http://www.techfabrik.de/alesis/produkte/io2.html\">http://www.techfabrik.de/al...</a></p><p>Btw: the io|2 is a good choice. It is relatively cheap and has quite impressive specs / audio quality considering its size!</p>","replies":[]},{"id":"dsq-457710307","author":"Phil Thane","deleted":false,"createdAt":"2009-02-14T21:18:15Z","message":"<p>I have used this: <a href=\"http://www.m-audio.com/products/en_us/FastTrackUSB.html\" rel=\"nofollow noopener\" title=\"www.m-audio.com/products/en_us/FastTrackUSB.html\">www.m-audio.com/products/en...</a> with UbuntuStudio</p>","replies":[]},{"id":"dsq-457710309","author":"feicipet","deleted":false,"createdAt":"2009-02-14T21:24:13Z","message":"<p>I'm using a Maya 44 USB with my laptop (the internal soundcard's busted). I haven't been able to get the input interfaces working yet, but the output's fine and it sounds better than my housemate's X-Fi stereo output (surround output can't be compared as it's not supported on the device).</p>","replies":[]},{"id":"dsq-457710314","author":"chithanh","deleted":false,"createdAt":"2009-02-14T21:28:08Z","message":"<p>Actually, the cheapest USB sound adapters that you can find on eBay should do. These are USB Audio Class devices and supported out-of-the box by all operating systems.</p><p>Ironically, the more expensive models sometimes choose to deviate from the \"standard\" path and tend to cause more problems, as they need special drivers.</p>","replies":[]},{"id":"dsq-457710316","author":"mactalla","deleted":false,"createdAt":"2009-02-15T00:07:56Z","message":"<p>I personally use a Turtle Beach AudioAdvantage Micro which has worked great for me.  No special drivers (supported by ALSA).  Can plug in earphones/analog stereo or digital passthrough using the optical S/PDIF.</p><p>Here's a link from the manufacturer:<br><a href=\"http://www.turtlebeach.com/products/micro/home.aspx\" rel=\"nofollow noopener\" title=\"http://www.turtlebeach.com/products/micro/home.aspx\">http://www.turtlebeach.com/...</a></p><p>I bought mine several years ago, but would assume they're still available.</p>","replies":[]},{"id":"dsq-457710317","author":"Alan Pope","deleted":false,"createdAt":"2009-02-15T04:06:54Z","message":"<p>I bought a Soundblaster Extigy off ebay and it \"just works\".</p>","replies":[]},{"id":"dsq-457710320","author":"altbau","deleted":false,"createdAt":"2009-02-15T12:27:57Z","message":"<p>I'm using an Asus Xonar U1 on Opensuse 11.1 here without any problems - as others noted, the generic USB-audio driver handles almost every card out there. The only problems I had was my onboard sound interfering, but blacklisting the module took care of that.</p>","replies":[]},{"id":"dsq-457710322","author":"Matthias Kretz","deleted":false,"createdAt":"2009-02-15T13:40:07Z","message":"<p>I have an Alesis io|2 and two CMedia -based USB audio devices.<br>The Alesis io|2 is superb hardware but I have several problems with it on Linux:<br>1. ALSA dmix with 24bit is still broken and makes the application crash at random (bug reported and patch submitted to the ALSA bug tracker but ignored so far).<br>2. ALSA's plug layer (used when playing 16 bit audio to the device) introduces a ridiculous amount of noise - it sounds as if the lower ~12bits are noise...<br>3. when using it in full-duplex (e.g. using jackd) with my laptop I get random noise (full volume) on the output. It's fine with my other (non-portable) computer, though. So I suspect it also depends on the USB subsystem to trigger this.</p><p>The C-Media based USB devices sometimes sound like they playback with the wrong samplerate and then have to skip because of buffer over-/underruns. Dunno if it's ALSA's or the hardwares fault.</p><p>Sad :(</p>","replies":[]},{"id":"dsq-457710324","author":"gussi","deleted":false,"createdAt":"2009-02-16T03:40:37Z","message":"<p>I use this one:</p><p><a href=\"http://www.dealextreme.com/details.dx/sku.5831\" rel=\"nofollow noopener\" title=\"http://www.dealextreme.com/details.dx/sku.5831\">http://www.dealextreme.com/...</a></p><p>Works great under Linux, especially considering the price tag ;-)</p>","replies":[]},{"id":"dsq-457710325","author":"Andreas","deleted":false,"createdAt":"2009-02-16T05:54:07Z","message":"<p>I have successfully used an M-Audio Revolution 7.1 audio interface with Mixxx. Headphones on output channel 0 (with the headphone amplifier) and PA on channel 1.<br>Turtle Beach has been working well with Linux since forever, too... but really it's all simply USB audio class hardware.<br>Don't buy Creative, they tend to lie in their specs, have really bad drivers (not relevant here), and generally produce inferior hardware. I'm not saying that a particular piece of their hardware is bad, but I would never buy from them for the same reason I buy nothing from Sony: they have chosen to fuck their customers over, I choose not to buy their merchandise.<br>IME M-Audio has the best sound quality for the money between 50 and 300 euros.</p>","replies":[]},{"id":"dsq-457710328","author":"Jord","deleted":false,"createdAt":"2009-02-16T21:34:28Z","message":"<p>I was in the same situation. I have looked a lot on some HTPC sites and audio sites. They all say to go for a VIA chipset and forget about soundblaster.</p><p>Can't remember all the reasons, but I think it had to do with the soundblaster kinda 'faking' the bitrates when doing the D/A conversion.</p><p>I went with a Terratec Aureon 5.1 fun. Not too expensive and it works very, very well and out of the box. And with phonon, you just plug it in and set it as your default card. Bang boom it works (big improvement compared to the KDE 3.x series)</p>","replies":[]},{"id":"dsq-457710329","author":"Aurélien Gâteau","deleted":false,"createdAt":"2009-02-17T13:52:16Z","message":"<p>Thanks for all your answers. I decided for a Terratec Aureon 5.1 USB mk2. Even if I initially said I did not need 5.1, it's a good idea to have it because it gives the possibility to use front output for the main output and rear output for the headphones.</p><p>It works well, the only trick in Mixxx was to set the sampling rate to 48Khz instead of 44.1, otherwise it would not open the device (hint: if you get terse error messages from Mixxx, look at stderr: it may contain more info. At least it did for me).</p>","replies":[]},{"id":"dsq-457710331","author":"Donn","deleted":false,"createdAt":"2009-03-07T01:52:39Z","message":"<p>Great shout out to the lazy web there. I was looking to do the exact same thing with Mixxx, based on the comments and availability I went for the same Terratec usb soundcard, worked great with not set up needed.</p><p>I didn't need to set the sample rate to 48 Khz as you suggested which is just as well as all my music has been encoded in 44.1 Khz.</p><p>Shame my Maudio firewire soundcard doesn't play quite so nicely with Ubuntu but I'm sure with some poking it could be convinced to work.</p>","replies":[]},{"id":"dsq-457710332","author":"H.","deleted":false,"createdAt":"2009-04-02T07:10:21Z","message":"<p>I've got a USB sound card that I don't recommend. It's small and light-weight with 2 jacks (out is green / in is yellow, not red) and a sticker says \"Model  PD552; USB 3D SOUND\" (so it seems to be manufactured by Comodow).<br><a href=\"http://www.mbc.ge/access/PD552-unit.gif\" rel=\"nofollow noopener\" title=\"http://www.mbc.ge/access/PD552-unit.gif\">http://www.mbc.ge/access/PD...</a></p><p># lsusb<br>[...]<br>ID 1130:f211 Tenx Technology, Inc. USB audio headset<br># aplay -l<br>**** List of PLAYBACK Hardware Devices ****<br>card 0: default [USB  AUDIO  ], device 0: USB Audio [USB Audio]<br>  Subdevices: 1/1<br>  Subdevice #0: subdevice #0<br>So</p><p>2 problems:<br>hardware mixer has only like 3 settings (quiet, quite loud, super loud); @ALSA users: adding an additional software PCM mixer (softvol) via .asoundrc helps<br>fixed sample rates (48 kHz out, 24 kHz in)</p><p>The latter annoys me because I can't use it with Mixxx at 44.1 kHz and I don't want Mixxx to upsample everything. Does anyone know of a USB sound card that does at least 44100 Hz as well as 48000 Hz? It's so hard to find information on the supported sampling rates. Thanks in advance!</p><p>Someone else with the same card/problem:<br><a href=\"http://ultrahigh.org/2007/03/21/slug-usb-audio/\" rel=\"nofollow noopener\" title=\"http://ultrahigh.org/2007/03/21/slug-usb-audio/\">http://ultrahigh.org/2007/0...</a></p>","replies":[]}]
