[{"id":"dsq-457711091","author":"Oszkar Ambrus","deleted":false,"createdAt":"2010-06-16T14:19:24Z","message":"<p>Indeed, last time I used it for some demo presentation, and it worked quite nicely.</p><p>Unfortunately, it would crash very often (this aspect is quite unpolished), so I'd really have to see about saving my project every few seconds.</p><p>But other than that, it has a whole bunch of cool features (in addition to the good set of standard actions), like multi-track videos, text animation and cool transitions.</p>","replies":[]},{"id":"dsq-457711092","author":"Tomaz Canabrava","deleted":false,"createdAt":"2010-06-16T17:12:34Z","message":"<p>anyone has any news on the current development of kdenlive? the site is more than 8 months quiet.</p>","replies":[]},{"id":"dsq-457711094","author":"Sean Tilley","deleted":false,"createdAt":"2010-06-16T17:14:58Z","message":"<p>I've been using KDEnlive for quite some time now. It used to be really, really unstable, but it seems they've fixed most of those problems. I think it's a fantastic consumer-level video editor. Especially with the GHNS integration; you can download all kinds of different render profiles and such. I look forward to seeing WebM rendering from it in the future.</p>","replies":[]},{"id":"dsq-457711095","author":"thorGT","deleted":false,"createdAt":"2010-06-16T17:40:30Z","message":"<p>Now this is a perfect example of a design based on the UNIX principles : build a nice GUI on a shared core. Something they yet have to learn to do in the closed-source world. But somebody please explain me, why do those guys create effort duplication? Openshot is nice in that it shares the core, but then again, it uses some immature toolkit and really looks like a Kdenlive clone (no offense, I know any video editor is going to duplicate the appearance of $SOME_VIDEO_EDITOR, which was the first one to carry such an interface). Kdenlive is based on the power of Qt and KDE, so why wouldn't they just come and talk over what they didn't like in Kdenlive before wasting time reimplementing stuff?</p>","replies":[]},{"id":"dsq-457711096","author":"Will Stephenson","deleted":false,"createdAt":"2010-06-16T17:54:17Z","message":"<p>@Oszkar: I've also noticed, happily, that stability has drastically improved recently</p>","replies":[]},{"id":"dsq-457711098","author":"Oszkar Ambrus","deleted":false,"createdAt":"2010-06-16T17:59:07Z","message":"<p>@Sean, @Will: thanks, it's really good to know stability has improved, as it was a very promising project. I'll have to check it out again :)</p>","replies":[]},{"id":"dsq-457711100","author":"Enrico Ros","deleted":false,"createdAt":"2010-06-19T10:10:18Z","message":"<p>I completely agree: KDENLIVE ROCKS!! I love transitions, blending, and the 'titling' feature, that really lets you create 'movies' just by rendering titles ;-)<br>My result is here: <a href=\"http://www.youtube.com/watch?v=JewSqsjWp-8\" rel=\"nofollow noopener\" title=\"http://www.youtube.com/watch?v=JewSqsjWp-8\">http://www.youtube.com/watc...</a></p>","replies":[]}]
