[{"id":"dsq-457710512","author":"Sheytan","deleted":false,"createdAt":"2009-06-02T21:30:43Z","message":"<p>Yes! Glad to hear about photos importer in Gewnview. It's like I don't really use DigiKam. I'll try it :D Thanks ;]</p>","replies":[]},{"id":"dsq-457710514","author":"andreas","deleted":false,"createdAt":"2009-06-02T23:19:39Z","message":"<p>The photo importer would be nice. I somethimes have problems with the exif rotation. maybe it would be nice to auto rotate the pictures when you import them.</p><p>thanks<br>andreas</p>","replies":[]},{"id":"dsq-457710515","author":"Thomas Coopman","deleted":false,"createdAt":"2009-06-02T23:19:51Z","message":"<p>Why will you have to rewrite it in C++ before integrating it in KDE?<br>Is there no general direction towards writing programs in scripting languages in KDE and is this kind of program not ideal for this?</p>","replies":[{"id":"dsq-457710519","author":"Aurélien","deleted":false,"createdAt":"2009-06-03T01:18:34Z","message":"<p>As far as I know there is only one Python application in KDE: it's a printer tool and I remember it was a bit hard to swallow for some devs, so I figured maybe I should avoid such problems... Another point was being able to easily share some code with Gwenview (I do not want to go through the pain of creating bindings to be able to call Gwenview code from Python!)</p><p>Having said that, maybe my first sentence can be changed to \"there is already one Python application in KDE\" :). I love Python and there is nothing which requires heavy computation in this importer, so it should perform correctly in Python.</p>","replies":[]}]},{"id":"dsq-457710516","author":"mkyral","deleted":false,"createdAt":"2009-06-03T00:24:55Z","message":"<p>Hi,<br>Importer looks nice. I did similar script in bash. No gui, just take date of event from image, asks for event name and put all into //YYYYMMDD_. Actually it supports jpg, tiff, raw images and videos (mov). Then are some additional action performed:<br> * autorotate jpeg images<br> * extract thumbnails from raw images, because Gwenview does not support them (but actual Dolphin does)</p><p>And at the end Gwenview is started ;-)</p><p>If I will be able to replace the shell script with Gwenview importer, would be great.</p><p>So my wishes:<br> * fully configurable archive path<br> * Ability to do some additional actions like above + user configurable actions<br> * Optional and configurable final rename action</p>","replies":[{"id":"dsq-457710521","author":"Aurélien","deleted":false,"createdAt":"2009-06-03T01:19:51Z","message":"<p>It should be configurable at the end. I just want to make sure it comes about with sane defaults and a non scary user interface (ie: the configuration settings should not be the first thing you see)</p>","replies":[]}]},{"id":"dsq-457710518","author":"mkyral","deleted":false,"createdAt":"2009-06-03T00:27:56Z","message":"<p>Grrr, the correct path is /&lt;archive_dir&gt;/&lt;year&gt;/YYYYMMDD_&lt;event_name&gt;/</p><p>\"Marks\" were filtered out without alert :-(</p>","replies":[]},{"id":"dsq-457710526","author":"VangelistX","deleted":false,"createdAt":"2009-06-06T20:52:26Z","message":"<p>I'm a Ubuntu (Gnome) user. Gwenview is one of very few apps from KDE that I really need (IMHO, THERE IS NO good image browser for GTK/GNOME).</p><p>Is there any possibility to make GwenView better integrated with GNOME and less dependent on additional KDE libs?</p><p>I know that GwenView has a lot of fans among GNOME users.</p><p>Maybe it is possible to create a GwenView LITE build especially for GNOME/XFCE users which doesn't require installation unneeded KDE applications to use GwenView as a default browser? Maybe it is possible to replace some of KDE dependencies with GNOME ones?</p>","replies":[{"id":"dsq-457712112","author":"Aurélien","deleted":false,"createdAt":"2009-06-07T00:30:29Z","message":"<p>Removing kdelibs dependency is not going to happen, as it would basically mean rewriting Gwenview from scratch. Still, you should be able to get better integration of Gwenview (and any other Qt/KDE application) into GNOME with the new QGtk Qt style.</p>","replies":[]}]}]