[{"id":"dsq-457709470","author":"kinto","deleted":false,"createdAt":"2007-10-11T14:10:44Z","message":"<p>Nice! Can't wait to gove it a try</p>","replies":[]},{"id":"dsq-457709473","author":"Thomas Zander","deleted":false,"createdAt":"2007-10-11T14:13:12Z","message":"<p>Why don't you use a QDockWidget so the user can have it floating or as a sidebar as he wants?</p>","replies":[]},{"id":"dsq-457709474","author":"Aurélien","deleted":false,"createdAt":"2007-10-11T14:22:07Z","message":"<p>@Thomas: the thing is: Doing so would require the normal sidebar to be a QDockWidget, otherwise interaction between the crop window and the sidebar won't be nice: docking the crop window on the right would put the sidebar between the image the window.</p><p>I first tried making the sidebar a \"locked-down\" QDockWidget so that I would be able to use a QDockWidget for the crop sidebar, but it didn't look right. Even in a very \"locked-down\" setup (no undock allowed, no close allowed, no moving allowed), it was displaying a useless title bar, which was wasting space. That's why I decided to go with this simple solution, at least for now.</p>","replies":[]},{"id":"dsq-457709465","author":"Sébastien Laoût","deleted":false,"createdAt":"2007-10-11T14:39:21Z","message":"<p>What's the point in having the possibility to define pixel-perfect crop?</p><p>Gwenview is a simple image viewer.<br>Having the possibility to basically edit images is amazing!<br>Thanks very much, this was needed for a long time.</p><p>Gwenview will mainly be used to manage vacation photos, to crop pictures to keep only faces from people of the familly, to remove the left part that is not very good lokking, etc...<br>Cropping a person/face/whatever_in_a_photo 1 pixel too far on the right is not grave.</p><p>People wanting more control are web-designers and such, who wants to crop the mockup to extract the header, the button... at the very pixel precision.<br>And those people already know and use Gimp or Krita for that.</p><p>If you still want to keep the sidebar, then ok, you're the developer, you decide.<br>And after all, we need a place to add the [ v Crop ] [ x Cancel ] buttons.<br>My mum used Paint Shop Pro this week-end and was not able to validate the cropping. She had not tryed to double-click the cropped area to validate. The Ok/Cancel would have been very handy for she.</p><p>In this case, please strongly consider having a bottom bar, ala Firefox Search-bar for that, with every widgets all aligned horizontally.<br>This will only take a few pixels real estate (only a dozen pixel heigh), will not resize down the image too much, and will not present a big uggly gray area (with a few widgets on it, but still mostly gray).</p>","replies":[]},{"id":"dsq-457709463","author":"Gwenview_fan","deleted":false,"createdAt":"2007-10-11T14:59:58Z","message":"<p>Hi Aurélien,</p><p>did you see this lately:<br><a href=\"http://www.youtube.com/watch?v=vIFCV2spKtg\" rel=\"nofollow noopener\" title=\"http://www.youtube.com/watch?v=vIFCV2spKtg\">http://www.youtube.com/watc...</a></p><p>It would certainly be nice to see this, besides the \"conventional cropping tool\", in our beloved Gwenview.<br>Might be on longterm an option for some KDE-graphic tools too. Maybe worth as a project for GSoC 2008?</p><p>Kind regards,</p><p>Joe</p>","replies":[]},{"id":"dsq-457709468","author":"DanaKil","deleted":false,"createdAt":"2007-10-11T15:41:25Z","message":"<p>There is something I always needed (when I use digikam/showfoto but why not gwenview) :</p><p>sometimes, I have a nice pictures but it can be better centered (a few pixels I don't want near the borders...). I could easily crop the pictures but then, the pictures don't have the same standard size as my others digital pictures</p><p>It could be great if we have a resize tool (integred in gwenview or via a kipi plugin) who allow to crop and then automatically resize the pictures to the original size (or some other predefined size like 1600x1200)...</p><p>I know this will result in a small loss of quality but the resolution of current camera is so high nowadays that it don't matters a lot</p>","replies":[]},{"id":"dsq-457709459","author":"Aurélien","deleted":false,"createdAt":"2007-10-12T11:51:32Z","message":"<p>@Sébastien Laoût: I would like to keep the size widgets because it can be useful even for simple users, think about defining a blog banner, or creating an avatar for a forum for example.</p><p>I also want to add a way to constraint the crop ratio, so that you can crop your photo and it will still print correctly on a 4 x 3 paper.</p><p>Having said that, I see your point about the resize caused by the sidebar, it bothers me too. The problem is that if I make this bar an horizontal sidebar, it will cause the window to have a quite large minimum width, which is not good either. I will give it a thought nevertheless.</p>","replies":[]},{"id":"dsq-457709460","author":"Aurélien","deleted":false,"createdAt":"2007-10-12T11:56:04Z","message":"<p>@Gwenview_fan:<br>It seems everytime I talk about cropping or resizing, someone comes up with this link :-). I know about it, but I haven't had time to investigate further for now.</p>","replies":[]},{"id":"dsq-457709462","author":"Aurélien","deleted":false,"createdAt":"2007-10-12T11:58:29Z","message":"<p>@Danakil:<br>I am not sure what you ask for is really needed: You will probably look at your pictures in auto-resize mode, which will make the size difference invisible for you (as long as the picture dimension ratio is kept).</p>","replies":[]},{"id":"dsq-457709456","author":"Harald","deleted":false,"createdAt":"2007-10-13T07:06:15Z","message":"<p>Quick question - does the new gwenview have background preloading of pictures while viewing a directory of pictures?</p>","replies":[]},{"id":"dsq-457709454","author":"Aurélien","deleted":false,"createdAt":"2007-10-14T02:08:30Z","message":"<p>@Harald: No, not yet.</p>","replies":[]},{"id":"dsq-457709478","author":"Georges","deleted":false,"createdAt":"2007-11-18T23:41:29Z","message":"<p>Where do I find this cropping tool in Gwenview or how do I add it? Because this is one thing I am missing in Gwenview. Thanks.</p>","replies":[]},{"id":"dsq-457709480","author":"Aurélien","deleted":false,"createdAt":"2007-11-19T01:17:59Z","message":"<p>@Georges: You need Gwenview 2.0 to get the cropping tool. It's a part of the upcoming KDE4.</p>","replies":[]}]