[{"id":"dsq-457711637","author":"TheBlackCat","deleted":false,"createdAt":"2011-01-05T05:01:20Z","message":"<p>Any plans to implement sorting and/or filtering by image resolution?</p>","replies":[{"id":"dsq-457712440","author":"Aurélien","deleted":false,"createdAt":"2011-01-05T05:22:07Z","message":"<p>Not for now. What would be the use case for this?</p>","replies":[{"id":"dsq-457712678","author":"DanaKil","deleted":false,"createdAt":"2011-01-05T18:04:25Z","message":"<p>I see one use case : it allows you to look into a messy image folder for a wallpaper that fits your screen (it could be searched by ratio too)</p><p>Cheers :)</p>","replies":[{"id":"dsq-457712783","author":"TheBlackCat","deleted":false,"createdAt":"2011-01-05T21:03:22Z","message":"<p>It wouldn't just be wallpapers.</p><p>Imagine you have a folder full of images of a certain category (say computers), and you want some image of that category for a particular use, say a presentation or poster.  If it is going to look reasonable, you need a higher-resolution image (at least 500 pixels, probably).  Currently you would need to look through every single image to figure out which ones have high enough resolution to be usable.  Then, most likely, you will need to move those images to another folder in order to look through those to find the one you like the best.</p><p>This would allow you to filter it to just those over a certain dimension (or put the higher-resolution images at the beginning or end).  This is the most common use-case for me, and what made me notice it was missing.</p><p>Some others:<br>looking for high-resolution photos for a physical photo album<br>looking for low-resolution images suitable for easy emailing or posting on the web<br>navigating a folder with a bunch of copies of the same set of pictures at different resolutions<br>looking for forum avatars or signatures you made at a specific resolution<br>navigating a really massive and poorly-organized folder, where you know the general size range of the picture you want, but not its file name</p>","replies":[{"id":"dsq-457712922","author":"Heller","deleted":false,"createdAt":"2011-01-05T22:59:26Z","message":"<p>Indeed, you spoke about severals points that I needed in the past :)</p>","replies":[]},{"id":"dsq-457712919","author":"Aurélien","deleted":false,"createdAt":"2011-01-06T02:00:14Z","message":"<p>Thanks for these examples. Implementing this would be a bit tricky right now:  it would require some refactoring to make the image size available to the filter code.</p>","replies":[{"id":"dsq-457712924","author":"TheBlackCat","deleted":false,"createdAt":"2011-01-07T02:31:40Z","message":"<p>Would it help if I submitted a BKO wishlist item about it?</p>","replies":[{"id":"dsq-457713061","author":"Aurélien","deleted":false,"createdAt":"2011-01-07T04:45:29Z","message":"<p>It won't harm, but I must confess I am very bad at BKO handling :/</p>","replies":[{"id":"dsq-645750708","author":"TheBlackCat","deleted":false,"createdAt":"2011-01-14T00:13:23Z","message":"<p>Done: <a href=\"https://bugs.kde.org/show_bug.cgi?id=263057\" rel=\"nofollow noopener\" title=\"https://bugs.kde.org/show_bug.cgi?id=263057\">https://bugs.kde.org/show_b...</a></p>","replies":[]}]}]}]}]}]}]}]},{"id":"dsq-457711642","author":"Roman Shtylman","deleted":false,"createdAt":"2011-01-05T10:28:53Z","message":"<p>Great work Aurelien!! I enjoy reading about all the little improvements :)</p>","replies":[]},{"id":"dsq-457711639","author":"trebor","deleted":false,"createdAt":"2011-01-05T19:09:37Z","message":"<p>Are the changes you have made in your blog article “Common User Interface mistakes in KDE applications” pushed upstream?<br>Personally I hope someone will change the GUI inconsistencies of dolphin (\"places\" widget or other widgets don't have the same height like the location-bar). The same mistake is done in the dialog if you want to open a file (e.g. konqueror, file, open file - the same mistake, the places widget is much to higher than the location bar).<br>If I find some time I post you some screenshots to clarify what I mean.</p><p>in other respects, good wok. keep on</p>","replies":[{"id":"dsq-457711646","author":"Aurélien","deleted":false,"createdAt":"2011-01-05T22:04:04Z","message":"<p>Yes, the changes have been committed to trunk, except for KSnapshot mockup.</p>","replies":[]}]},{"id":"dsq-457711647","author":"Shafqat Bhuiyan","deleted":false,"createdAt":"2011-01-07T02:08:48Z","message":"<p>Since you're looking into user interface improvements, there are some small improvements in Kate/Kwrite you might be interested in:</p><p>1. The horizontal scrollbar should not show when there is no line longer than the window.<br>2. (Maybe) The vertical scrollbar should also be hidden until needed<br>3. The hide menubar shortcut (Ctrl+M) should be available like in other KDE apps</p><p>Thanks again for your work so far.</p>","replies":[]},{"id":"dsq-457711648","author":"Sam","deleted":false,"createdAt":"2011-01-19T23:38:41Z","message":"<p>Howdy,<br>Is it possible to assign a command string to a hotkey within Gwenview? When viewing a image I'd like to be able to hit one key that will resize the image then rename it and then copy the new image to another directory.  <br>Thanks for your time and efforts on this project.<br>Sam</p>","replies":[{"id":"dsq-457712445","author":"Aurélien","deleted":false,"createdAt":"2011-01-20T03:04:07Z","message":"<p>No it's not possible, sorry.</p>","replies":[]}]},{"id":"dsq-457711649","author":"Teun","deleted":false,"createdAt":"2011-01-20T02:37:10Z","message":"<p>Aurélien,</p><p>Thanks for the great work on Gwenview and the other KDE stuff.<br>A question I haven't found an answer on, I like to use keyboard short cuts for zooming and wonder if it is possible to user-define the amount of zoom each key press gives, like 5% or 10%?</p><p>Best regards.<br>Teun</p>","replies":[{"id":"dsq-457711650","author":"Aurélien","deleted":false,"createdAt":"2011-01-20T03:08:13Z","message":"<p>No, this is not possible. Actually the zoom steps are not linear, it goes this way: 1/16, 1/8, 1/4, 1/2, 1, 2, 3...16 with the \"snap zoom\" values (ie value for each you see whole width, or whole height or whole image) inserted in between.</p>","replies":[]}]},{"id":"dsq-457711651","author":"ike ahloe","deleted":false,"createdAt":"2011-01-21T11:21:15Z","message":"<p>i asked before about hiding the top bar and putting controls like in unity (and plasma-netbook). you told me to check out plasma desktop.</p><p>it's just my personal opinion but i think plasma-netbook is a bit unintuitive. theres a lot of stuff everywhere and the visual queues and workflow don't help guide me. i feel/am dumb using it as it's supposed to be simple but i don't know what's going on. :/.  It's also more restrictive than p-desktop (understandably so, not criticism).</p><p> I wish that the ability to hide the top border when using the application control widget would be extended to plasma-desktop. It would then be nice to have an alternate application control widget that was just the oxygen icons for close, minimize, restore/max... options for button order, app icon, name, etc could be configured in the widget's settings similar to how one sets up the buttons for a window theme.</p><p>this would help people attracted to unity's space saving setup enjoy the feature in kde, especially since it's already kind of there in netbook and in widgets.</p><p>i guess i'm just not sure why the work was put into allowing that in netbook but not allowing it as an option in desktop. as a desktop user that does 2d and 3d art, screen space is a big deal not just to netbook users, i hate seeing a big wasted bar of space when good alternative methods are over half written.</p><p>sorry to blab, just thinking aloud. i like to hear your responses to people. (though not technically.... visually and textually i guess is better.)</p><p>i'd be happy to try to code it in this summer once i'm done with school and have some time to learn code, what coding do you suggest learning for plasma and widget type work.</p>","replies":[]}]
