[{"id":"dsq-457710163","author":"fish","deleted":false,"createdAt":"2008-12-17T03:51:42Z","message":"<p>ok, so where can i get the amarok search? i'm on kubuntu nightly...</p>","replies":[]},{"id":"dsq-457710162","author":"xdmx","deleted":false,"createdAt":"2008-12-17T03:52:00Z","message":"<p>I'm with kde 4.1.3 so i don't know if this is fixed, but for example apps like firefox, skype, gimp and other are not found. E.g. i write \"fire\" i expect that firefox shows up, but it doesn't, same thing with \"sky\" or \"gim\", i've to write the full name like \"firefox\" and then it launches it.<br>(these examples work with the kickoff's search, but not with krunner)<br>Is this fixed in kde 4.2?</p>","replies":[]},{"id":"dsq-457710164","author":"Dumas","deleted":false,"createdAt":"2008-12-17T03:54:27Z","message":"<p>That's really cool.  But alt+F2 combination causes avoidance of this program.Any chances to integrate Krunner funcionallity with kickoff's search line? It had some similar functions in 3.5 times. It would be very natural and friendly for novice users.</p>","replies":[]},{"id":"dsq-457710165","author":"Strash","deleted":false,"createdAt":"2008-12-17T03:55:03Z","message":"<p>Unit converter is quite easy to use, like in google in fact :</p><p>10 inch in cm<br>10 km in yard<br>10 L in oz</p><p>or just</p><p>\"number\" \"unit\"<br>to convert from any unit to International System of Units (metric system)</p>","replies":[]},{"id":"dsq-457710167","author":"Jonas","deleted":false,"createdAt":"2008-12-17T03:57:17Z","message":"<p>@kdmx,</p><p>I don't know if it's because of 4.1.3 vs. 4.2, but two of those examples work fine for me (firefox and gimp, using KDE 4.1.82). I don't use skype so can't give an opinion there. Although I think that, as far as using krunner as an application launcher, as long as the program is available in kickoff krunner should be able to find it.</p>","replies":[]},{"id":"dsq-457710160","author":"Dumas","deleted":false,"createdAt":"2008-12-17T04:01:59Z","message":"<p>I use 4.1.3  firefox shows up after typing fire, skype only after typing full app name</p>","replies":[]},{"id":"dsq-457710161","author":"Vinod Khare","deleted":false,"createdAt":"2008-12-17T04:08:43Z","message":"<p>Can it be made possible to search for firefox bookmarks?</p>","replies":[]},{"id":"dsq-457710157","author":"JoselB","deleted":false,"createdAt":"2008-12-17T04:48:07Z","message":"<p>Thanks for post. Now I know that i don't need to use Google's unit converter. But unfortunately KRunner's seams to be a bit broken.</p><p>While some of Strashs examples work others don't :(<br>What works:<br>10 inch in cm<br>10 km in yard<br>What don't work:<br>10 L in oz (L must be l, and oz seams to be unknown)<br>10 cm in inch (this is absolutely strange =&gt; bug)<br>Maybe I should report a bug. Or maybe this is only in 4.1 and fixed for 4.2</p>","replies":[]},{"id":"dsq-457710143","author":"AJ Ashton","deleted":false,"createdAt":"2008-12-17T05:51:38Z","message":"<p>@xdmx:<br>I know on my machine krunner wouldn't recognize \"gim\" as \"gimp\" because its menu entry was actually \"GNU Image Manipulation Program.\" I changed it to \"GIMP\" in the menu editor and now it works. Maybe that's the issue?</p>","replies":[]},{"id":"dsq-457710145","author":"Dread Knight","deleted":false,"createdAt":"2008-12-17T06:20:32Z","message":"<p>I want amarok2 plugin too! :-(</p>","replies":[]},{"id":"dsq-457710146","author":"Aaron Seigo","deleted":false,"createdAt":"2008-12-17T08:27:59Z","message":"<p>hehe.. loved the blog post. very well (funnily) written.</p><p>as for how to improve it, those are both on the roadmap. i was thinking i might have time for those things in 4.2, but i failed =(</p><p>here's looking to 4.3 =)</p>","replies":[]},{"id":"dsq-457710151","author":"damiga","deleted":false,"createdAt":"2008-12-17T09:01:27Z","message":"<p>@JoselB</p><p>In OpenSuse 10.3 with KDE 4.1.82:</p><p>10 l in fl oz works (volume)<br>10 g in oz works (weight)<br>10 cm in inch works</p>","replies":[]},{"id":"dsq-457710152","author":"Janne","deleted":false,"createdAt":"2008-12-17T12:41:23Z","message":"<p>@Dumas: I had the same problem in Kubuntu. IIRC, if you open the Krunner settings, there is something related to the typeahead-search that you can adjust. It fixes the problem. I don't remember the specifics, but it's there, and it is fixable :). Try fiddling around with the settings.</p><p>As to the blogpost itself.... Is it really a \"fix\" if we have to disable functionality? It's a workaround, not a fix. What I would like to see is to get rid of that \"Starting Akonadi server\" altogether. Why do we have it? We don't get similar notification about other services either.</p>","replies":[]},{"id":"dsq-457710139","author":"maninalift","deleted":false,"createdAt":"2008-12-17T14:12:54Z","message":"<p>KRunner is flexible in taking input and executing a command, but is a bit limited in user feedback - it's not appropriate to use the same user feedback for every operation.</p><p>I blogged some a possible extension to the design:</p><p><a href=\"http://maninalift.blogspot.com/2008/12/krunner-and-new-command-interface.html\" rel=\"nofollow noopener\" title=\"http://maninalift.blogspot.com/2008/12/krunner-and-new-command-interface.html\">http://maninalift.blogspot....</a></p><p>Discussion on <a href=\"http://forum.kde.org\" rel=\"nofollow noopener\" title=\"forum.kde.org\">forum.kde.org</a>:</p><p><a href=\"http://forum.kde.org/enriched-krunner-mockup-t-19390.html#pid26220\" rel=\"nofollow noopener\" title=\"http://forum.kde.org/enriched-krunner-mockup-t-19390.html#pid26220\">http://forum.kde.org/enrich...</a></p>","replies":[]},{"id":"dsq-457710153","author":"Gromith","deleted":false,"createdAt":"2008-12-17T15:45:14Z","message":"<p>All that nice and really usefull functionallity gets obsolete as users don't know who to use it. i got used to katapults behaviour over time, but since it isn't included in kde4 anymore i'm using krunner now in stead. the problem about it is: i've no idea how to trigger certain functions. one line of documentation int the settings dialog  would be enough. go to krunner-&gt;settings-&gt;plugins. you get the list of all plugins available and what they do but not how to make krunner do these things, even the information button can't give any further information on that.</p>","replies":[]},{"id":"dsq-457710154","author":"gull","deleted":false,"createdAt":"2008-12-17T16:37:35Z","message":"<p>Where are the accents in your name at Planet KDE?</p>","replies":[]},{"id":"dsq-457710156","author":"Me","deleted":false,"createdAt":"2008-12-17T16:54:05Z","message":"<p>Krunner (or its settings dialogue) indeed lack a way of telling the user what keywords/commands one needs to use a certain plugin. For example the desktop search one, do I have to use \"search xyz\" or does it show them right away, can I use \"search xy AND z\" etc.</p><p>A simple button in the plug-ins list would suffice, yet there is string-freeze and hence happy guessing for KDE 4.2</p>","replies":[]},{"id":"dsq-457710136","author":"Jos Poortvliet","deleted":false,"createdAt":"2008-12-17T17:12:31Z","message":"<p>Vinod Khare<br>Can it be made possible to search for firefox bookmarks?</p><p>Of course, if somebody writes a runner for that... KRunner is pluginbased so it just takes somebody with java or c++ (probably also ruby and python) skills to write it.</p>","replies":[]},{"id":"dsq-457710137","author":"Karl Ove Hufthammer","deleted":false,"createdAt":"2008-12-17T17:22:28Z","message":"<p>Are all these features the reason the runner is so much slower than the one in KDE 3? When I pressed ‘Alt + F2‘ in KDE 3, the dialogue popped up instantly. In KDE 4 it takes too many milliseconds, and thus feels quite unresponsive.</p>","replies":[]},{"id":"dsq-457710135","author":"Aurélien","deleted":false,"createdAt":"2008-12-17T17:39:42Z","message":"<p>@JoselB: 10 cm in inch works here (trunk)<br>10 L is still not recognized</p><p>It would be nice to have some time conversions as well, like \"135 mn in s\" for example.</p><p>@Aaron Seigo: Thanks! the road sounds promising :)</p><p>@gull: Don't know where are my accents. In fact I didn't realized they were not there!</p><p>@Karl Ove Hufthammer: Maybe you should try disabling features you don't need?</p>","replies":[]},{"id":"dsq-457710131","author":"Kristof Bal","deleted":false,"createdAt":"2008-12-17T18:04:28Z","message":"<p>@Aurélien: Time conversion wilml come in KDE 4.3, but adding it now adds too much l10n</p>","replies":[]},{"id":"dsq-457710133","author":"Aurélien","deleted":false,"createdAt":"2008-12-17T19:08:25Z","message":"<p>@KristofBal: Good to hear! Looking forward to it.</p>","replies":[]},{"id":"dsq-457710134","author":"Kristof Bal","deleted":false,"createdAt":"2008-12-17T19:58:54Z","message":"<p>@Aurélien: Or better: I want to make it ;). I already amde mass conversion, so probably Pétri will allow me to make one.</p><p>About L vs. l, I'll look into it.</p>","replies":[]},{"id":"dsq-457710130","author":"mkyral","deleted":false,"createdAt":"2008-12-18T02:49:19Z","message":"<p>Hi,<br>I think that the important small thinks like \"=\" to compute, should be visible somewhere. E.g. shown in tooltip. Before this blogpost I was really confused :-(</p>","replies":[]},{"id":"dsq-457710169","author":"Serge","deleted":false,"createdAt":"2009-03-08T04:42:52Z","message":"<p>I'm testing krunner as a part of KDE 4.2 on a test machine.</p><p>I'm also a katapult user on my KDE 3.5 machine, because I like a easy way to enter my programs I want to start. And I'm not a fan of the new kickoff menu.</p><p>Krunner is extremely powerful and it deserved a much better key combo than .  It think as katapult replacer .</p><p>Is somewhere a good reference of all options of krunner. It will help me very much. In April I will install KDE 4.2 on my main machine.</p>","replies":[]},{"id":"dsq-457710172","author":"rufong","deleted":false,"createdAt":"2009-04-04T19:57:27Z","message":"<p>ur right, it is more powerful than it seems.<br>i can't remember where i first read about krunner,<br>but i LOVE it.</p><p>reading ebooks, i don't even have to type ok(okular)<br>i can type part of the file's name<br>cu gives me culture 02 - iain m banks</p><p>hehe, LOVE IT!</p>","replies":[]},{"id":"dsq-457710175","author":"ubuntuverse","deleted":false,"createdAt":"2009-05-22T19:58:14Z","message":"<p>it's also possible to run bash commands directly.</p>","replies":[]},{"id":"dsq-457710181","author":"Fox","deleted":false,"createdAt":"2009-07-17T14:58:49Z","message":"<p>its also possible to write a expression like \"sin(4)*sqrt(2)\" and then put the \"=\" in the end and it will give you the result.</p>","replies":[]}]