[{"id":"dsq-457711720","author":"Chris","deleted":false,"createdAt":"2011-02-08T12:17:35Z","message":"<p>Hi Aurélien!<br>I like Gwenview much, and getting used to shiny cool desktop effects I was wondering if it would be possible to integrate some transition effects in Gwenview (like e.g. the photo viewer on the Mac). For instance a zoom-effect when you switch from browse-mode to view-mode, or a slide effect when you switch between images.</p>","replies":[{"id":"dsq-457712470","author":"Aurélien","deleted":false,"createdAt":"2011-02-08T13:19:58Z","message":"<p>Yes, transitions between images is something I have been wanting to implement for quite some time, but I need to do some refactoring first.</p>","replies":[]}]},{"id":"dsq-457711721","author":"Stefan","deleted":false,"createdAt":"2011-02-08T16:00:08Z","message":"<p>Re the \"Incomplete Language Support\" dialog: Why don't you just put the \"Run...\" button in a row with the \"Close\" button, like usual for message boxes?</p>","replies":[{"id":"dsq-457711725","author":"Aurélien","deleted":false,"createdAt":"2011-02-08T16:20:53Z","message":"<p>I wanted to do this, but this dialog is actually a KPageDialog and in some situation it will contains multiple pages: one for each possible action. This makes it impossible to get the run button out of the page.</p><p>It could probably be reworked to not use a KPageDialog but that would be a much larger refactor, which I am not ready to start for now.</p>","replies":[]}]},{"id":"dsq-457711724","author":"Luis","deleted":false,"createdAt":"2011-02-09T03:49:27Z","message":"<p>Hi. Any plans to integrate kpeopletag (<a href=\"http://websvn.kde.org/trunk/playground/base/nepomuk-kde/kpeopletag)\" rel=\"nofollow noopener\" title=\"http://websvn.kde.org/trunk/playground/base/nepomuk-kde/kpeopletag)\">http://websvn.kde.org/trunk...</a> into gwenview? I have been using the code in playground and it really makes a huge difference in searches for people through nepomuk.</p>","replies":[{"id":"dsq-457711727","author":"Aurélien","deleted":false,"createdAt":"2011-02-10T03:35:02Z","message":"<p>I didn't know about kpeopletag, but since it's in playground I would have to wait until it mature and probably moves to kdelibs before using it.</p>","replies":[{"id":"dsq-457712471","author":"Luis","deleted":false,"createdAt":"2011-02-10T16:21:00Z","message":"<p>Well, it has been in playground for a very long time. And as far as I can tell, it has been waiting for you ;) (<a href=\"http://techbase.kde.org/Projects/Nepomuk#Link_Pictures_to_Persons)\" rel=\"nofollow noopener\" title=\"http://techbase.kde.org/Projects/Nepomuk#Link_Pictures_to_Persons)\">http://techbase.kde.org/Pro...</a><br>This code has been sitting in playground and going nowhere except that it compiles and works fine. It will never get polished and mature if it is not integrated where it belongs, that is gwenview or digikam. Having this integrated into gwenview and the desktop is something that not even windows has and is the most wanted feature in any social network. Bringing this into the desktop would be awesome.</p>","replies":[{"id":"dsq-457712681","author":"Aurélien","deleted":false,"createdAt":"2011-02-11T14:50:24Z","message":"<p>Interesting! Would you be interested in integrating this into Gwenview? If so please get in touch.</p>","replies":[]}]}]}]}]
