[{"id":"dsq-1042888396","author":"Julian","deleted":false,"createdAt":"2013-09-13T18:23:01Z","message":"<p>You're running an Ivy Bridge, right? Ivy Bridge CPUs can use the new intel_pstate scaling driver. That driver provides two options: 'powersave' and 'performance'.  Powersave roughly works like ondemand (but saves more power); i.e. it scales dynamically; whereas performance just sets it at maximum speed. It's disabled in Ubuntu apparently; but setting  intel_pstate=enable on the commandline shound enable it. Might save you some power when idle and might scale good when needed.</p>","replies":[{"id":"dsq-1043249997","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-09-13T21:15:18Z","message":"<p>Interesting, I am going to try it. Thanks for this information.</p>","replies":[]}]},{"id":"dsq-1044073605","author":"Thomas","deleted":false,"createdAt":"2013-09-14T06:47:12Z","message":"<p>Why would anybody make an init script like that? It is wrong on multiple levels. For one it is the daemon itself plunked into /etc/init.d and not just a start script. The other is that it takes away the possibility to select a governor. The setting does not change by itself, so if it changes, it is probably not by accident.</p><p>Now, come to think of it: it may very well be a but, and the script is meant to run only once after boot. But instead it keeps looping by execing itself. Which makes sense as there is not 'stop', but as there is no author mentioned we can't ask.</p>","replies":[{"id":"dsq-1044889119","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-09-14T21:20:48Z","message":"<p>While I don't think this script is very elegant, it is not a daemon: it just forks itself once so that the sleep does not prevent the other scripts from running during boot.</p>","replies":[]}]},{"id":"dsq-1045319734","author":"Alexander Patrakov","deleted":false,"createdAt":"2013-09-15T08:12:52Z","message":"<p>A very similar bug report was filed by me at <a href=\"https://bugzilla.kernel.org/show_bug.cgi?id=60727\" rel=\"nofollow noopener\" title=\"https://bugzilla.kernel.org/show_bug.cgi?id=60727\">https://bugzilla.kernel.org...</a> . And I have the following heretic thought: CPU load, by itself, is NOT the factor (or at least not the only factor) that should be reacted upon by CPU frequency governors. Rather, they should add some noise to the CPU frequency (e.g. randomly switch it between steps n and n+1) and raise the average frequency if, given more CPU frequency, the running system tends to consume more cycles.</p>","replies":[{"id":"dsq-1046415689","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-09-16T09:57:51Z","message":"<p>That sounds a bit hackish and on the hand it makes sense, but I am not experienced enough on the topic to judge if this idea is good or not :). Have you tried the intel_pstate driver as suggested by Julian (see first comment)?</p>","replies":[]}]}]