[{"id":"dsq-457709705","author":"Jos","deleted":false,"createdAt":"2008-03-13T02:53:52Z","message":"<p>Go for a job that is technically challenging and which produces Free Software.</p>","replies":[]},{"id":"dsq-457709706","author":"ariya","deleted":false,"createdAt":"2008-03-13T03:03:19Z","message":"<p>Or the best compensation vs effort so you still have time for hacking Gwenview.</p>","replies":[]},{"id":"dsq-457709708","author":"David","deleted":false,"createdAt":"2008-03-13T03:21:44Z","message":"<p>Awesome.</p><p>By the way, is it a known problem that transparent images don't show in Gwenview? The background is just black.</p>","replies":[]},{"id":"dsq-457709710","author":"Carlos","deleted":false,"createdAt":"2008-03-13T03:21:48Z","message":"<p>If you can, stay away from consulting companies... Now the market is very hot, but if the economy slows down, its one of the first things to cut. Therefore understanding the type of consulting contracts the company gets (long term government contracts versus per job private sector contracts) can also help to understand the risk.</p><p>It is very likely the EU economy will deacelerate substancially in the second half of the year (60%), so I would worry about it.</p><p>Other than that, since I can't know what your goals are, and I am not a IT guy myself, I don't have useful advice.</p>","replies":[]},{"id":"dsq-457709713","author":"mikmach","deleted":false,"createdAt":"2008-03-13T05:19:47Z","message":"<p>choose job without potential legal entanglements - what you wrote in your free time is your property</p>","replies":[]},{"id":"dsq-457709716","author":"annma","deleted":false,"createdAt":"2008-03-13T10:36:28Z","message":"<p>I cannot give you any specific advice but I'd like to wish you all the best in choosing your new company. Greetings also to your wife and daughter!</p>","replies":[]},{"id":"dsq-457709718","author":"FACORAT Fabrice","deleted":false,"createdAt":"2008-03-13T12:30:01Z","message":"<p>Im' not sure that removing the threading code is a good thing ... Indeed I tend to think that he improves Gwenview overall speeed and responsiveness.<br>Now with Qt4.4 you have also helper libs for thread synchronization.</p>","replies":[]},{"id":"dsq-457709699","author":"Diederik van der Boor","deleted":false,"createdAt":"2008-03-13T12:53:12Z","message":"<p>&gt; Now I am facing an interesting problem: which employer should I choose?</p><p>Someone you get a good feeling about. And you know that better then anyone. Your mind can be tricked with false arguments if they sound convincing. Your feeling however can't be tricked, only ignored..</p><p>So what to look for? It could be that not-so-interesting ad you somehow get enthusiastic about. Something that fits with your passion. Know what you want, and what makes you work with great enthusiasm and fun. At least in my opinion that's more important in the long term then all technical details.</p><p>I don't really care if a company produces Open Source software or not. I do appreciate it if they have an open mind about OSS, having endless discussions about what you do and why isn't that much fun. ;)</p>","replies":[]},{"id":"dsq-457709700","author":"shamaz","deleted":false,"createdAt":"2008-03-13T13:02:57Z","message":"<p>Préfère les SSII qui font principalement de la régie, ca t'évitera de tomber sur des projets au forfait que ta boite aura vendu à un prix ultra compressé et qui sont déjà en retard avant d'avoir commencé.<br>Si tu veux être bien payé, vise des ssii qui font dans la finance et l'assurance (cadextan, adneom etc)<br>Bon et sinon si tu veux ya des ssii spécialisées dans le logiciel libre (linagora etc)<br>juste mes 2 centimes d'euros</p><p>Bonne chance en tout cas !</p>","replies":[]},{"id":"dsq-457709702","author":"obi","deleted":false,"createdAt":"2008-03-13T15:13:54Z","message":"<p>Pareil, gare aux forfaits, ça a vite fait de te bouffer... Et si tu peux éviter les SSII à réputation low cost qui vont avoir tendance à n'avoir que des jeunes sans expérience (voire sans motivation) et pas bien payés =&gt; pas grand chose à apprendre, obligé d'en partir assez rapidement pour voir son salaire augmenter car ils n'ont pas de marges.</p>","replies":[]},{"id":"dsq-457709703","author":"Francois","deleted":false,"createdAt":"2008-03-13T15:28:52Z","message":"<p>\"Someone you get a good feeling about. And you know that better then anyone. Your mind can be tricked with false arguments if they sound convincing. Your feeling however can’t be tricked, only ignored..\"</p><p>So *true*. Go for the one you feel is the best. I did that for all the jobs/opportunities I had and it's always worked great. If you want to work in London, you can contact me, I may have something but you might not like it, I'm not sure.</p><p>Anyway good luck man.</p>","replies":[]},{"id":"dsq-457709694","author":"Aurélien","deleted":false,"createdAt":"2008-03-13T16:53:12Z","message":"<p>@all: thanks for the kind words and the insightful advices, I am taking notes.</p><p>@David: I saw this problem with alpha-channel images, need to fix it.</p><p>@Fabrice Facorat: I didn't expect Gwenview scaling code would benefit from not being threaded, but it actually feels better this way. I suspect Qt scaling code may internally be threaded because on my Dual Core machine I can see both CPU working while scaling. I need to dive a bit more into Qt code to confirm this.<br>It feels good on my machine which is a dual core running at 1Ghz (powersave mode, in performance mode it overheats and freeze). Feedback on running latest code on a slower machine is welcomed.</p>","replies":[]},{"id":"dsq-457709695","author":"Bugs Bane","deleted":false,"createdAt":"2008-03-15T23:24:48Z","message":"<p>No advice. Just thankyou for producing a wonderful piece of slick, polished KDE4 software that I love. The image scaling slider is the coolest ever. Animated gif support would rock, as would having double click on an image blow it up fullscreen.</p><p>I never realised just how cool Gwenview was until I came across Aarons blogpost on it, then I was like \"I need to play with this\" and now I LOVE it! :)</p>","replies":[]},{"id":"dsq-457709696","author":"Aurélien","deleted":false,"createdAt":"2008-03-16T01:55:26Z","message":"<p>@Bugs Bane: Thanks!</p>","replies":[]},{"id":"dsq-457709693","author":"BOETE","deleted":false,"createdAt":"2008-03-18T04:22:30Z","message":"<p>Bonjour, <br>Je pense que la boite n'a que peux d'importance. C'est bonnet blanc et blanc bonnet. Ce qui compte c'est les conditions de départ. La paye (evidement) et le premier client. Chez un grand compte, tu peux y rester des années, même avec un projet qui evolue. Si le client est content de toi, même si tu en a marre de lui, le commercial ne fera aucun effort pour te trouver autre chose. Et même ton client pourra te débaucher après quelque temps.<br>Même chose concernant la paye de départ. Il est beaucoup (beaucoup) plus facile de negocier un bon salaire de départ que des plus qu'hypothetique augmentation future. Les promesses s'envolent, le salaire d'entrée reste. Le must c'est quand la boite de presta te présente a client avant de t'avoir fait signé un contract. Si le client te veux, tu peux negocier comme tu veux. Jamais un boite de presta ne se fachera avec un bon client en refusant un marché pour quelque k€/ans avec les marges qu'ils font.<br>Si non c'est une bonne expérience. Très formateur pour la partie négociation et ils peuvent de faire rentrer chez des clients sans passer par la case RH parfoits obtus et limitant.</p>","replies":[]}]
