[{"id":"dsq-1004702196","author":"Kevin Krammer","deleted":false,"createdAt":"2013-08-17T13:51:32Z","message":"<p>very cool!<br>I am wondering if this could be turned into a git command somehow that would allow things like<br>git reviewboard push [optional SHA, otherwise HEAD] [optional id if updating instead of creating]</p>","replies":[{"id":"dsq-1027676455","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-09-03T09:21:13Z","message":"<p>(sorry for the late answer, was on vacation)</p><p>If you have a command named git-foo in $PATH then you can invoke it as \"git foo\" as well (only shell completion won't work), but what you are referring to is a bit different: you want to post a patch for review, while reviewboard-am is about applying an existing patch to your tree, or am I confused?</p>","replies":[]}]},{"id":"dsq-1005696511","author":"Daniel Vrátil","deleted":false,"createdAt":"2013-08-18T18:43:47Z","message":"<p>I've been using reviewboard-am since I learned about it about 5 months ago and it's a really nice tool, so big thank you!</p><p>I have local version with two small improvements:<br>1) -pN option identical to git am -pN (or patch -pN)<br>2) automatically filling REVIEW: and BUG: keywords in the commit message</p><p>Diff: <a href=\"http://paste.kde.org/p1543db25/\" rel=\"nofollow noopener\" title=\"http://paste.kde.org/p1543db25/\">http://paste.kde.org/p1543d...</a></p><p>If you like it, feel free to push it :)</p>","replies":[{"id":"dsq-1027677437","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-09-03T09:21:54Z","message":"<p>Damn, this sounds good, but now that I am back from vacation the pastebin as expired. Can you post it again?</p>","replies":[]},{"id":"dsq-1091911697","author":"Matěj Laitl","deleted":false,"createdAt":"2013-10-22T10:05:28Z","message":"<p>Bump, please (re)submit this patch, I would help us in Amarok too.</p>","replies":[]}]},{"id":"dsq-1006589299","author":"Jan Kundrát","deleted":false,"createdAt":"2013-08-19T15:18:40Z","message":"<p>Back when I moved Trojita to KDE, I was surprised that RB doesn't offer reasonable git integration a la Gerrit. Looks like we should reconsider its deployment once again.</p>","replies":[]}]
