[{"id":"dsq-2050520865","author":"apater","deleted":false,"createdAt":"2015-05-28T21:27:30Z","message":"<p>Correct me if I'm wrong, but here is what I read in the email thread. (paraphrased)</p><p>Canonical: Branded/Trademarked binaries need permission to be re-distributed. It's about the Ubuntu Trademark/Brand, not about the free software. The software remains libre and can be redistributed without the Trademark, just as Ubuntu does with Debian.</p><p>Response: No! I don't believe you, you are trying to prevent distribution of free software. You are just using the Trademark thing to cover up your true intentions.</p><p>My question: Where is the assumption of good faith in that response?</p>","replies":[{"id":"dsq-2050594069","author":"Andrius Štikonas","deleted":false,"createdAt":"2015-05-28T22:18:57Z","message":"<p>It's not really correct to ask where is an assumption of good faith after you paraphrased the answer!</p><p>Secondly, these kind of questions always give rise to a bit more heated discussions and people are worried about the consequences. Debian already can't distribute Firefox due to similar trademark/brand issues, so it might make a problem for the derivatives.</p>","replies":[{"id":"dsq-2050624803","author":"apater","deleted":false,"createdAt":"2015-05-28T22:41:28Z","message":"<p>You have, of course, read the original statements. The point of paraphrasing is to summarize.</p><p>Did I get the gist of the response wrong?</p>","replies":[{"id":"dsq-2050660452","author":"Andrius Štikonas","deleted":false,"createdAt":"2015-05-28T23:10:06Z","message":"<p>The idea of the response is that claim that binaries are copyrighted are harmful. Just that. It was just slightly heated. If I remember correctly Debian Systemd/Upstart debate was far more heated. Linux kernel mailing list discussions are definitely more heated.</p><p>And of course as many in the community would agree this idea of copyrighted binaries is not nice. I am not a layer though but compilation doesn't seem like \"original creative work\" [1]. If I compile the program is it virtually the same to the one you compile from the same sources.<br>GPL explicitly grants rights to exercise for freedoms (and I've read both GPLv2 and GPLv3) and trying to use other laws (patent law or trademarks) to stop people from exercising those freedoms on binaries would seems disrespectful to the original authors. Even if everything is legal: c.f. tivoization and GPLv2.</p><p>[1] <a href=\"https://en.wikipedia.org/wiki/Copyright\" rel=\"nofollow noopener\" title=\"https://en.wikipedia.org/wiki/Copyright\">https://en.wikipedia.org/wi...</a>  (see first sentence).</p>","replies":[{"id":"dsq-2050665495","author":"apater","deleted":false,"createdAt":"2015-05-28T23:14:20Z","message":"<p>Trademark != Copyright != License. While they all fall under the generic and legally meaningless term \"intellectual property\", they are not synonyms.</p>","replies":[{"id":"dsq-2050679406","author":"Andrius Štikonas","deleted":false,"createdAt":"2015-05-28T23:25:59Z","message":"<p>Now if I were evil I could just say that you try to imply that I don't understand that trademark, copyright and licenses are different. Where is the assumption of good faith in that response? So please don't ask from others for higher standards.</p><p>Besides those things you mentioned there are also patents and trade secrets (usually each described in a different law). Although, trade secrets usually don't have much to do with free software... And patents often don't apply to software unless you are unlucky to live in a few certain countries.</p>","replies":[{"id":"dsq-2050686019","author":"apater","deleted":false,"createdAt":"2015-05-28T23:31:32Z","message":"<p>Well, the messages from the CC used the word trademark not copyright. So I'm not sure why you introduced the term copyright into the conversation. I apologize for my assumption.</p>","replies":[{"id":"dsq-2050703898","author":"Andrius Štikonas","deleted":false,"createdAt":"2015-05-28T23:46:39Z","message":"<p>Well, since I'm not evil I wasn't trying to say that you would imply that :). It was just to illustrate a point that discussion can get slightly heated fairly quickly. But it is important to be able to come back to constructive discussion afterwards.</p><p>Sometimes I also try to ask people not to use 6 year old Partition Manager versions when they report bugs in KDE bugzilla and it gets slightly frustrating when they still do it. I try to be reasonably nice about it but I guess sometimes I could be nicer about it. But KDE community is friendly and wouldn't ask me to step down from the maintainership of Partition Manager because of that. But if they did it would most likely spell the end of KDE Partition Manager. And my example is way less important than Kubuntu... Jonathan is working full-time on it and it is used by significantly more people.</p>","replies":[{"id":"dsq-2050723795","author":"apater","deleted":false,"createdAt":"2015-05-29T00:03:17Z","message":"<p>I haven't looked at what the CoC for KDE or Debian or the Linux kernel lists are. In this case we are dealing the Ubuntu CoC. Perhaps the others are more liberal in their tolerance for heated argument. As I said, I haven't read the guidelines for those projects.</p>","replies":[]}]}]},{"id":"dsq-2064249784","author":"","deleted":true,"createdAt":"2015-06-05T21:09:35Z","message":"","replies":[]}]}]}]}]}]},{"id":"dsq-2051152422","author":"Aurélien Gâteau","deleted":false,"createdAt":"2015-05-29T08:14:30Z","message":"<p>Assuming the response you are paraphrasing is this one: <a href=\"https://lists.ubuntu.com/archives/ubuntu-community-team/2015-May/000480.html\" rel=\"nofollow noopener\" title=\"https://lists.ubuntu.com/archives/ubuntu-community-team/2015-May/000480.html\">https://lists.ubuntu.com/ar...</a></p><p>I don't see any bad faith in that response. Just strong disagreement. I don't see any CoC violation either.</p>","replies":[{"id":"dsq-2051427652","author":"apater","deleted":false,"createdAt":"2015-05-29T13:06:25Z","message":"<p>No, I was paraphrasing the tone of the entire thread, not a single comment.</p><p>Anyway, the response you link to seems to show a misunderstanding of the difference between re-distributing the Ubuntu trademark vs the rights we receive through free software licensing.</p>","replies":[{"id":"dsq-2051441592","author":"Aurélien Gâteau","deleted":false,"createdAt":"2015-05-29T13:16:32Z","message":"<p>Sadly, most comments on this article, including yours, miss my point. I am not taking position on whether a license should be required to distribute the Ubuntu trademark, or whether Kubuntu and other Ubuntu flavors should have received part of the money donated by users to \"Improve support for other flavors\".</p><p>I am saying that I haven't found anything written by Jonathan which did violate Ubuntu Code of Conduct, and as such there is no justification for asking Jonathan to resign from anything.</p>","replies":[{"id":"dsq-2051447417","author":"apater","deleted":false,"createdAt":"2015-05-29T13:20:40Z","message":"<p>My original comment directly addresses your point.</p>","replies":[{"id":"dsq-2051459847","author":"Aurélien Gâteau","deleted":false,"createdAt":"2015-05-29T13:29:30Z","message":"<p>Paraphrasing a whole thread is not the same as \"publishing proofs of what you claim.\"</p>","replies":[{"id":"dsq-2051476714","author":"apater","deleted":false,"createdAt":"2015-05-29T13:40:58Z","message":"<p>True. That is why I used the word \"paraphrase\".</p>","replies":[{"id":"dsq-2051495405","author":"Aurélien Gâteau","deleted":false,"createdAt":"2015-05-29T13:53:43Z","message":"<p>So your comment does not publish any proof of CoC violation. That does not really address my point.</p>","replies":[]}]}]}]}]}]}]},{"id":"dsq-2051524344","author":"apater","deleted":false,"createdAt":"2015-05-29T14:13:02Z","message":"<p>Some examples:</p><p>On 1 May 2015 at 15:04, Jonathan Riddell &lt;jr at=\"\" <a href=\"http://jriddell.org\" rel=\"nofollow noopener\" title=\"jriddell.org\">jriddell.org</a>=\"\"&gt; wrote:<br>&gt; Canonical is happy to carry on<br>&gt; perpetrating the myth.</p><p>In other words:  Perpetrating a myth is an act of bad faith on the part of Canonical. They have ulterior motives.</p><p>On Sat, 2015-05-02 at 09:58 +0100, Jonathan Riddell wrote:<br>&gt; The Ubuntu Community<br>&gt; Council should be making a strong statement that the claim is untrue<br>&gt; but they seem to be unwilling</p><p>In other words:  By not making such a statement the UCC are acting in bad faith. They are being subservient to Canonical.</p><p>On Tue, 05 May 2015 01:51:09 -0700 Jonathan Riddell &lt;jr at=\"\" <a href=\"http://jriddell.org\" rel=\"nofollow noopener\" title=\"jriddell.org\">jriddell.org</a>=\"\"&gt; wrote<br>&gt; Lawyers will only write<br>&gt; things in an unclear way when they want to</p><p>In other words:  Don't trust lawyers, they are not acting in good faith. The Canonical Legal Team say it's about trademark, but don't believe them. They want to restrict software freedom.</p>","replies":[{"id":"dsq-2051544954","author":"TheBlackCat13","deleted":false,"createdAt":"2015-05-29T14:26:10Z","message":"<p>Do you have links to these quotes?  Those are clearly fragments of quotes, I would like to see the context.</p>","replies":[{"id":"dsq-2051574440","author":"apater","deleted":false,"createdAt":"2015-05-29T14:44:58Z","message":"<p>From the public Ubuntu Community Team mailing list: <a href=\"https://lists.ubuntu.com/archives/ubuntu-community-team/2015-May/\" rel=\"nofollow noopener\" title=\"https://lists.ubuntu.com/archives/ubuntu-community-team/2015-May/\">https://lists.ubuntu.com/ar...</a></p>","replies":[{"id":"dsq-2051629221","author":"","deleted":true,"createdAt":"2015-05-29T15:19:08Z","message":"","replies":[]}]}]},{"id":"dsq-2051630972","author":"TheBlackCat13","deleted":false,"createdAt":"2015-05-29T15:20:14Z","message":"<p>\"In other words:  Perpetrating a myth is an act of bad faith on the part of Canonical. They have ulterior motives.\"</p><p>I don't see anything there about ulterior motives.</p><p>\"In other words:  By not making such a statement the UCC are acting in bad faith. They are being subservient to Canonical.\"</p><p>I see nothing to support this interpretation in the quote.  He is just saying he doesn't see what other options he, and other community members that share his concerns, can do.  It is certainly less of an allegation of bad faith than others made at him.  For example:</p><p>\"You appear to be conflating 3 issues here, one whether the CC is <br>concerned, the other being whether we are able to do anything, the last <br>being that we are not willing to be/anyone's/punchbag\"</p><p>\"In other words:  Don't trust lawyers, they are not acting in good faith.\"</p><p>Again, I see nothing to do support this.  What I see is the assumption that lawyers are doing their job properly.</p><p>\"The Canonical Legal Team say it's about trademark, but don't believe <br>them. They want to restrict software freedom.\"</p><p>I didn't see anything in the thread to support this.  This seems to be the CC interpretation, but the only thing they say about the what the Canonical Legal Team said is that they think it is within their rights.</p>","replies":[]}]}]},{"id":"dsq-2050640192","author":"HuwH","deleted":false,"createdAt":"2015-05-28T22:53:53Z","message":"<p>I think you misrepresented the canonical legal position. It actually reads closer to:<br>\"You can't redistribute our binaries, except as unmodified (complete?) Ubuntu or if we have let you because of a free software licence, or if you negotiate a licence to.\"</p><p>So, Jonathan is protesting that it should be possible for Canonical Council to seek clarification the extent of the claim against eg GPL software packages. Until that happens, anyone distributing an Ubuntu deb to a debian user has to ask themselves \"is that ubuntu8 string in the package owned by canonical?\".</p><p></p>","replies":[{"id":"dsq-2050643610","author":"HuwH","deleted":false,"createdAt":"2015-05-28T22:56:39Z","message":"<p>Ugh. That was a reply to apater.</p><p>Also \"unless we _have to_ let you\".</p>","replies":[]},{"id":"dsq-2050667309","author":"apater","deleted":false,"createdAt":"2015-05-28T23:15:50Z","message":"<p>And the CC encouraged Jonathan to ask those questions. It's not about the question, it's about assuming that the CC and Canonical were acting in bad faith.</p>","replies":[{"id":"dsq-2050713157","author":"HuwH","deleted":false,"createdAt":"2015-05-28T23:53:41Z","message":"<p>No, it is about the CC and KC being in untenable positions. The CC should never have put themselves between Canonical lawyers/commercial posisioning and the community.</p><p>The KC seems to have been told the appropriate Avenue for concerns was the CC, and been understandably frustrated by the answer \"we are trying really hard to influence behind the scenes, but realy we cannot publically move outside Canonical's commercial/legal position.\"</p><p>The argument should have been Canonical V KC, with the CC at arms length and able to say publically \"we agree GPL packages should not be required to be recompiled - as per [links from KC] , however this is not clear in the commercial/legal position of canonical. This is causing issues within the community and call on Canonical to clarify their position on binary distribution as soon as possible.</p>","replies":[{"id":"dsq-2050726225","author":"apater","deleted":false,"createdAt":"2015-05-29T00:05:31Z","message":"<p>But the CC did not agree with the KC position on the distribution of binaries. Ubuntu itself had to sign the same licensee agreement as Mint.</p>","replies":[{"id":"dsq-2050905984","author":"HuwH","deleted":false,"createdAt":"2015-05-29T02:59:17Z","message":"<p>No, the CC should have been in a position to be diplomatic and to make public statements that clearly identify the issue (perceived or actual conflict between community principles and canonical license wording),  the parties (community V canonical legal?) and suggested resolution paths (clarify, live with it, opt-out or overlooked options).</p><p>Instead, the independent umpire has picked up the ball, started running and got upset that people keep tackling them (since noone is sure who they are playing for, but clearly sees them playing the game).</p>","replies":[{"id":"dsq-2050913408","author":"apater","deleted":false,"createdAt":"2015-05-29T03:07:49Z","message":"<p>Live with it.  The CC made it clear over a year ago that this was a trademark question. Everyone has a right to distribute free software. To distribute the Ubuntu trademark, an agreement needs to be signed.</p><p><a href=\"http://fridge.ubuntu.com/2014/02/13/community-council-statement-on-canonical-package-licensing/\" rel=\"nofollow noopener\" title=\"http://fridge.ubuntu.com/2014/02/13/community-council-statement-on-canonical-package-licensing/\">http://fridge.ubuntu.com/20...</a></p>","replies":[{"id":"dsq-2051261218","author":"HuwH","deleted":false,"createdAt":"2015-05-29T10:33:10Z","message":"<p>With the implication you should consult a lawyer to find out where the overlap between rights preserved by copyright/licence terms end and trademark protections start before distributing anything less than the full distro.</p><p>There are good reasons to keep the Trademark argument alive, including 'enforce it or lose it' laws. Also, it prevents anyone marketing an \"Ubuntu GPL edition\" which includes only fully GPL packages - which obviously would not provide an Ubuntu experience.</p><p>There is also a very good argument for clarifying 'permitted use cases' for the community members. \"Hey mum, this USB contains the first package I got accepted into the Ubuntu distro\" comes to mind as pretty safe.</p>","replies":[]}]}]}]},{"id":"dsq-2050727340","author":"apater","deleted":false,"createdAt":"2015-05-29T00:06:30Z","message":"<p>Do you mean that the CC should have accepted the KC position?</p>","replies":[]},{"id":"dsq-2050738790","author":"apater","deleted":false,"createdAt":"2015-05-29T00:13:30Z","message":"<p>Can you clarify the typo in your post?  \"Canonical lawyers/commercial posisioning\"</p><p>Spell check suggests either \"positioning\" or \"poisoning\".</p>","replies":[]}]}]},{"id":"dsq-2050936984","author":"Michael Hall","deleted":false,"createdAt":"2015-05-29T03:34:52Z","message":"<p>\"So, Jonathan is protesting that it should be possible for Canonical Council to seek clarification the extent of the claim against eg GPL software packages.\"</p><p>That is incorrect, Jonathan wanted the CC to make a statement declaring Canonical's IP policy to be in violation of free software licenses and therefore invalid and could be ignored. For what should be obvious reasons, the CC did not want to make such a statement.</p>","replies":[{"id":"dsq-2051033485","author":"HuwH","deleted":false,"createdAt":"2015-05-29T05:30:45Z","message":"<p>And what he got was the equivalent of \"The full bench of highest court in the land today announced that the class action underway would be finding a new Representative, since the old one consistently protested that there had been no hearings. The court has had many involved discussions with the other party to the case, which were not being sufficiently appreciated.\"</p><p>The issue the CC is refusing to acknowledge is that the uncertainty and lack of public progress may be hurting the community in ways not considered (or at least not described) when the statement on Mint was made. A new statement other than \"we _decided_ that participants would not be unacceptably impacted by the uncertainty in 2014 and the uncertainty is outside our control\" seems warranted.</p><p>Admittedly, the CC has probably done a lot to help the KC cause this week. I'm certainly questioning whether (K)Ubuntu is the right distro to recommend to people, having previously assumed the issue to have been resolved.</p><p></p>","replies":[]},{"id":"dsq-2052676345","author":"HuwH","deleted":false,"createdAt":"2015-05-30T02:34:36Z","message":"<p>Apologies Michael, I seem to have misrepresented at least your position on UCC involvement. You were (in early May 2015 at least) advocating the KC take it up with Canonical directly.</p><p>You have clearly got involved and tried to resolve the issues. In honesty the UCC statements probably say too much in the name of the UCC. By speaking as UCC rather than providing a forum to escalate others discussions, you provided little to improve transparency or clarity on permissable personal use (which I suspect was what irked Jonathan most).</p><p>With the benefit of hindsight, \"sorry, we cannot make that statement - but yes a year without update is not ideal. How about we work with you to craft a joint (CC backed) community request to Canonical legal for an update and clarification on your key concerns?\" might have been a good middle road to remain arms length.</p><p>To be frank, the crux of the current issue is that the UCC (body, not individuals) hasn't got the required processes established to transparently deal with such problems without making them UCC problems. This has led to much confusion and frustration for both UCC members and those trying to escalate issues to move them along.</p><p>The key issue now is however finding a way to deescalate the current mess without any individuals involved losing face. As below (above and in forums), I think evidence to support the position on Jonathan is weak. Even in the most cited IRC, he himself dropped the issue and suggested moving on when it was clear no progress was occurring.</p>","replies":[]}]}]},{"id":"dsq-2050662069","author":"Markus S.","deleted":false,"createdAt":"2015-05-28T23:11:26Z","message":"<p>I hope the Kubuntu guys will finally take this opportunity to part ways with Ubuntu.</p>","replies":[]},{"id":"dsq-2051528118","author":"apater","deleted":false,"createdAt":"2015-05-29T14:15:25Z","message":"<p>The UCC has just published a statement:  <a href=\"https://lists.ubuntu.com/archives/ubuntu-community-team/2015-May/000568.html\" rel=\"nofollow noopener\" title=\"https://lists.ubuntu.com/archives/ubuntu-community-team/2015-May/000568.html\">https://lists.ubuntu.com/ar...</a></p>","replies":[{"id":"dsq-2051547980","author":"Aurélien Gâteau","deleted":false,"createdAt":"2015-05-29T14:28:09Z","message":"<p>We are getting there. Still no links though, so it is not possible to evaluate the context.</p>","replies":[{"id":"dsq-2051586299","author":"apater","deleted":false,"createdAt":"2015-05-29T14:52:24Z","message":"<p>Everyone of us is capable of reading through the conversations on the public mailing lists and IRC logs. I personally read through a lot of long threads before commenting on the situation. It's not difficult to find details and context.</p>","replies":[{"id":"dsq-2051674561","author":"TheBlackCat13","deleted":false,"createdAt":"2015-05-29T15:46:28Z","message":"<p>They are the one making the allegations, it is their responsibility to provide evidence backing up those allegations.</p>","replies":[]}]}]},{"id":"dsq-2051561504","author":"TheBlackCat13","deleted":false,"createdAt":"2015-05-29T14:36:42Z","message":"<p>It looks like the CC is more guilty of violating the standards they set forth than Riddell was:</p><p>\"Value decisiveness, clarity and consensus\" - This whole conflict was because Riddell wanted these things and the CC wouldn't provide them.</p><p>\"Disagreements, social and technical, are normal, but we do not allow them to persist and fester\" - Again, this is exactly what Riddell was trying to fix. And by waiting to actually address their problem with Riddell until it reach a point where they couldn't work with him anymore, they explicitly violated this.</p><p>\"We value discussion, data and decisiveness\" - There was no discussion prior to taking action and still no data on why the action was taken.</p><p>\"If someone has been harmed or offended, we listen carefully and respectfully, and work to right the wrong.\"  - There is no indication the CC tried to explain their problems.</p><p>And I disagree with their description of the IRC chat.  For one thing, they were rudely dismissive of his concerns, asking for evidence of harm caused by the policy and then brushing it aside when it was given.  And it wasn't Riddell who kept the conversation going, when it became clear it was going nowhere he tried to end it four times before the CC members would finally drop it.</p><p>As for repairing relationships, again there is no indication they tried to do this before taking action.</p>","replies":[{"id":"dsq-2052519713","author":"HuwH","deleted":false,"createdAt":"2015-05-30T00:03:28Z","message":"<p>When I read the quotes in the statement (in or out of context) I see _Persistence_ not _Agression_.</p><p>If I overlay the power relationships between Canonical and the UCC, it is plausible that his persistence posed a perceived threat to this relationship (which I assume the UCC consider fundamental to their ability to influence Canonical).</p><p>Unfortunately for the UCC, a persistent person asking a question that threatens your power relationships is not _aggression_ in a meritocracy, it is _inconvenient_. Unfortunately for Jonathan, the Ubuntu is not functioning in a pure meritocracy (the benevolent dictator in the room).</p><p>We have a saying here 'better they are in the tent pissing out' - which is used to describe/justify bringing an influential adversary into your confidence, so you can control them by making them reliant on their relationship with you.</p><p>Canonical seems to have captured the UCC in this manner (at least on this issue), where I suspect Johnathan still expected them to be impartial and represent the community concern more publically. I maintain, the UCC is at fault here - either they are above the politics (and autonomous/independent), or they are Canonical representatives (and cannot function as an independent arbiter in conflicts with Canonical).</p>","replies":[]}]}]},{"id":"dsq-2053755811","author":"Helwani Nose","deleted":false,"createdAt":"2015-05-30T21:00:32Z","message":"<p>As a KDE distro whore who has been with Kubuntu since 10.10 full time while using it sporadically since 5, I have to say that the few interactions with Riddell have always been excellent and often I remember feeling uncomfortable at how much time he was helping me (i support computers for a small retirement home with two dozens KDE laden computers on my free time) and the selflessness of his personality. Maybe he is a raging egomaniac in real life but he's always come across as one of those people like Aaron, Lydia, IvanC, Nuno, you Aurelien (and soooo many others) who really exemplify the best qualities of the KDE teams as well as Kubuntu community.<br>If by any chance this most recent Ubuntu-being-Ubuntu moment were to result in Jonathan or others leaving Kubuntu, I'd have no qualms moving on. The Buntu love affair was wonderful when 5 came to life but it was soon clear that those pretty words were soon forgotten which is why an engineer a work compares it to being divorced but still living in the same house as your ex. My emotional and technical investment is in the K part of Kubuntu, not the other 6 letters.<br>I loved the PCLinuxOS community as I did the Mandriva one before that and they are often the deciding factor in switching distros (because lets face it, once you go past decorations like icons, wallpapers and themes, most of them are 98% the same) and if the people who made Kubuntu were forced out, I'd follow them because ive been impressed by their work.</p><p>Someone reading the first paragraph who wasnt tech aware would probably be wondering what dystopian, totalitarian film was this text lifted from. The last part dealing about the position that doesnt exist really gives this a whole communist and McCarthyist show trials feel to it.</p><p>And they dont even have Bacon anymore pretending to play good cop trying to clean up another mess</p>","replies":[]},{"id":"dsq-2057751089","author":"Georg Grabler","deleted":false,"createdAt":"2015-06-02T10:19:28Z","message":"<p>\"* has knowingly misrepresented the statements and positions of others\"</p><p>That will be very hard to get proof for, because weather Jonathan knowingly and intentionally misinterpreting ... not really. Only he can know the truth, everything else is speculation.</p><p>I've seen Jonathan having very strong opinions about certain things, but never seen him being over-agressive, insulting or similar. Maybe \"hard to convince\" on certain things, but a lot of people who have strong opinions are.</p><p>I guess in the end they'll figure it out. He's still doing a great job for KUbuntu. Though, I don't use it anymore (switched to Tanglu a while back, always wanted a simply \"more modern\" but \"stable\" debian based desktop, and the guys are going the right direction in my opinion).</p>","replies":[]}]