[{"id":"dsq-457709489","author":"koko","deleted":false,"createdAt":"2007-10-14T03:20:36Z","message":"<p>Nice, realy nice idea :)</p>","replies":[]},{"id":"dsq-457709493","author":"Albert Astals Cid","deleted":false,"createdAt":"2007-10-14T03:33:00Z","message":"<p>Maybe you can use QPalette to get the colors you put on the CSS rules?</p>","replies":[]},{"id":"dsq-457709497","author":"Erunno","deleted":false,"createdAt":"2007-10-14T03:47:29Z","message":"<p>Great work, I'm looking forward to Gwenview in 4.0 The new interface looks really good by the way, clean and easily usable.</p>","replies":[]},{"id":"dsq-457709488","author":"JMiahMan","deleted":false,"createdAt":"2007-10-14T04:42:14Z","message":"<p>Very Nice. I defiantly think the css values should be in a datafile, good idea. It would be really neat if Dolphin adopted this automatically so any time I mouse over a image for that matter it would bring up these options. Maybe even an option to add it to the plasma desktop would be cool in a little frame, that's most likely too much. Good Job!</p>","replies":[]},{"id":"dsq-457709492","author":"anonymous","deleted":false,"createdAt":"2007-10-14T09:30:19Z","message":"<p>Hi, I saw a better way to correct orientation of camera imported images via XMP. <a href=\"http://www.gnome.org/start/2.20/notes/en/index.html#rnusers-eog\" rel=\"nofollow noopener\" title=\"http://www.gnome.org/start/2.20/notes/en/index.html#rnusers-eog\">http://www.gnome.org/start/...</a></p>","replies":[]},{"id":"dsq-457709484","author":"ben","deleted":false,"createdAt":"2007-10-14T13:09:42Z","message":"<p>Very cool, Aurelien! Would it be possible to assign shortcuts to rotating the currently-hovered image? Like CTRL-1 and CTRL-2. And it would be cool if I didn't have to save each image separately, but rather use a big button in the toolbar or be asked on exit?!</p><p>thanks!</p>","replies":[]},{"id":"dsq-457709486","author":"TeeZee","deleted":false,"createdAt":"2007-10-14T13:32:31Z","message":"<p>Hi, really cool. Even if I'm not sure if its really needed due to teh image metadate that contains the information to rotate the image. nevertheless it might be usefull for older cameras.</p><p>One Question: Will you improve the look of the thumbnails with something like a border around them? Besides that I think that gwenview looks extremly promising.</p>","replies":[]},{"id":"dsq-457709482","author":"Nick Shaforostoff","deleted":false,"createdAt":"2007-10-14T19:58:05Z","message":"<p>please implement anouther way of doing this: by mouse gestures: user clicks and holds down left mouse button somewhere in the picture (not exactly in the center) and moves mouse clock-wise or counter clockwise...</p>","replies":[]},{"id":"dsq-457709483","author":"Aurélien","deleted":false,"createdAt":"2007-10-15T00:55:41Z","message":"<p>@Albert Astals Cid: Yes I will probably try to use the widget palette.</p><p>@anonymous: Are you talking about rotating images based on the Exif orientation tag? If so, it's already implemented.</p><p>@ben: I am not sure about the shortcuts, will think about it. Concerning saving, that's what Gwenview does: you can save all the changes through the save bar or when quitting.</p><p>@TeeZee: I don't know about the newest camera, but while my camera (Minolta Z3) does set the orientation tag, it only does so if I rotate the image from within the camera.<br>Yes, I will try to improve the thumbnails presentation.</p><p>@Nick Shaforostoff: Hum... I am not sure it would be a real gain, since you just have to click a button which is already very close to your mouse cursor. Beside, it might make drag'n'drop confusing.</p>","replies":[]}]
