[{"id":"dsq-457710731","author":"Hugo Parente","deleted":false,"createdAt":"2009-11-06T06:30:37Z","message":"<p>Gwenview is the most polished and well done kde4 app IMO.</p>","replies":[{"id":"dsq-457710815","author":"Dmitry","deleted":false,"createdAt":"2010-11-17T16:12:32Z","message":"<p>How to turn importer off???  I use tons of SD cards, none of them has photos and prompt to download photos and extra click because of it is really annoying.</p><p>-Dmitry</p>","replies":[{"id":"dsq-457712173","author":"Aurélien","deleted":false,"createdAt":"2010-11-17T20:17:03Z","message":"<p>The only way to turn it off is to rm the file /usr/share/kde4/apps/solid/actions/gwenview_importer.desktop (replace /usr with the place KDE is installed on your machine).</p>","replies":[]}]}]},{"id":"dsq-457710734","author":"Aaron Seigo","deleted":false,"createdAt":"2009-11-06T06:34:07Z","message":"<p>I think we're going to get in the way of our users with a \"Download Photos with DigiKam\" and a \"Download Photos with Gwenview\" entry in the device notifier.</p><p>At the least we should probably tell them what the difference between the two apps are so they don't need to know the jargon. I also wonder if people will use both apps in parallel or if it would make sense to have a \"this is my default photo app\"?</p><p>I'm also unsure if showing such an option whenever any mass storage device is plugged in is useful. There are dozens of things one might want to do with plugging in a USB drive, listing them all seems odd. It's also very odd when I'm prompted to download Photos from a disk that .. well .. has none.</p><p>Perhaps just making it react to cameras? (Solid supports this, thankfully via Solid::DeviceInterface::Camera ..)</p>","replies":[{"id":"dsq-457710750","author":"Aurélien","deleted":false,"createdAt":"2009-11-06T15:35:07Z","message":"<p>Having a notion of a default photo app would definitely be useful.</p><p>About reacting only to cameras, I would like to have it show up for cameras and sd cards. Can Solid make the distinction between sd cards and an external hard drive or a generic usb stick? (Should ask Kevin)</p>","replies":[{"id":"dsq-457710765","author":"Aaron Seigo","deleted":false,"createdAt":"2009-11-06T22:04:53Z","message":"<p>Yes, it does know. In StorageDrive there is the DriveType enum which has these values: { HardDisk, CdromDrive, Floppy, Tape, CompactFlash, MemoryStick, SmartMedia, SdMmc, Xd }</p>","replies":[{"id":"dsq-457712155","author":"Aurélien","deleted":false,"createdAt":"2009-11-07T01:04:28Z","message":"<p>Thanks for the info, added this to my TODO.</p>","replies":[]}]}]},{"id":"dsq-457710794","author":"maninalift","deleted":false,"createdAt":"2009-11-09T15:32:41Z","message":"<p>On the one hand, you don't want to require the user to choose between applications every time they import photos, on the other hand users can easily end up in a low productivity rut if they don't realise they have set one default but could change that. The ideal situation would be to make the default option strong enough that the user can pick it without thinking, while making the other option(s) visible enough that the user is aware there are other options.</p><p>In terms of making the difference clear I think the key term might be \"photo album\", since DigiKam is a digital album manager:</p><p>\"Import to DigiKam photo album\" and \"import to another folder\"</p><p>Finally, from the users' perspective, why would they choose one importer over another and why does KDE need two importers? DigiKam is a more sophisticated tool, perhaps it should always be the default if it is installed.</p>","replies":[]}]},{"id":"dsq-457710735","author":"KenP","deleted":false,"createdAt":"2009-11-06T07:00:28Z","message":"<p>I would like to add that words like Photos and Videos should be used rather than Documents. After all, we are importing Photos, aren't we?</p><p>Otherwise, it seems simple enough for a newbie.</p>","replies":[{"id":"dsq-457710754","author":"Aurélien","deleted":false,"createdAt":"2009-11-06T15:36:26Z","message":"<p>I am not too satisfied about using \"Documents\" as well, but I thought it would be tedious to use \"Photos or Videos\" everywhere. Anyone has a better idea for a more appropriate word?</p>","replies":[]},{"id":"dsq-457710761","author":"Sergio Pistone","deleted":false,"createdAt":"2009-11-06T21:42:11Z","message":"<p>How about referring to both photos and video as \"media\"?</p>","replies":[]}]},{"id":"dsq-457710736","author":"Carlos","deleted":false,"createdAt":"2009-11-06T08:31:22Z","message":"<p>I think it's a pretty well designed user interface. It's very simple and easy to use but at the same time it's quite powerful and has a lot of options. It's a great work and I really hope to see it in KDE 4.4.</p><p>I'm really happy to see such a well thought interface design as part of Linux, and not only OS X.</p><p>Keep up the great work :-)</p>","replies":[]},{"id":"dsq-457710737","author":"Hermann","deleted":false,"createdAt":"2009-11-06T11:50:12Z","message":"<p>Thanks this is great! I will definitely use it.<br>Please do *not* only show this for cameras, because I read the storage card of my camera using the card reader in my computer.</p>","replies":[{"id":"dsq-457710762","author":"Aaron Seigo","deleted":false,"createdAt":"2009-11-06T22:00:43Z","message":"<p>The number of times people plug in USB drives (solid state or just external drives) that have generic data on dwarfs the number of times camera storage cards are plugged in. Optimizing for the small use case doesn't make sense, and it makes the interface look very stupid when it asks to import photos from your USB stick or in my case a 500MB drive that doesn't have photos at all on it.</p><p>In the case of an SD card directly slotted in, one can start the important from gwenview or digikam directly.</p><p>Someone could also work on Solid's actions being slightly more intelligent by being able to look at what's on a device or remembering specific volume labels (so when you manually import into gwenview once, it would record the label of that volume and prompt to do the same thing automatically next time you plug it in; aka \"trainging\").</p><p>That would be the \"right\" way of going about it. A mostly-of-the-time-wrong dumb interface isn't.</p>","replies":[{"id":"dsq-457712154","author":"Aurélien","deleted":false,"createdAt":"2009-11-07T01:01:59Z","message":"<p>I was thinking about associating apps with devices as well.</p><p>For example there could be a \"Always open this device with this application\" checkbox at the bottom of the device importer popup. User could then manage associations via the widget settings. What do you think of this, Aaron?</p>","replies":[]}]}]},{"id":"dsq-457710739","author":"Plaristote","deleted":false,"createdAt":"2009-11-06T12:17:29Z","message":"<p>Not bad at all, even if it's not as good as what OSX.<br>Isn't it possible to use the same widget than Amarok and Kopete use for that kind of stuff ?</p><p>I was also thinking, why not making a dialog that would give the possibility to choose some Nepomuk tags for all the imported pictures ?</p>","replies":[{"id":"dsq-457710755","author":"Aurélien","deleted":false,"createdAt":"2009-11-06T15:38:04Z","message":"<p>I had a look at the Amarok widget and I didn't like it that much. Where does Kopete use such a widget?</p><p>About Nepomuk, it was part of the initial plan, but I removed it to keep things simple. I may add it back, need to think about it.</p>","replies":[{"id":"dsq-457710760","author":"Plaristote","deleted":false,"createdAt":"2009-11-06T18:36:28Z","message":"<p>I'm pretty sure Kopete use the same kind of widget to choose the contact list layout.<br>Maybe it's not the same but it looks very smiliar... I may be mistaking but anyway, even if it's different, one of their choice could be the one needed by this import plugin.</p><p>In fact now that I'm thinking of it, they may be different... and the Kopete-way-of-doing-thing may be more appropriate (it's just the same way of doing thing, but with a widget that makes it more eye-candy and clear for the user).</p><p>As I'm currently using KDE-Windows I can't find that widget (Kopete crashes) but If I remember well they're something like a \"Contact List\" tab in the configuration of Kopete where we see that widget.</p>","replies":[]}]}]},{"id":"dsq-457710740","author":"Vide","deleted":false,"createdAt":"2009-11-06T12:39:22Z","message":"<p>Yes, definitely it should react only to cameras (this is what any other OS out there does right now), and having a default camera app (as Gnome does, for example) it's another great idea.<br>Anyway I think Aurelien has done a great job!</p>","replies":[]},{"id":"dsq-457710743","author":"shamaz","deleted":false,"createdAt":"2009-11-06T13:40:16Z","message":"<p>Good job! I like the renaming dialog :). Does it always use U.S format for dates ? (note that it's what I'd prefer even if I'm also French... )<br>About the \"multiple apps to do the same thing\" comment from Mr Seigo... well Digikam is an 'extragear, and I think there should be something in base kde to handle such a common task.<br>By the way maybe this application could be named 'Image importer' or something similar, even if _technically_ it depends on Gwenview. Maybe it would be less confusing for the users ?</p>","replies":[{"id":"dsq-457712157","author":"Aurélien","deleted":false,"createdAt":"2009-11-07T00:58:52Z","message":"<p>The date format cannot be changed right now. It is not the U.S format (which is month, day, year) it is the ISO format (year, month, day). The advantage of this format is that if you sort by filenames, you get image sorted by shooting date as well.</p><p>It depends on libgwenview (which is an internal library) but it could run without the gwenview binary. The only thing to change would be not hardcoding the fact that it starts Gwenview at the end. I can do this if there is enough demand for it.</p>","replies":[]}]},{"id":"dsq-457710747","author":"Darryl","deleted":false,"createdAt":"2009-11-06T13:47:33Z","message":"<p>Great work Aurelien! But maybe Aaron's right - maybe this could be a separate program from Gwenview?</p><p>And I think \"media\" would be a better term than \"documents\".</p><p>Anyway, I think your interface looks far better than the one on Windows - so great job!</p>","replies":[{"id":"dsq-457710757","author":"Aurélien","deleted":false,"createdAt":"2009-11-06T15:39:24Z","message":"<p>It is a separate program, you can start it yourself with gwenview_importer /path/to/images. For now starting Gwenview is hardcoded, but this could be modified to start any other application.</p><p>About \"media\" vs \"document\", that's not bad, will give it a try.</p>","replies":[]}]},{"id":"dsq-457710749","author":"FACORAT Fabrice","deleted":false,"createdAt":"2009-11-06T14:23:03Z","message":"<p>This is a great news.<br>My users need to import photo from several camera, but they don't need a Photo management application like Digikam : just a way to import the photo. This will be great.</p><p>+1 concerning Aaron Seigo remark concerning possible confusion for users</p>","replies":[]},{"id":"dsq-457710756","author":"lefty.crupps","deleted":false,"createdAt":"2009-11-06T18:26:21Z","message":"<p>Sounds nice, but how will it decide my ~/Photos/folder/subfolder/ structure?  Currently I manually copy all of my photos from the camera to my hard drive because I don't trust other apps to do it 'correctly'.  Unlike cd-rippers which allow you to define the structure:<br>~/Music/Artist 1989 Album/01 Track.mp3<br>Photo apps don't seem to have these options, and so I've been doing it myself...</p><p>A \"default photo app\" setting would be nice; since KDE4 i've only used GwenView even tho before I liked Digikam.  GwenView is just so nice and simple and useful</p>","replies":[{"id":"dsq-457710770","author":"Aurélien","deleted":false,"createdAt":"2009-11-07T00:48:12Z","message":"<p>For now it does not decide on the structure: it defaults to the xdg pictures folders (which is ~/Pictures if I am not mistaken). It remembers the destination folder so next time you import your pictures, chances are high it will already be using the correct folder, or you will just need to change the last part of it.</p>","replies":[]}]},{"id":"dsq-457710759","author":"Linus Berglund","deleted":false,"createdAt":"2009-11-06T19:20:41Z","message":"<p>Gwenview is one of the bes apps in kde. Polished, easy to use. This is a great idea.</p><p>About the import dialog asking whether to keep the files. This approach is a bit dangerous. It would be better to have a checkbox, since it is easier to accidently click \"yes\" than to accidently check a checkbox.</p>","replies":[{"id":"dsq-457710776","author":"Aurélien","deleted":false,"createdAt":"2009-11-07T00:49:58Z","message":"<p>I disagree. A checkbox which you have to check everytime is tedious, and a checkbox whose state is remembered is dangerous. I don't think the user will click the button by mistake, especially since it's labeled \"Delete\" and not \"Yes\".</p>","replies":[]}]},{"id":"dsq-457710764","author":"thorGT","deleted":false,"createdAt":"2009-11-06T22:37:28Z","message":"<p>Well, to be honest there is a renaming tool in Digikam, which is quite similar to what is described here. So you could maybe have a look at what they do?<br>OT: Why couldn't Gwenview and Digikam share *some* code in future? They seem to be duplicating each other, e.g. icon view with similar overlays, now Import and Rename tool..... I know that Digikam is more of a professional photo-management program, but manpower is limited, you see :)</p>","replies":[{"id":"dsq-457710769","author":"Aurélien","deleted":false,"createdAt":"2009-11-07T00:44:58Z","message":"<p>DigiKam and Gwenview already share code through kipi plugins. I am not sure sharing the importer makes sense because DigiKam needs to do more work on the imported pictures (indexing them in its database for example)</p>","replies":[{"id":"dsq-457710793","author":"Lure","deleted":false,"createdAt":"2009-11-07T02:45:57Z","message":"<p>I agree that importing could be shared more between both apps, even possibly just have one importer.</p><p>I think digikam will anyhow index/scan newly detected photos under the trees that are configured for photo collections. And having the default photo app (like e-mail, web-browser...) would be great, as importer could then auto-start the chosen application (gwenview, digikam...).</p><p>And BTW: great work on gwenview - I really like your balance between simplicity and powerfullness of the application. Most of the stuff you do, feels just enough for  \"typical user\" (like my father...).</p>","replies":[]}]}]},{"id":"dsq-457710775","author":"gumb","deleted":false,"createdAt":"2009-11-07T20:52:48Z","message":"<p>Great to see this work. I've been trying to teach my dad to transfer pictures off his camera but have to resign that it's one area where KDE doesn't shine yet with regards to simplicity. The import process in Digikam is way too complex for him to grasp and even I find some of its layout and options perplexing.</p><p>Your proposal looks ideal and I particularly like the option to change filenames to lower case, since I'm currently having to do that separately via KRename. However, my dad always transfers photos off a memory card plugged into the card reader slots on a USB multifunction device, so I sincerely hope there would be some kind of automatic detection and prompt for him when he plugs it in.</p><p>Congrats in general for your work on Gwenview - it was one of the real surprises with KDE4 and as others have mentioned, strikes the perfect balance between simplicity and functionality.</p>","replies":[]},{"id":"dsq-457710789","author":"Robin","deleted":false,"createdAt":"2009-11-08T23:20:41Z","message":"<p>I'd prefer to scan the camera recursively - my girlfriend's digicam for example created several subfolders. Manually importing each folder would be a PITA.</p><p>This could be solved by a checkbox \"[X] scan whole device\" which then shows only images and videos but not folders. Maybe this even can be preselected if a camera is detected (don't know if this is possible).</p>","replies":[]},{"id":"dsq-457710780","author":"Socceroos","deleted":false,"createdAt":"2009-11-10T06:43:12Z","message":"<p>Brilliant I love the idea. The users at my company would be greatly pleased by this functionality.</p><p>Only one thing I'll mention - can you import photos to networked drives? For example, if I have a shortcut to a samba share in the file dialog, will I be able to import these photos from the camera directly into the network share?</p>","replies":[{"id":"dsq-457710787","author":"Aurélien","deleted":false,"createdAt":"2009-11-11T01:08:38Z","message":"<p>There are a couple fixes I need to do in order for the importer to work with remote locations, but I hope it will be there in time for KDE 4.4.</p>","replies":[]}]},{"id":"dsq-457710781","author":"Jos Poortvliet","deleted":false,"createdAt":"2009-11-10T16:58:02Z","message":"<p>@socceroos: I suppose Aurelien used the KIO infrastructure in KDE, so yes, it should work to any location KDE apps can save files to (ssh, ftp, samba, webdav).</p>","replies":[]},{"id":"dsq-457710788","author":"irlandes","deleted":false,"createdAt":"2009-11-27T05:45:56Z","message":"<p>At first with Kubuntu 9.04, I resisted Gwenview, but then learned I could do a lot of stuff with it.  Crop was one neat thing.</p><p>My computer died, so I went to Kubuntu 9.10 on the new one, Gwenview, Version 2.3.2 Using KDE 4.3.2 (KDE 4.3.2).  I have no idea what CROP is supposed to do, but it sure doesn't crop.  It apparently forces me to select one of a standard list of ratios for cropping. It does not give any crop box, and if I click on the position boxes, it mostly opens up full screen.</p><p>I had an urgent need a few days ago to crop, and finally did it by dinking with CONVERT from the command line.  I am not skilled enough with my eyes to hit the crop without a lot of experimenting.</p><p>If Gwenview crop on 9.10 is working like it's supposed to work, they have killed it.</p><p>I did a REMOVE and an INSTALL and no change.</p><p>Add on the fact that digikam on Kubuntu 9.10 crashes most of the time and bug report seems to be beyond me, 9.10 is not pleasing me very much.  I tried to download and install the tarball for digikam beta6, and it had major compile problems. I may be forced to regress to 9.04.</p>","replies":[{"id":"dsq-457710799","author":"Aurélien","deleted":false,"createdAt":"2009-11-28T03:21:58Z","message":"<p>It is a nasty problem, which does not seem to happen on all computers. I need to fix it, but until it is fixed, you can crop nevertheless: the crop handles are still there, but they are invisible. Move the mouse to the corner of the image, until you notice that the cursor change to a diagonal double arrow. You can now drag the corner.</p>","replies":[]},{"id":"dsq-457712151","author":"Andi Clemens","deleted":false,"createdAt":"2009-11-29T01:16:57Z","message":"<p>That's because Ubuntu added a beta version of digiKam, the crash has been fixed since 3 weeks, but Ubuntu isn't updating the package. I close 20 reports daily about this crash, all coming from Ubuntu users.<br>I really hope they will update the package some day, I don't want to do this bug-closing for the next 6 months.<br>They should never added digiKam-beta to a stable branch, it would have been better to provide it in an experimental branch...<br>But digiKam is not the only application added as beta in Ubuntu 9.10... more developers suffer from this stupid decision.</p>","replies":[{"id":"dsq-457712159","author":"Aurélien","deleted":false,"createdAt":"2009-11-29T02:42:15Z","message":"<p>Have you asked the Kubuntu devs to do an SRU (Stable Release Update) for the fix? This should save you some time closing bugs.</p>","replies":[{"id":"dsq-457712626","author":"Andi Clemens","deleted":false,"createdAt":"2009-11-29T03:54:39Z","message":"<p>No, I will do so now. But I think this package is a little bit ironic, at least for the Karmic release:<br><a href=\"https://wiki.ubuntu.com/StableReleaseUpdates#Why\" rel=\"nofollow noopener\" title=\"https://wiki.ubuntu.com/StableReleaseUpdates#Why\">https://wiki.ubuntu.com/Sta...</a></p><p>If they expect to have a very stable system and updates will need to be discussed so that the \"stable experience\" will not be destroyed for the user, why the hell are they adding so many beta-Software?</p><p>It is ridiculous I think... well anyway I will try to get the update through.</p>","replies":[{"id":"dsq-457712745","author":"Andi Clemens","deleted":false,"createdAt":"2009-11-29T03:55:11Z","message":"<p>I meant \"page\", not \"package\".... :-)</p>","replies":[]},{"id":"dsq-457712743","author":"Aurélien","deleted":false,"createdAt":"2009-11-29T16:11:45Z","message":"<p>I don't know about the reason behind the choice of packaging this version of digiKam, rest assured the Kubuntu devs care about delivering stable software.  No one is perfect though, hence the SRU process.</p><p>Do ping me on irc (agateau on freenode) if you need help with this.</p>","replies":[{"id":"dsq-457712882","author":"irlandes","deleted":false,"createdAt":"2009-11-30T02:42:04Z","message":"<p>Thanks for much for your attention. I am overwhelmed by the fact key people can actually be contacted. Reminds me of the time Kano personally answered a comment that I was unable to use that version of Kanotix which did not have the video driver for my old monitor, and he added it to the next release.</p>","replies":[]}]}]}]}]}]},{"id":"dsq-457710798","author":"irlandes","deleted":false,"createdAt":"2009-11-28T07:37:40Z","message":"<p>Okay, thanks for explanation. Someone commented something like that, but I did not understand exactly what was meant by it.  I will try it next photo I want to crop. My eyeball is not good enough to crop with CONVERT, except in desperation.</p><p>I am in rural Mexico, the Third World part. Here,  a perfect gift is a photo, they are not offended and do not consider it to be charity, which would be truly offensive.</p><p>I communicate by forum with people working in the States who have not been home as long as 18  years, and have had no pictures in that time. I transfer them both ways, and people are totally happy to get them.  A grandma did not see her grandchildren, one who had become a parent.</p><p>Tomorrow I drive an hour to take wedding pictures, and here it is assumed I will do it free, which is scary for a non-professional with a cheap Canon A470.  But, that is how rare photos are here. So, I do need some basic, easy editing, and the older Gwenview definitely had most of what I needed, the rest can be done with CONVERT.</p><p>Thanks.</p>","replies":[]},{"id":"dsq-457710801","author":"irlandes","deleted":false,"createdAt":"2009-11-30T02:44:18Z","message":"<p>I went to the wedding, and ended up with around 180 pictures. Many of them were  table pictures of the feast later, for the bride's memories, and they only need printed 4X6 for her.</p><p>The couple at the altar will need a lot of work, but my daughter back in the States said to pick out a few of the better ones, and she will attempt to make them better for me.  So, maybe I won't need to do the editing  myself for once, which will sure up the quality, hee, hee.</p>","replies":[]},{"id":"dsq-457710802","author":"Hickson Hacie","deleted":false,"createdAt":"2010-01-05T00:34:21Z","message":"<p>When I switched to Linux Gwenview became my irfanview, doing the cropping, resizing and redeyes which covers about 90% of our usage.<br>The new version is even better and it kept its ease of use and I can make it as loaded with options as I want or as basic as needed for my folks who are now KDE4.3 users.<br>I have to things which I was wondering were possible. <br>1. saving in different quality/size<br>2. Save as.</p><p>2. If I have a picture that I like but from which I want to crop out a section (let's say just a closeup ofthe faces of you and your kids), when it comes to save I am given Save or Save All but not Save As.<br>If I click Save, i keep the cropped work but write over the original (which I also want).<br>I can make a copy of the picture before hand and modify one ofthe two but it seems like a Save As option would let you save the new quickly without losing the original.</p><p>Another suggestion is about photo dimensions. People very often will crop a picture and go get it printed but they are not in perfect 4x6 size. Maybe a way to be able to see how much more you have to crop at sides or bottom/top so that you dont get a surprise once youre at the print machine.</p><p>I know suggestions are a dime a dozen and that helping hands are few and far between but i can do the first and am cluless about the second.</p><p>I love Digikam and getting used to GIMP but Gwenview is the program we use the most because it can be as simple as you want (for my retired folks who just want to view slideshows, oh yeah, more options....) or as complex as we need it to alter images.</p><p>It makes the Gnu-Linux desktop easy and fun to use.</p><p>Keep up the great work.</p>","replies":[{"id":"dsq-457712161","author":"Aurélien","deleted":false,"createdAt":"2010-01-05T04:06:58Z","message":"<p>This is not really the place to request features but I'll answer nevertheless :)</p><p>&gt; Saving in different quality<br>This is in my TODO list</p><p>&gt; Save as<br>\"Save as\" has always been there, in the \"File\" menu, but its behavior was a bit weird in KDE  Crop ratio<br>It is there as well, you need to check the \"Advanced settings\" checkbox in the crop tool. This allows you to define a crop ratio (and finetune size and position)</p>","replies":[]}]},{"id":"dsq-457710803","author":"irlandes","deleted":false,"createdAt":"2010-01-08T20:45:40Z","message":"<p>I fired up my old e-machine, and Kubuntu offered to update to 9.10, and I let it. I had 57 borrowed old pictures to scan, I mean as old as 1897, long before the revolution, of my wife's maternal great-grandfather when he was still a rich patron. (To make it clear, I am in Mexico.)</p><p>As you indicated, CROP worked on Gwenview, on this computer.</p><p>The problem is, I have started to learn GIMP, so it is much  easier now with experience to crop in GIMP. Still, there will be times when Gwenview is going to be much faster if all I need is to crop.</p><p>Xsane works pretty good, I think. But, it seems, I am not 100% sure,  like my old HP scanner in Win 98 automatically trimmed down the photo, Xsane supplies a file with the entire scanner bed and every photo has to be cropped manually.</p><p>Still, progress.</p>","replies":[]},{"id":"dsq-457710806","author":"Dan","deleted":false,"createdAt":"2010-01-24T21:51:12Z","message":"<p>I recently upgraded KDE... and I lost my favorite photo app, Gwenview 1.x.  Now I have 2.x... and I'm wondering where the best feature went?  Where is my larger picture preview for the currently selected picture while in \"Browse\" mode?</p><p>To be clear - the lower left area: <a href=\"http://gwenview.sourceforge.net/data/screenshots//1.4/full/filter.jpg\" rel=\"nofollow noopener\" title=\"http://gwenview.sourceforge.net/data/screenshots//1.4/full/filter.jpg\">http://gwenview.sourceforge...</a></p><p>Toggling between Browse and View is annoying.  It   used to be unnecessary.  In fact, I pretty much never used view.  Either browse, or Full Screen.</p><p>Now the closest I can get is \"View\" with the thumbnail bar.  But the thumbnail bar sucks.  It doesn't let you do anything.  You have to manually set the number of columns in a preference, rather than having it change automatically when you resize the bar.  There is no zoom slider on it.</p><p>What I want is the browse file viewer, open at the same time as a view picture area.  I like to be able to open folders containing huge numbers of pictures, have the thumbnails be very small, and just click on pictures to see them bigger - aka - when I'm looking for a particular picture.</p><p>Also, how about an option to get rid of the tabs for Folders / Information / Operations?  I want to see all 3 of them at the same time - vertically spaced.  Information and Operations both waste half of my screen with empty space.</p>","replies":[{"id":"dsq-457712162","author":"Aurélien","deleted":false,"createdAt":"2010-01-25T14:48:44Z","message":"<p>You are completely offtopic here, this have anything to do with Gwenview Importer. Here are a few answers anyway:</p><p>- You can resize the thumbnails from the thumbnail bar by dragging the splitter between the bar and the image. This might help you to get a setup a bit more similar to what was in Gwenview 1.x.</p><p>- About space in the sidebar: I had a plan to allow some configuration here but couldn't find the time to implement it. It is setup this way for now so that it works well on smaller resolution devices like netbooks.</p>","replies":[{"id":"dsq-457712167","author":"Dan","deleted":false,"createdAt":"2010-01-29T06:24:52Z","message":"<p>Hi,</p><p>I posted here, cause it appeared that you were actively monitoring it :)</p><p>I thought about filing a bug... but when the tracker shows over 300 open bugs... it seemed likely to be ignored.</p><p>Is returning a size adjustable preview area to the browse mode on your TODO list?  Or have the KDE API changes just made it too hard to implement now?  How about just a preview that can be torn off from the program?  I don't have multiple monitors.. but I have a big enough monitor that that could work.</p><p>I just really don't understand the point of the view mode.  If the browse mode had two additional features, it could completely replace the view mode.</p><p>1) In the browse mode, put an (optional) large picture view window in-between the 3 tabs of information on the left, and the browse area on the right (Like the view mode looks today if you put the tabs on the left, pic in the middle, and the thumbnail bar on the right) - basically, just replace that feature limited thumbnail view with the proper \"browse\" file viewer.</p><p>2) Make the text that is shown below the pictures in the browse area configurable - like it is in the tab information bar (including, showing no information - which would implement exactly what the thumbnail bar does, only better, because it would dynamically set the number of rows depending on the window separator sliders, and the thumbnail sizes would be zoomable with the zoom slider.</p><p>Since I'm just spouting on your blog, and not offering C++ coding skills however... I'll switch over to an easier question - Should it be possible to get gwenview 1.x to run on KDE 4.x?  Or is that just physically impossible, since KDE burned the bridge to most of their previous apps with the change to 4.x?</p><p>I took a couple of stabs at building it... but it wasn't looking promising, and I quit.</p><p>Thanks for all your work on the program.  I don't mean to sound unappreciative.  It's just frustrating when the main reason you use a program goes away with an \"upgrade\" and there appears to be no path back to the one that actually has the features I want.</p>","replies":[]}]}]},{"id":"dsq-457710808","author":"Dan","deleted":false,"createdAt":"2010-01-29T06:34:04Z","message":"<p>Oops... now I see my feature request 2 is already implemented... its \"hiding\" in the view -&gt; thumbnail details menu - would be nice if this was in a right click context menu within the thumbnail viewer,  or down with the zoom slider.</p>","replies":[]},{"id":"dsq-457710812","author":"thePanz","deleted":false,"createdAt":"2010-05-09T16:06:49Z","message":"<p>Hi, I'm using Gwenview from KDE 4.4.3 (in Kubuntu Lucid) and I found something strange: if some errors occurs during copy/mode/rename actions of documents no message error is displayed.</p><p>I set up the rename pattern as \"{date}/{name.lower}.{ext.lower}\", yes, I prefer to store all the photos grouped by date. If I import my photos with this setting no error message is displayed and no file is copied. I don't know if this post is the best place to report this issue, please let me know where I should post it! :)</p><p>Regards!</p>","replies":[{"id":"dsq-457712168","author":"Aurélien","deleted":false,"createdAt":"2010-05-10T14:35:12Z","message":"<p>You can file a report on <a href=\"http://bugs.kde.org\" rel=\"nofollow noopener\" title=\"http://bugs.kde.org\">http://bugs.kde.org</a> for this. It would be interesting to run gwenview_importer from a terminal to check if it outputs interesting messages.</p>","replies":[{"id":"dsq-457712170","author":"thePanz","deleted":false,"createdAt":"2010-05-10T18:36:01Z","message":"<p>I'll try to run gwenview_import from the console, can you confirm that a renaming pattern with folder creation is supported?</p><p>Another feature request should be (for digital camera) to handle both .JPG and RAW image format together (or at least give an option to configure the handling process): I sometimes shoot with both .jpg and .orf (olympus raw format) and I'd like to move both of them using Gwenview_import tool</p><p>Regards</p>","replies":[{"id":"dsq-457712629","author":"Aurélien","deleted":false,"createdAt":"2010-05-11T01:09:53Z","message":"<p>Oups... I can confirm that it does not work :(</p><p>Please file a bug on <a href=\"http://bugs.kde.org\" rel=\"nofollow noopener\" title=\"http://bugs.kde.org\">http://bugs.kde.org</a> to track this. Same thing for the raw import (even if Gwenview has no support for raw right now, it makes sense to at least import both files)</p>","replies":[]}]}]}]},{"id":"dsq-457710813","author":"Kevin","deleted":false,"createdAt":"2010-09-07T15:47:05Z","message":"<p>Wow, lots of comments (tl;dr) -- I really hope this will be part of gwenview because digikam is just too huge and slow a beast for what I use it for (importing photos from the camera into folders based on date, and not importing photos that have already been imported).</p>","replies":[{"id":"dsq-457712171","author":"Aurélien","deleted":false,"createdAt":"2010-09-07T15:58:43Z","message":"<p>It's a separate binary, which starts Gwenview at the end. It is in KDE SC since 4.4.</p>","replies":[{"id":"dsq-457712172","author":"Kevin Brubeck Unhammer","deleted":false,"createdAt":"2010-09-07T16:09:24Z","message":"<p>Oh, now I see I can start \"gwenview_importer /somepath/\" from the command-line. Is there a way to get it to pop up when I turn on the camera? (Also, I have no idea where the camera gets mounted, I can't see any difference between the output of \"mount\" with or without the camera on)</p>","replies":[]},{"id":"dsq-457712630","author":"Kevin","deleted":false,"createdAt":"2010-09-10T16:39:11Z","message":"<p>What command would I put in the device actions list then? I tried \"gwenview_importer %f\" but that does nothing, while \"gwenview_importer %i\" gives me an error saying the path does not exist...</p>","replies":[{"id":"dsq-457712633","author":"Aurélien","deleted":false,"createdAt":"2010-09-14T01:50:38Z","message":"<p>If your camera has a mass-storage mode, uses this, it's the most convenient system in my opinion. If it must be accessed in PTP (run: \"gwenview_importer camera:/\", if you see the content of your camera then it is in PTP mode) then you are lucky: Guillaume Martres just added support for this to Gwenview. You need to copy this file <a href=\"http://websvn.kde.org/*checkout*/trunk/KDE/kdegraphics/gwenview/importer/gwenview_importer_camera.desktop?revision=1173937\" rel=\"nofollow noopener\" title=\"http://websvn.kde.org/*checkout*/trunk/KDE/kdegraphics/gwenview/importer/gwenview_importer_camera.desktop?revision=1173937\">http://websvn.kde.org/*chec...</a> to /usr/share/kde4/apps/solid/actions . Solid should the prompts you to start Gwenview Importer whenever you plug your camera.</p>","replies":[{"id":"dsq-457712757","author":"Kevin","deleted":false,"createdAt":"2010-09-14T15:36:15Z","message":"<p>Ah, that worked, thanks!</p>","replies":[]}]}]}]}]},{"id":"dsq-457710817","author":"gumb","deleted":false,"createdAt":"2011-01-03T21:28:13Z","message":"<p>Bit of a long time since you posted this but it still seems the most relevant place to comment...</p><p>Regarding the possible restricting of the import dialog to camera and card devices, I hope another use case will not be overlooked - that of photo CDs. I have just got my parents' machine set up with KDE SC4.5 and the Gwenview importer is significantly more easy for them to understand than the Digikam one or doing things manually in Dolphin, yet most of their images to import are now coming off of discs.</p><p>In relation to this, I know you say this isn't the place for feature requests but from looking at <a href=\"http://bugs.kde.org\" rel=\"nofollow noopener\" title=\"bugs.kde.org\">bugs.kde.org</a> I see a flurry of vaguely similar posts and one from years ago still unresolved that seems to relate more to Digikam - that of changing permissions on import.</p><p>IMO it would be a really useful feature to include this in the Advanced renaming dialog, since in the above case with my parents, all the files they import off a CD have default r-xr-xr-x permissions, so they're unable to rotate their pictures without first either grasping how to make files writable from a Properties dialog in Dolphin, or using another tool like KRename which is too complex for them to understand. If this were incorporated into Gwenview's import I could set it once and they'd never need worry about it. Currently my only alternative is to create a script and run it via cron every x minutes. Not an ideal solution for what must be a very common issue.</p><p>I'll post this as a request unless you already have any thoughts on it?</p>","replies":[{"id":"dsq-457712176","author":"Aurélien","deleted":false,"createdAt":"2011-01-04T21:43:49Z","message":"<p>Good point regarding permissions, will think about it.</p>","replies":[]}]},{"id":"dsq-457710820","author":"Peter","deleted":false,"createdAt":"2011-08-13T02:18:30Z","message":"<p>It seems to ignore my .CR2 (Cannon Raw) files. Surely it should work with any file type?</p>","replies":[{"id":"dsq-457712178","author":"Aurélien","deleted":false,"createdAt":"2011-08-13T02:25:30Z","message":"<p>Gwenview does not support raw files. If you are into raw files you can use digiKam.</p>","replies":[{"id":"dsq-457712182","author":"Peter","deleted":false,"createdAt":"2011-08-17T15:42:05Z","message":"<p>Perhaps you could make it work with any file type?</p>","replies":[{"id":"dsq-457712184","author":"Aurélien","deleted":false,"createdAt":"2011-08-20T19:02:42Z","message":"<p>I am afraid raw file support is a can of worms waiting to be opened: adding good-enough support for raw means being able to adjust color balance in ways which I consider too advanced for Gwenview. I wouldn't mind having basic support to only show JPEG previews, but I am not personally interested in implementing it myself.</p>","replies":[]}]}]}]},{"id":"dsq-457710822","author":"Peter","deleted":false,"createdAt":"2011-08-17T15:54:55Z","message":"<p>I've noticed it gets the timestamp wrong sometimes!<br>It happens when I have rotated a photo in the camera before importing.<br>Seems you use the file timestanp instead of EXIF \"Date Time (Original)\".<br>Perhaps you could offer different options for deriving the timestamp under your settings menu?</p><p>I like your importer a lot. It would be great if it could be used as a file renamer via the service menu.</p><p>Many thanks for a great piece of code.</p>","replies":[{"id":"dsq-457712183","author":"Aurélien","deleted":false,"createdAt":"2011-08-20T19:04:34Z","message":"<p>Oh. That is quite possible, I haven't thought about that problem. I am a bit afraid about the performance impact of getting the timestamp from the EXIF tag instead of the file mtime though. I need to look into this.</p>","replies":[]}]},{"id":"dsq-457710824","author":"DesG","deleted":false,"createdAt":"2011-12-11T23:53:33Z","message":"<p>When trying to import some files from my camera I get the following error:</p><p>Could not create temporary upload folder:<br>Operation not permitted</p><p>Why is it creating a temporary folder, and where is it located?</p>","replies":[{"id":"dsq-457710825","author":"Aurélien","deleted":false,"createdAt":"2011-12-14T21:39:59Z","message":"<p>If you import to, say, \"~/Pictures\", Gwenview Importer will create \"~/Pictures/.gwenview_importer-[random-stuff-here]\" and import your pictures here. It will then rename them appropriately before moving them to \"~/Pictures\".</p><p>If it can't create the temporary folder then your import dir is probably read-only.</p>","replies":[]}]},{"id":"dsq-457710823","author":"DesG","deleted":false,"createdAt":"2011-12-15T02:15:42Z","message":"<p>Ah ok, seems a bit of a pointless step if the files are not being renamed ;)</p><p>The import directory is not read only, I am able to manually create .gwenview_importer-1234567890 in the import directory. Are you using any strange characters in [random]? It is a CIFS mounted dir.</p><p>Any chance you could have an option to skip that step if the files are not being renamed?</p><p>And thanks for a cool util :)</p><p>Regards, Des.</p>","replies":[{"id":"dsq-457710828","author":"Aurélien","deleted":false,"createdAt":"2011-12-16T18:38:11Z","message":"<p>That is really weird. I would be interested in the output of running gwenview_importer through strace.</p><p>Let's continue this discussion on a more appropriate place. Can you file a bug on <a href=\"http://bugs.kde.org\" rel=\"nofollow noopener\" title=\"http://bugs.kde.org\">http://bugs.kde.org</a> or open a topic on <a href=\"http://forum.kde.org/gwenview\" rel=\"nofollow noopener\" title=\"http://forum.kde.org/gwenview\">http://forum.kde.org/gwenview</a> ?</p>","replies":[]}]},{"id":"dsq-457710830","author":"DesG","deleted":false,"createdAt":"2011-12-16T18:57:04Z","message":"<p>Topic opened on the forums, as it may still be an issue with my environment.</p><p><a href=\"http://forum.kde.org/viewtopic.php?f=213&amp;t=98228\" rel=\"nofollow noopener\" title=\"http://forum.kde.org/viewtopic.php?f=213&amp;t=98228\">http://forum.kde.org/viewto...</a></p>","replies":[]}]
