[{"id":"dsq-457709743","author":"Enrico Ros","deleted":false,"createdAt":"2008-03-17T03:58:05Z","message":"<p>Wow! Just tried it and it looks good and feels good. I'm not sure whether the fullscreen version needs it btw.<br>Compliments for this little gem.</p>","replies":[]},{"id":"dsq-457709744","author":"David","deleted":false,"createdAt":"2008-03-17T04:16:02Z","message":"<p>For zoom-to-fit, actual-size, etc., would it be feasible/sensible to do something like.... on the actual slider there are little icons and markers and point to the places on the slider that correspond to zoom-to-fit and actual-size? And if you click on them, they go there. (And maybe a bit of snapping if you stay near them for a significant amount of time? Although, that could get annoying.)</p><p>Or would this not be all that nice?</p>","replies":[]},{"id":"dsq-457709747","author":"Leo S","deleted":false,"createdAt":"2008-03-17T04:21:54Z","message":"<p>Looks nice.  The only concern being that it may not be obvious to people that this is a zoom function.  Perhaps actually write Zoom in the status bar next to the controls to make them easier to find.</p>","replies":[]},{"id":"dsq-457709749","author":"Aurélien","deleted":false,"createdAt":"2008-03-17T04:23:51Z","message":"<p>@Enrico Ros: Oups... no, the fullscreen version does not need it, will fix.</p><p>@David: Yes, I plan to add some snapping to 100% and probably to zoom-to-fit values.</p>","replies":[]},{"id":"dsq-457709753","author":"Hayato Ijuin","deleted":false,"createdAt":"2008-03-17T04:37:51Z","message":"<p>Implementing Hans Chen's mockup would be great. I love your work, guys!</p>","replies":[]},{"id":"dsq-457709729","author":"Askrates","deleted":false,"createdAt":"2008-03-17T04:54:13Z","message":"<p>Looks very nice! It is amazing how far Gwenview is ahead of the competition, not only in the free software world,  but in the proprietary one as well. Keep up the good work</p>","replies":[]},{"id":"dsq-457709730","author":"mutlu","deleted":false,"createdAt":"2008-03-17T05:29:46Z","message":"<p>Awesome!</p><p>Your work on Gwenview's interface is really outstanding. I hope it will be taken up by as many KDE applications as possible (for now, only Okular has planned something like your slider IRC).</p><p>Thank you for all your work. It makes all us users' work so much more pleasant. :)</p>","replies":[]},{"id":"dsq-457709731","author":"Casper Boemann","deleted":false,"createdAt":"2008-03-17T05:56:15Z","message":"<p>Cool, but koffice 2 have had this for a while now, and it looks ver similar. I think there is cause to move this into kdelibs.</p><p>Recently it was changed a bit, and also handles fit-to-XX</p><p>you should check it out.</p>","replies":[]},{"id":"dsq-457709733","author":"soap","deleted":false,"createdAt":"2008-03-17T08:58:34Z","message":"<p>The slider would be useful for me in fullscreen, but only if hidden like the controls in most video gui's.</p>","replies":[]},{"id":"dsq-457709737","author":"Boudewijn Rempt","deleted":false,"createdAt":"2008-03-17T10:45:12Z","message":"<p>Why don't you grab the zooming slider Peter Simonssen implemented for KOffice? It's got all the necessary things, including prettiness and should be easy to port to digikam.</p>","replies":[]},{"id":"dsq-457709738","author":"Jos Poortvliet","deleted":false,"createdAt":"2008-03-17T10:45:21Z","message":"<p>I would like to encourage you to have a look at the KOffice codebase, they've been working on this. Have a look:<br>Normal:<br><a href=\"http://img249.imageshack.us/img249/4850/zoom1lh6.png\" rel=\"nofollow noopener\" title=\"http://img249.imageshack.us/img249/4850/zoom1lh6.png\">http://img249.imageshack.us...</a><br>Mouse over:<br><a href=\"http://img174.imageshack.us/img174/8231/zoom2nu6.png\" rel=\"nofollow noopener\" title=\"http://img174.imageshack.us/img174/8231/zoom2nu6.png\">http://img174.imageshack.us...</a></p>","replies":[]},{"id":"dsq-457709739","author":"kedadi","deleted":false,"createdAt":"2008-03-17T10:49:01Z","message":"<p>Aurélien,</p><p>thats a great feature, good to have it, i like to have a zooming slider on the status bar, but it needs some love, maybe you should take a look at f-spot's zooming slider.</p><p>thank you</p>","replies":[]},{"id":"dsq-457709741","author":"Boudewijn Rempt","deleted":false,"createdAt":"2008-03-17T10:54:51Z","message":"<p>If you need a good implementation for a statusbar zoom control, why not nick the one Peter Simonssen made for KOffice? It's pretty polished by now and very usable -- and it should be easy enough to port to Digikam.</p>","replies":[]},{"id":"dsq-457709742","author":"Aurélien","deleted":false,"createdAt":"2008-03-17T11:28:50Z","message":"<p>@Boudewijn Rempt: I will have a look at KOffice zoom slider. BTW: this is about Gwenview, not Digikam :-)</p>","replies":[]},{"id":"dsq-457709724","author":"Fri13","deleted":false,"createdAt":"2008-03-17T14:09:48Z","message":"<p>Can i still hide statusbar? because it is Ugly... <br>If user cannot hide statusbar and have nice clean picture viewer, application can come a useless because customisation is forgetten.</p><p>That is one thing what is keeping KDE4 still away from good usability.</p><p>All GUI should be design to be very easily to customize with large amount of options. But it's very important to do _default_ settings to be for them who dont know/like to customise their applications.<br>KDE is going wrong direction if there ain't coming soon (4.1 - 4.2) all those options to customise GUI. Gwenview seem to go to direction where many starts looking other applications because Gwenview try to do everything else than just allow easy picture viewing and browsing, default should be just simple viewer but then allow sidebar what gives all other non-view options like rotate and other stuff.</p><p>That zoomslider should be possible to move from statusbar to somewhere else if wanted. Make it work as \"pop-up\" in fullscreen when mouse goes to spesific place but not so that statusbar pop up, but more like on aperture has own toolbars on fullscreen.<br>But most important thing is that slider can be moved away from there if wanted.<br>And then there should be alot cleaning Gwenview toolbar like, why there are double of rotate picture when sidebar is showed?</p><p>Just for my 2 cents</p>","replies":[]},{"id":"dsq-457709725","author":"Tregar","deleted":false,"createdAt":"2008-03-17T17:41:06Z","message":"<p>2 Fri13</p><p>You said that status bar is ugly. Ok. What would you have said if it was stylable?<br>Qt4 has very good css styling possiblities. <br>I guess it wouldn't be hard to make loading global css from file and addind object names to widgets so they can be styled individually.</p>","replies":[]},{"id":"dsq-457709726","author":"Aurélien","deleted":false,"createdAt":"2008-03-18T03:01:24Z","message":"<p>@Fri13: I am not satisfied with the current look either. I am going to try to achieve something similar to Picasa zoom slider, at least the way the zoom-to-fit and reset-zoom buttons are set.</p><p>I may also add a \"hide statusbar\" item, but I am not sure about it yet.</p>","replies":[]},{"id":"dsq-457709722","author":"Fri13","deleted":false,"createdAt":"2008-03-18T12:45:31Z","message":"<p>@Tregar: It's not about the style, it's about status bar itself. It takes space from picture. It adds distortion for view because there are bars top/bottom side of image. But it might help if that bar is 50% transparent with gray/black effect, if that is possible?</p><p>Default look should always be like all other KDE apps as they follow systemsettings settings. It's usability question if not all buttons and \"action\" buttons look same when using different applications. This is one problem on windows, like Nero GUI is very different than somekind other burning tool or those sound / 3D card control panels what are themed to something else than Windows theme.</p><p>I suggest that zoomslider can be deattached and attached to somewhere other toolbar and hide statusbar then. By default it can be there if it's better for new users.</p><p>I use alot Digikam and i feel it bad to have zoomslider and next/preview image controls on statusbar. And if i want statusbar away, I loose controls too.</p><p>Many laptops has screensize 1280x800 and on those it is need to fight to save every pixel in vertical size. New EEEpc has 1024x600 screen and there it's more important to get all pixels away what isn't needed. Even that now typical new LCD monitor what is buyed is 22-24\", it is important that all pixels are saved what just can be saved.</p>","replies":[]}]