[{"id":"dsq-645751017","author":"avlas","deleted":false,"createdAt":"2012-06-28T18:02:21Z","message":"<p>Very nice initiative!</p>","replies":[]},{"id":"dsq-645751013","author":"François","deleted":false,"createdAt":"2012-06-28T18:29:03Z","message":"<p>Wow, that's one smart initiative.<br>I really hope you'll succeed in it. I'll try to take a look at the wiki to see if I can help in some way.<br>Keep up the (very) good job !</p>","replies":[]},{"id":"dsq-645751015","author":"Andrea","deleted":false,"createdAt":"2012-06-29T02:11:45Z","message":"<p>great idea!</p>","replies":[]},{"id":"dsq-645751018","author":"VisageDeLune","deleted":false,"createdAt":"2012-06-30T06:26:07Z","message":"<p>Eventually ?</p><p>Let me say I've always loved KDE (since I started using it in 2001) and appreciate the time and effort you unpaid and passionate developpers put into SC, and you personally into details. In spite of that I've been progressively using my OS X setup for more than just work (graphic design) until I realized KDE felt broken to me. Mainly because of a lack of polishness on KDE's side and things you don't know what to make out of.</p><p>I kept coming back to linux and KDE SC, playing around. I now master QtCurve settings very well (oxygen is a great teamwork indeed but aesthetically questionable. and why is it so hard for graphic designers to do anything nice easily in this regard ? Documentation about theme design was scattered over many sites and apparently outdated converning plasma themeing last time I checked). But so much there feels like it's the result of a status quo, held back in the past. And it'd be acceptable if it helped getting some work done. Instead of that what is true for one app is not for the other. You have so much to learn as a new user.</p><p>To keep the comment short (or not too long) the only example I'll give here are Activities. I'm very enthousiastic about it whenever I read of it on kdeplanet, yet when on my desktop they feel like an utter mess. I've created a few of them, but it feels like it's a good idea with nothing to make it true, something you're not supposed to really use. UX feels unnatural and you end up forgetting it even exists. The worse is I notice smart new features and things getting better on each release, but never good : something's always been wrong with the way it's presented and contradicted by other paradigms. (BTW don't deprecate Virtual desktops before having Activities fully useable... it'd be quite \"unsettling\".)</p><p>And yet I love it : as much as I can rant about it, I have a story with this software. And from an uneducated point-of-view (I have absolutely no coding skills) I feel the technologies behind KDE are more than promising and that there have been many needed improvements... so why the pain ?</p><p>So Aurélien, you're damn right there's fixing to do. Mandatory UX guidelines could be part of the solution in addition to annoyance hunting (maybe most devs will feel this as an intrusion, but I bet most users will feel relief. e.g: why does the user have to move the cursor and go click in the text field if all they're supposed to do in this context is to look for a plasmoid to add (or to close the plasmoid selection thing. And why oh why has noone fixed it yet? Hopefully your initiative is the occasion to tacke this kind of inconsistencies). Whatever the extent of the effort, I've been longing for such an initiative to emerge which in itself will be a good motive to get back to linux and contribute again.</p><p>On a side note : since I'm morally enclined towards OSS I considered switching to Gnome 3 at some point in order to avoid monoculture. But didn't last long : it was an early version and it felt quite \"rigid\", I had KDE habits and finally sticked to mac-only without noticing it. Yet I was really pleased by the crippled DE for it has a vision, even if quite restrictive then (it might still be. I haven't used it since). So it is obvious Gnome is going somewhere wether you like that vision or not.</p><p>Now about KDE, as good as it sounds (and probably will look) UX love is only one front from which the KDE experience can be streamlined. Going cosmetic is nice. I hope this effort is the occasion to get a better Idea at how to create whatever tools/teams/process KDE needs to propose a vision, a sensible vision toward which to tend, make what is needed to deploy it consistently and then stick to it for quite some time. Or I fear this extra mile is an extra mile toward nothing much.</p><p>Anyway keep up the good work : ça fait (malgré tout ça) vraiment plaisir ;)</p>","replies":[{"id":"dsq-645751021","author":"iberlynx","deleted":false,"createdAt":"2012-07-01T15:55:48Z","message":"<p>Hey VisagedeLaLune,</p><p>Nice speech, I hope it will translate in you taking part in the effort to make things better, instead of just bitching about it.</p><p>I noticed you said you had trouble finding the documentation for how a designer could create a desktop theme, and then you finally got it.<br>Can I ask that you give back and put your accumulated knowledge in techbase, because I'm sure many more users, myself included are troubled by the same questions about theming.</p>","replies":[]}]},{"id":"dsq-645751024","author":"iberlynx","deleted":false,"createdAt":"2012-07-01T16:11:40Z","message":"<p>Hi Aurélien,</p><p>thank you for starting exactly what I was thinking it might be needed to make KDE rule over the crippled fruit software!<br>I want to help, please, after akademy's BOF, post the details of how people can join in the discussion and help!</p><p>I have a few suggestions a priori:</p><p>* From this BOF should come out a formal group that people can join, it should attract usability experts, designers, advanced users and of course expert and novice developpers (It would be a nice way for people to start learning developping).</p><p>* This group should be associated with the release team, setting the goals of releasability, helping focus all developpers, at the pre-release stage, to this goal of cleaning all the quirks of each application, and of the interaction between the applications.</p><p>* It should maintain the new feature request framework to be created, suggest new lacking or inovative features on its own, test the best ideas for usability with real users, get feedback from designers, and then across the whole KDE SC authoritatively suggest the way forward, also allocating its own set of expert and novice developpers to help accomplish the set goals on every part of KDE SC.</p><p>Thank you for getting the ball roling</p>","replies":[]},{"id":"dsq-645751026","author":"Emiliano Zapata","deleted":false,"createdAt":"2012-07-11T10:46:43Z","message":"<p>good initiative, congratulations. I just want to mention that besides fix the little details, it is essential to have a good basis to prevent these bugs appear. As health planners say: the best medicine is to prevent the onset of the disease. It is better and cheaper. In that sense, it is necessary to implement a good KDE Human Interface Guidelines, documented in detail, so developers can easily check. In that space would accommodate your serie \"common user interface mistakes in kde \", but as a standard KDE interface.<br>I think a wiki similar to that performed by the OS Elementary team: <a href=\"http://elementaryos.org/docs/human-interface-guidelines\" rel=\"nofollow noopener\" title=\"http://elementaryos.org/docs/human-interface-guidelines\">http://elementaryos.org/doc...</a><br>Aurelien, what do you think about this?</p><p>If this comment is poorly written that I did it with google translator.<br>regards</p>","replies":[]}]