[{"id":"dsq-457709600","author":"scroogie","deleted":false,"createdAt":"2008-01-10T21:52:32Z","message":"<p>It still looks a bit too wide after the changes. Too much blank space next to the sliders.</p>","replies":[]},{"id":"dsq-457709604","author":"Elias P.","deleted":false,"createdAt":"2008-01-10T21:54:06Z","message":"<p>Wow, thx. Was waiting a long time for this little fix ( <a href=\"http://techbase.kde.org/index.php?title=Contribute/Bugsquad/KrushDays#KMix\" rel=\"nofollow noopener\" title=\"http://techbase.kde.org/index.php?title=Contribute/Bugsquad/KrushDays#KMix\">http://techbase.kde.org/ind...</a> ). Please mark this issue as solved as soon as you've commited the code.</p><p>Thanks &amp; Regards,<br>Elias P.</p>","replies":[]},{"id":"dsq-457709607","author":"Aurélien","deleted":false,"createdAt":"2008-01-10T22:02:02Z","message":"<p>@scroogie: Yes, as I said, it's still not perfect.</p><p>@Elias P: Will mark the issue solved, thanks for pointing out, I didn't know it was in the KrushDay list.</p>","replies":[]},{"id":"dsq-457709609","author":"Max Howell","deleted":false,"createdAt":"2008-01-10T22:57:14Z","message":"<p>I blame Qt for this frankly. The default size hints on most widgets are just stupid. And eg. listviews don't even have a sizeHint that depends on the amount of items in them. The default is something like 4 rows. It makes Qt applications look unpolished.</p><p>GTK is *much* better at this.</p>","replies":[]},{"id":"dsq-457709610","author":"Marc","deleted":false,"createdAt":"2008-01-10T23:14:50Z","message":"<p>Another issue people complain about is visual clutter. One example of that is the tickmarks and separators in the mixer. The tickmarks are expandable, so they always appear uneven. A vertical separator isn't a bad idea, but the concept requires a lot of margin space between separators.</p><p>Here's a rough mockup of how the mixer looks without either one:</p><p><a href=\"http://www.marccarson.com/images/mixer.png\" rel=\"nofollow noopener\" title=\"http://www.marccarson.com/images/mixer.png\">http://www.marccarson.com/i...</a></p><p>A lot simpler (to me) but I guess some people must really like those tickmarks or they'd be gone by now. :)</p><p>Good post!</p>","replies":[]},{"id":"dsq-457709612","author":"Fri13","deleted":false,"createdAt":"2008-01-10T23:41:29Z","message":"<p>It's good thing to have option to resize window and sametime bad. Okay, kmix window is good when it is small but bad when it's on full screen. If it's just having few sliders. <br>(sarcasm)</p><p>And when user clicks \"add widget\" on KDE4 desktop, s/he gets small windows where can only see few plasmoids and is needed to resize window to bigger, every time if user dont save settings as special windows setting. I just use MMB to resize window to full size on height.</p><p>Then there is open/save dialog what is typically too small by default to have preview (F11) ON. Dialog is needed to resize little bigger but not to full screen.</p><p>And most hated things are Konqueror settings panel for plugins and java&amp;javascript so that window dont even fit to my laptop (new one) screen because this has 1280x800 resolution and that settings panel height is about 850px sized. If i dont have compiz-fusion, i just use alt+RMB to move it to get Ok, cancel and Apply buttons.</p><p>If i have compiz-fusion, i need to move other desktop (i have wall mode) under current desktop to get hand to those buttons because by default, Compiz-fusion dont allow window top bar go outside of desktop so i cant move it.</p><p>What do we learn here? It's important to allow resizing and sometimes it's good if resizing isn't possible :-)</p><p>ps. I agree too that Kmix window should be about  and not so much empty space.</p>","replies":[]},{"id":"dsq-457709589","author":"Aurélien","deleted":false,"createdAt":"2008-01-11T04:11:53Z","message":"<p>@Max Howell: Yes, sometimes Qt could be a little more helpful with regards to widget sizes. It reminds me of code I had to write to make sure a QListView width was the size of the largest item.</p><p>@Marc: I am not sure the separators should go, but the ticks are useless for sure. There is an option to remove them in KMix configuration dialog, but they should just not be there.<br>Another interesting option in the configuration dialog is the ability to have horizontal sliders. While it's a bit unusual for a mixer, it's quite good because there is no more vertical text and the mute and capture widgets could be replaced with normal checkboxes.</p>","replies":[]},{"id":"dsq-457709593","author":"Aurélien","deleted":false,"createdAt":"2008-01-11T04:12:24Z","message":"<p>For your information, I just committed the changes.</p>","replies":[]},{"id":"dsq-457709592","author":"attendant","deleted":false,"createdAt":"2008-01-11T05:24:46Z","message":"<p>while we're at it, the mute checkbox, the slider and the image for every \"channel\" should all be horizontally centered as well (looks bad otherwise).</p>","replies":[]},{"id":"dsq-457709597","author":"kwilliam","deleted":false,"createdAt":"2008-01-11T06:52:35Z","message":"<p>Shouldn't the words \"Front\" and \"PCM\" be horizontal, at the bottom of the slider?  My guess is most humans can't read sideways very well.  (I know I can't.)  And for aesthetics, you could center the sliders.</p><p>See mockup:</p><p><a href=\"http://stashbox.org/70856/Kmix4.png\" rel=\"nofollow noopener\" title=\"http://stashbox.org/70856/Kmix4.png\">http://stashbox.org/70856/K...</a></p>","replies":[]},{"id":"dsq-457709596","author":"kwilliam","deleted":false,"createdAt":"2008-01-11T06:59:01Z","message":"<p>I'm sorry, in my desire to post a mockup I completely forgot to thank you.  Thank you for working on such things!  Such small aesthetical improvements do not get as much attention as fancy programs like Kwin and Plasma, but they are just as important - if not more so - on user experience.  I applaud your work on the default-size realm!</p>","replies":[]},{"id":"dsq-457709599","author":"kwilliam","deleted":false,"createdAt":"2008-01-11T07:37:08Z","message":"<p>Ok, here's an even better mockup for KMix.</p><p><a href=\"http://stashbox.org/70872/Kmix4.png\" rel=\"nofollow noopener\" title=\"http://stashbox.org/70872/Kmix4.png\">http://stashbox.org/70872/K...</a></p><p>Changes include:<br>* Horizontal text for labels<br>* Checkbox on same line as Mute text (duh!)<br>* Tick marks limited to 25%, 50%, and 75% points.  This makes the tick marks actually useful!<br>* Better use of space in window, by centering widgets and using full window width.</p><p>Any chance of making KMix look like this?</p>","replies":[]},{"id":"dsq-457709587","author":"Aurélien","deleted":false,"createdAt":"2008-01-11T12:41:58Z","message":"<p>@kwilliam: I like your second mockup a lot. I would just reverse the \"mute\" text and its checkbox: checkboxes are generally on the left of their text.</p><p>I don't like vertical text either, but one thing must be kept in mind though: sound cards come in lots of different flavours: in my case the displayed sliders all feature short texts, but some other sliders can have much longer texts. This can be a problem if the text is horizontal as it would use quite a lot of horizontal space... unless you use horizontal sliders.</p>","replies":[]},{"id":"dsq-457709585","author":"Enrico Ros","deleted":false,"createdAt":"2008-01-11T13:52:26Z","message":"<p>Aurélien: you should move to the Oxygen/Visual UI steering team! Thanks for taking care of this aspects of the desktop.<br>The looks *do really matter* for every user (even the functionality is important but that is taken as granted :-)!</p><p>You simply Rock ;-)</p>","replies":[]},{"id":"dsq-457709588","author":"Aurélien","deleted":false,"createdAt":"2008-01-11T15:36:03Z","message":"<p>@Enrico Ros: Thanks!</p>","replies":[]}]