[{"id":"dsq-457711101","author":"Luis Cardoso","deleted":false,"createdAt":"2010-07-01T08:21:14Z","message":"<p>Dear Mr. Gâteau,</p><p>When I started using Linux, around 2003, I opted for KDE simply because it was then much faster than Gnome. But over the past two years or so things begun to change, and now Gnome is noticeably faster (screen update/redrawing, window animations, etc). I am currently using a fully updated Fedora 13 on different computers (Acer AS 1410, Intel DG45ID with onboard graphcis), and Gnome, even with desktop effects turned on, is much snapier than KDE 4.4.4 on these machines (maybe with faster graphics cards and proprietary drivers the difference wouldn't be noticeable). I am still using KDE because I am more used to it and because I find it nicer, but I am seriously considering moving to Gnome. Ever since KDE 4.0 was released, the trend has been to add features, and in this respect KDE now is very functional and is also very stable. Developers should now concentrate on streamlining the code and improving performance.</p>","replies":[{"id":"dsq-457711113","author":"lefty.crupps","deleted":false,"createdAt":"2010-07-01T16:26:25Z","message":"<p>@Luis Cardoso<br>Per this and many other recent posts:<br><a href=\"http://dinosaur-os.com/post/751205987\" rel=\"nofollow noopener\" title=\"http://dinosaur-os.com/post/751205987\">http://dinosaur-os.com/post...</a><br>KDE 4.5.x will be focused on speed, stability, and bugfixing.  Try it out, or just move to GNOME already.  I don't think that I am alone when I say that the 4.0 series started out rough but has been improving, greatly with the 4.2 and above releases, and we're all tired of this discussion.</p>","replies":[]}]},{"id":"dsq-457711102","author":"baxeico","deleted":false,"createdAt":"2010-07-01T12:14:59Z","message":"<p>Aurelien, what is the name of the theme/window decorations are you using? I like it very much from your screenshot!</p>","replies":[{"id":"dsq-457711103","author":"Aurélien","deleted":false,"createdAt":"2010-07-01T12:18:23Z","message":"<p>This is \"UniQ\", an Aurorae theme.</p>","replies":[]}]},{"id":"dsq-457711104","author":"nn","deleted":false,"createdAt":"2010-07-01T12:28:45Z","message":"<p>For the next version, could you consider to enable Gwenview to browse and show the integrated jpeg previews of rawfiles? The functionality already exists outside digiKam, e.g. Dolphin uses it to show the thumbnails for rawfiles, Gwenview would just omit the downscaling and show them fullsize. This would be very handy.</p>","replies":[{"id":"dsq-457711106","author":"Aurélien","deleted":false,"createdAt":"2010-07-01T14:22:24Z","message":"<p>Gwenview relies on Qt image plugins to decode images. If someone writes a Qt plugin to show raw files, Gwenview will be able to take advantage of it, and other Qt/KDE applications will benefit from it as well.</p>","replies":[{"id":"dsq-457711119","author":"nn","deleted":false,"createdAt":"2010-07-01T20:02:40Z","message":"<p>I'm afraid you misunderstood. It's not about reading the raw files, the previews are jpeg images.<br>And it is implemented somewhere in KDE, as in file dialogs as well as Dolphin/Konqueror these previews are already used.</p>","replies":[{"id":"dsq-457712315","author":"Aurélien","deleted":false,"createdAt":"2010-07-01T20:35:08Z","message":"<p>Gwenview is an image viewer, so getting thumbnails is not enough: If it is not possible to get an actual image to show (even if it's a large jpeg preview), then there is no point in showing thumbnails.</p>","replies":[{"id":"dsq-457712654","author":"nn","deleted":false,"createdAt":"2010-07-02T16:13:07Z","message":"<p>The jpeg previews are, in most cases, the same pixel size as the raw file,  sometimes only half the size. Still, it's enough to view them fullscreen. The thumbnails shown are just downscaled from these images.<br>I'll try to look into how KFileDialog manages this, but I guess it's somewhere in libkdcraw or so.</p>","replies":[]}]}]}]}]},{"id":"dsq-457711107","author":"Artem S. Tashkinov","deleted":false,"createdAt":"2010-07-01T15:23:47Z","message":"<p>I hope a longstanding bug with progressive PNG images loading will be (re)solved someday.</p><p>Right now (after five major KDE 4.x releases) if you open a PNG image in a new Konqueror tab, this image will only be shown after it's been completely downloaded which is counterintuitive and terribly annoying.</p><p>A bug was posted more than a year ago, but zero Gwenview developers have cared to comment upon it.</p>","replies":[{"id":"dsq-457711112","author":"Artem S. Tashkinov","deleted":false,"createdAt":"2010-07-01T15:26:04Z","message":"<p>I'm talking about bug 178419.</p>","replies":[]},{"id":"dsq-457711116","author":"Aurélien","deleted":false,"createdAt":"2010-07-01T16:40:06Z","message":"<p>Heh, there is right now exactly one Gwenview developer, and he is pretty busy.</p><p>I can see how this is a problem for the KPart but am not sure it really matters for the standalone application. Therefore I am wondering whether it would not make sense to get rid of the KPart and let Konqueror uses the one it provides (khtmlimage) which does already support progressive loading.</p>","replies":[]}]},{"id":"dsq-457711117","author":"mutlu","deleted":false,"createdAt":"2010-07-01T17:17:23Z","message":"<p>Aurélien, this is a very nice list of improvements. All of these (EXIF bug, video crash, image name &amp; size) were things I wished for and they materialized. :)</p><p>Haven't tried the new RC yet, thus I haven't seen the panning yet, nor the new asynchnonicity. Looking forward to it! And to your ideas for 4.6, of course. You really got me curious. :P</p><p>Cheers, mutlu</p>","replies":[]},{"id":"dsq-457711120","author":"Garn LeBaron","deleted":false,"createdAt":"2010-07-02T00:46:51Z","message":"<p>I just wanted to say thanks! Gwenview is one awesome program. I love it! I use it all the time!</p>","replies":[]},{"id":"dsq-457711122","author":"Daniel","deleted":false,"createdAt":"2010-07-03T09:16:56Z","message":"<p>Let me second Garn's opinion, Gwenview is indeed an awesome piece of software. Keep up the great work!</p>","replies":[]},{"id":"dsq-457711123","author":"T___U","deleted":false,"createdAt":"2010-07-03T22:29:45Z","message":"<p>Thank you Aurélien, those are most appreciated fixes / changes !</p>","replies":[]},{"id":"dsq-457711125","author":"Alejandro Nova","deleted":false,"createdAt":"2010-07-04T07:22:16Z","message":"<p>How can I show the rating for each file directly in the icon list? I don't find the option...</p>","replies":[{"id":"dsq-457712318","author":"Aurélien","deleted":false,"createdAt":"2010-07-04T10:36:39Z","message":"<p>It's in View &gt; Thumbnail Details</p>","replies":[]}]},{"id":"dsq-457711127","author":"Laurent Grawet","deleted":false,"createdAt":"2010-07-11T14:39:07Z","message":"<p>Hi Aurelien,</p><p>Thank you very much for you great work. Is there any hope for icc profiles support as requested a year ago ? Because despites all its wonderful features, Gnenwview is pretty useless to a lot of people without icc support.From now I use Geeqie under KDE. Digikam has ICC support, maybe you can inspire yourself from its code.</p><p>Thanks a lot,</p><p>Laurent</p>","replies":[{"id":"dsq-457712319","author":"Aurélien","deleted":false,"createdAt":"2010-07-11T16:42:08Z","message":"<p>It is definitely in my TODO list, but this is a feature I don't personally need and I don't think most users need so it's quite low priority for me right now. Having said that, I fully understand how this can be important for quite a few users, so I would provide all the necessary support to anyone willing to work on it.</p>","replies":[{"id":"dsq-457712323","author":"Laurent Grawet","deleted":false,"createdAt":"2010-07-12T02:06:31Z","message":"<p>Well, do a monitor calibration, then make an icc profile with Spyder2express/Spyder3express (cheap probes) and <a href=\"http://www.argyllcms.com\" rel=\"nofollow noopener\" title=\"http://www.argyllcms.com\">http://www.argyllcms.com</a>. You'll see it's a must have :-)    Few monitors are well calibrated right out the factory. Most are really off. This is especially true with laptop screens which are the worst candidates to do real photographic work. The results after calibration/icc profiling are really impressive.</p><p>Also, is there some kind of public TODO list ?</p>","replies":[]}]}]}]
