[{"id":"dsq-457711786","author":"BajK","deleted":false,"createdAt":"2011-04-21T19:21:14Z","message":"<p>I'd propose something like this: (You need to fit it into a window/dialog of course):<br><a href=\"http://privat.broulik.de/lula3.jpeg\" rel=\"nofollow noopener\" title=\"http://privat.broulik.de/lula3.jpeg\">http://privat.broulik.de/lu...</a><br>and this \"wedge\" (i.e. that arrow/triangle) points to the respective item that emited the signal/message, so if you enter a wrong address in a adress book entry, a bar would appear above the respective input field, or in this case, you deleted a user and the list is what changed.<br>Or something like that. Maybe not entirely possible/suitable but I really like the style with that arrow/triangle, looks polished which would fit oxygen :P</p>","replies":[{"id":"dsq-457711794","author":"Aurélien","deleted":false,"createdAt":"2011-04-22T13:19:10Z","message":"<p>The arrow looks indeed nice, but would be a bit more difficult to implement in a color-scheme-independent way. Will see what I can do.</p>","replies":[]}]},{"id":"dsq-457711785","author":"Eike Hein","deleted":false,"createdAt":"2011-04-21T19:35:06Z","message":"<p>Cyrille's collapsible widgets idea is used to great effect in the user interface of Luxology's Modo, which I've always found very pleasant to use. It's a great app to be inspired by in terms of UI ideas: <a href=\"http://www.luxology.com/modo/\" rel=\"nofollow noopener\" title=\"http://www.luxology.com/modo/\">http://www.luxology.com/modo/</a></p>","replies":[]},{"id":"dsq-457711789","author":"damian","deleted":false,"createdAt":"2011-04-21T21:57:59Z","message":"<p>Did you discuss an standard way of removing the menubar?</p>","replies":[{"id":"dsq-457711797","author":"Aurélien","deleted":false,"createdAt":"2011-04-22T13:36:30Z","message":"<p>Yes, we talked about this during the session about Calligra main windows. I don't think we came to any definitive conclusion, though.</p>","replies":[]}]},{"id":"dsq-457711787","author":"g","deleted":false,"createdAt":"2011-04-21T23:40:04Z","message":"<p>I like very much the ideas and the beautifull mockups presented here.  In the mockup of BajK the left and right margin of the green box should be the same as for the box below it.</p>","replies":[{"id":"dsq-457711790","author":"BajK","deleted":false,"createdAt":"2011-04-22T01:31:58Z","message":"<p>This was just an illustration :)<br>It is basically a screenshot of a dialog created using kdialog set as background of a html div container and ontop of this I set the default notifications I use in my interface framework for basically all interface/web projects :) with a bit of fiddling in css margin settings. It is just to show the basic shape of it and i did not put much effort in adapting it ;)</p>","replies":[]}]},{"id":"dsq-457711788","author":"Guest","deleted":false,"createdAt":"2011-04-22T00:36:10Z","message":"<p>It sounds like you all got some good work done. :)<br>One question, though. When you say that one goal for Calligra's UI was to \"not look too closely similar to Microsoft Office Ribbon\", what was the reasoning behind that? I don't really take either side, but I'm curious why it was as specific goal here.</p>","replies":[{"id":"dsq-457711798","author":"Aurélien","deleted":false,"createdAt":"2011-04-22T13:38:30Z","message":"<p>It is because apparently Microsoft has patented the Ribbon concept: one can use it in any applications except office suites... Software patent do not exist in many countries but it would be problematic if our applications were declared illegal in the US.</p>","replies":[{"id":"dsq-457711800","author":"Guest","deleted":false,"createdAt":"2011-04-22T13:50:30Z","message":"<p>Ah yes, I'd forgotten about that. :/<br>Grr</p>","replies":[]},{"id":"dsq-457711801","author":"Markus","deleted":false,"createdAt":"2011-04-22T15:46:02Z","message":"<p>Despite Ribbons being a totally crappy concept anyway, it's funny to see that Kexi, a KDE office application, has adopted Ribbons: <a href=\"http://www.youtube.com/watch?v=yzv9M2_sLQc\" rel=\"nofollow noopener\" title=\"http://www.youtube.com/watch?v=yzv9M2_sLQc\">http://www.youtube.com/watc...</a><br>Nevertheless, any Ribbon patents are invalid anyway because Borland Delphi 1.0 already had them which makes Delphi prior art.</p>","replies":[{"id":"dsq-457711803","author":"Aurélien","deleted":false,"createdAt":"2011-04-22T16:35:14Z","message":"<p>I personally like a lot of the ideas behind the Ribbon, but I don't think it works well for wide screens so Calligra need something else.</p>","replies":[{"id":"dsq-457712501","author":"STiAT","deleted":false,"createdAt":"2011-04-22T18:19:30Z","message":"<p>I tend to agree with that. Even with a 24'' full hd it is annoying to have a ribbon bar.<br>Actually, I have a lot of more width than height available, making use of that makes more sense if you ask me. Considering that the documents I write on are usually not landscape, but portrait, it definitely makes more sense (at least for a text application as KWord, could be different for Krita though)</p><p>The question is of course the usability of a design, because basically, KWord tried something like this a while back (having \"detail\" controls on the right side), and for some reason I don't know I dod not like that as well.</p>","replies":[]}]},{"id":"dsq-457711804","author":"Guest","deleted":false,"createdAt":"2011-04-22T22:55:36Z","message":"<p>Also, I would point out that it comes down to whether Microsoft /can/ enforce their patent, not whether it technically should be enforceable. Given the state of US law these days, I wouldn't want to risk it either.<br>Also I agree with Aurélien that it's terrible on small (wide) screens.</p>","replies":[{"id":"dsq-457711809","author":"Markus","deleted":false,"createdAt":"2011-04-23T00:20:18Z","message":"<p>MS can't enforce anything against KDE. KDE only releases source codes and those are protected by the US constitution as free speech. MS could only sue US-bound distributors and all major ones are members of OIN which would promptly backfire at MS.</p>","replies":[]}]}]}]}]},{"id":"dsq-457711792","author":"Vladislav Blanton","deleted":false,"createdAt":"2011-04-22T09:36:25Z","message":"<p>This is important work; thanks to all the designers, thinkers, + developers who made the time for this conference.</p>","replies":[]}]