[{"id":"dsq-457711186","author":"g","deleted":false,"createdAt":"2010-07-12T05:27:13Z","message":"<p>I'm sorry to ask this question (I don't want to criticize your hard work), but is there a possibility to switch off inline renaming?  Inline renaming is one of the most horrible \"features\" ever implemented in any program (I hated it in windows, I hate it in dolphin, konqueror, and most of all, I hate it in file dialogs, luckily it can be switched off in these KDE apps).  The reason why I hate it is because it gets triggered in 95% of the cases when I click on a filename (because clearly the duration of my mouse button presses is the same as the duration needed to trigger inline renaming), and I get really pissed when a file dialog/dolphin starts renaming a file when I just want to select it (that is one of the reasons why I cannot use windows: I am near nervous breakdown after 5 minutes using it because of such \"features\").  I have no problems though with renaming triggered by F2 or by selecting the \"Rename\" entry in the popup menu which appears using the right mouse button.</p>","replies":[{"id":"dsq-457711188","author":"Aurélien","deleted":false,"createdAt":"2010-07-12T11:55:39Z","message":"<p>Inline renaming in Gwenview can only be triggered by F2 or from the File or context menu, not by click, so you should be safe.</p>","replies":[{"id":"dsq-457711190","author":"g","deleted":false,"createdAt":"2010-07-13T15:04:23Z","message":"<p>That is great news! Thanks for your great work!!!</p>","replies":[]}]}]},{"id":"dsq-457711187","author":"DanaKil","deleted":false,"createdAt":"2010-07-13T03:53:31Z","message":"<p>Your new \"add widget\" mockup looks really great, too bad it has been rejected :-/</p>","replies":[]},{"id":"dsq-457711189","author":"stativ","deleted":false,"createdAt":"2010-07-13T10:59:04Z","message":"<p>I love your mock-up for a new “Add widget” user interface! It's a pity it got rejected.</p>","replies":[]},{"id":"dsq-457711185","author":"ShaineT","deleted":false,"createdAt":"2010-10-28T13:00:24Z","message":"<p>Still trying to figure out why you would go to Finland without your digital camera!?!  Thanks for Gwenview, I love it! :-)</p>","replies":[]}]
