[{"id":"dsq-727802092","author":"Axe","deleted":false,"createdAt":"2012-12-05T01:37:39Z","message":"<p>oh yes I do! :)</p>","replies":[]},{"id":"dsq-728241456","author":"Dion Moult","deleted":false,"createdAt":"2012-12-05T13:25:35Z","message":"<p>Epic - I can't wait to try out SLC and see whether or not it's actually useful. Is there a list of activity/SLC-enabled apps I can find somewhere?</p>","replies":[{"id":"dsq-728299507","author":"Aurélien Gâteau","deleted":false,"createdAt":"2012-12-05T14:43:18Z","message":"<p>Not that I know of, but Ivan has been busy adding support to many KDE applications, so it will soon be ubiquitous :)</p>","replies":[]}]},{"id":"dsq-728351129","author":"Andreas Wallberg","deleted":false,"createdAt":"2012-12-05T15:39:04Z","message":"<p>Gwenview is really looking increasingly fantastic!</p><p>This is most likely not the right place, but I have a feature request: persistent image selection.</p><p>Often when I select a subset of images to say drag-and-drop or upload somewhere, I Ctrl-click them in Browse mode to build a selection until I come to images where I need to pick one image among several similar candidates. To be able to pick the best one though, I often need to check them in the View mode but double-clicking one of those candidates or switching to that mode also deselects all the ones I've previously selected... :-(</p><p>I would like a selection mode that is persistent until I either click some deselect button or close the program. Similarly, it would be nice to select (or perhaps rather, mark) an image while in View-mode and have it already persistent-selected as one switches over to the browse mode.</p><p>Oh, and using tags or stars isn't quite right for this. The way I see <br>it, this is only meant to be a temporary session-persistent grouping of <br>images.</p><p>Is this workflow already possible in Gwenview somehow? If not, I'd like to request this feature and I am happy to post it in a bug tracker or other more suitable place.</p>","replies":[{"id":"dsq-728392111","author":"Aurélien Gâteau","deleted":false,"createdAt":"2012-12-05T16:18:30Z","message":"<p>I actually do abuse tags (or stars depending on my mood) for this purpose. Using tags has a few other benefits: your selection becomes persistent across reboots and can be accessed through other applications.</p><p>What may be missing is some formalization of \"temporary tags\": that is, tags which are super fast to assign (that is why I abuse stars for that right now) and which can be easily removed from all documents once you are done with them.</p>","replies":[{"id":"dsq-729518844","author":"Andreas Wallberg","deleted":false,"createdAt":"2012-12-06T20:07:25Z","message":"<p>Yes you are right, the tagging system is certainly powerful enough to support this. What is needed is a UI that makes it convenient to use. In addition to persistent-select and deselect buttons or similar UI elements, it would be nice with something like a key+mouse button binding, like Ctrl+middle or Ctrl+Shift+left or something, along with perhaps a different selection color highlighting the selected items.</p><p>As Danakil said below, this selection procedure would be convenient in other parts of KDE as well.</p><p>How should I best go about filing this request to maximize buzz and its chances of seeing an implementation?</p>","replies":[{"id":"dsq-735949651","author":"Aurélien Gâteau","deleted":false,"createdAt":"2012-12-14T13:11:51Z","message":"<p>That's a complex topic, I am not sure where to discuss it. A session at Akademy would be great, but that is quite far away. I am going to keep it in my mind though, as it is something I have deep interest to solve.</p>","replies":[{"id":"dsq-742533527","author":"Andreas Wallberg","deleted":false,"createdAt":"2012-12-19T09:28:49Z","message":"<p> In the meantime, I also filed the idea in KDE's brainstorm forum: <a href=\"http://forum.kde.org/viewtopic.php?f=83&amp;t=109229\" rel=\"nofollow noopener\" title=\"http://forum.kde.org/viewtopic.php?f=83&amp;t=109229\">http://forum.kde.org/viewto...</a></p>","replies":[]}]}]}]},{"id":"dsq-728846045","author":"Danakil","deleted":false,"createdAt":"2012-12-06T01:32:36Z","message":"<p> you \"persistent file selection\" idea is really something that could be implemented in a more general way. I have exactly the same need when I select a lot of files (in dolphin or in digiKam) </p>","replies":[{"id":"dsq-729508873","author":"Andreas Wallberg","deleted":false,"createdAt":"2012-12-06T19:52:41Z","message":"<p>Yes, I've noticed I frequently run into this problem in other KDE apps as well. It is one of those glitches in the workflow that you learn to route around one way or another yet many would probably benefit tremendously from an implementation.</p>","replies":[]}]}]},{"id":"dsq-728434681","author":"fasd","deleted":false,"createdAt":"2012-12-05T16:59:35Z","message":"<p>Finally significant changes! Thank you!</p>","replies":[]},{"id":"dsq-730356685","author":"Garry","deleted":false,"createdAt":"2012-12-07T18:23:29Z","message":"<p>I was using Picassa on Windows when I made The Switch to Linux and Gwenview has made the switch very easy.<br>Wife and kids use it to quickly modify-resize-redeye pictures and dont even think about it. Its funny how everyone has set up different icons on top depending on the use they make.</p><p>Since were all itching to say \"nice job by the way, Id like to ask for...\", Ill jump into it:<br>cant think of many things that need to be in GV but it would be nice to have basic options option for brightness, contrast and colour.</p><p>The only regression I noticed is that you cant play more than one video after another without it acting up so its a bit of a pain when you click on a bunch of pix and vids and this happens.</p><p>Still, the past 3-4 years have been very enjoyable in KDE land (Kubuntu for us after a start with Mandriva-PCLinuxOS) and software like Gwenview make using our computer very pleasant experience.</p><p>So thanks to you and everyone involved in this fine project.</p>","replies":[]},{"id":"dsq-744536160","author":"Tobias Schula","deleted":false,"createdAt":"2012-12-21T06:41:46Z","message":"<p>Is there a way to enable color management? I tried the 4.10 beta on a wide gamut display and images tagged as srgb are still way to far in the reds and greens.</p>","replies":[{"id":"dsq-744889525","author":"Aurélien Gâteau","deleted":false,"createdAt":"2012-12-21T16:53:00Z","message":"<p>There is nothing special to do: color management is always on if Gwenview is built with support for it.</p><p>You can check if it is the case by checking if Gwenview binary is linked with liblcms2 (run \"ldd $(which gwenview) | grep lcms\" and check the output contains a line like this: \"liblcms2.so.2 =&gt; /usr/(...)\")</p>","replies":[]}]},{"id":"dsq-793949183","author":"Marvin R.","deleted":false,"createdAt":"2013-02-09T16:36:12Z","message":"<p>Is it possible to have the recursive display also for normal folders and subfolders on harddrive? This is the major feature I like in Picasa because I do not need to go to every subdirectory while browsing though my personal picture folder.</p>","replies":[{"id":"dsq-795491559","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-02-11T15:32:17Z","message":"<p>This is definitely something I had in mind when I wrote this code. Hopefully it can be reused in Gwenview itself as you suggest. I need to figure out what the user interface should look like though.</p>","replies":[]}]}]
