[{"id":"dsq-2861313419","author":"Markus S.","deleted":false,"createdAt":"2016-08-26T20:04:54Z","message":"<p>What's the advantage over KColorPicker?</p>","replies":[{"id":"dsq-2861401752","author":"Aurélien Gâteau","deleted":false,"createdAt":"2016-08-26T21:04:26Z","message":"<p>It lets you evaluate contrast between foreground and background color (see screenshot 1). It has a magnified, keyboard controlled, color picker (see screenshot 2).</p>","replies":[{"id":"dsq-2861520765","author":"luis_mira","deleted":false,"createdAt":"2016-08-26T22:35:41Z","message":"<p>That's great, Aurélien!</p>","replies":[]}]}]},{"id":"dsq-2862017887","author":"Jimi","deleted":false,"createdAt":"2016-08-27T08:15:18Z","message":"<p>Thank you for this great project! Is it available for non linux distributions? Will there be other colour spaces supported than rgb? </p>","replies":[{"id":"dsq-2864304795","author":"Aurélien Gâteau","deleted":false,"createdAt":"2016-08-28T21:29:58Z","message":"<p>I haven't tried Colorpick on anything else than Linux but I expect it to build on Windows and Mac OS, since all its dependencies (Qt 5, KF5GuiAddons and KF5WidgetsAddons) are available on these platforms. The only part I am unsure of is the color picker, which may not work on a non X11 environment.</p><p>Regarding color space, I plan to add support for HSV.</p>","replies":[]}]},{"id":"dsq-2864824865","author":"Tuukka Verho","deleted":false,"createdAt":"2016-08-29T06:46:44Z","message":"<p>A suggestion: combine the contrast ratio label and the contrast example box! So instead of \"contrast example\" it says \"contrast ratio 5:1 (good)\" in the box.</p><p>Other comments: the copy button could be more associated with the text field, maybe somehow inside it? As for the up and down arrows, I cannot guess what they are supposed to do..?</p>","replies":[{"id":"dsq-2865999906","author":"Aurélien Gâteau","deleted":false,"createdAt":"2016-08-29T21:15:08Z","message":"<p>&gt; combine the contrast ratio label and the contrast example box! So instead of \"contrast example\" it says \"contrast ratio 5:1 (good)\" in the box.</p><p>I like the idea, but I am worried about the text not being readable if... there is not enough contrast :)</p><p>&gt; the copy button could be more associated with the text field, maybe somehow inside it?</p><p>That's a good suggestion, will look into it.</p><p>&gt; As for the up and down arrows, I cannot guess what they are supposed to do..?</p><p>They allows you to adjust the value of the color, which makes it easy to fix contrast. I am probably going to either get rid of them when I add HSV support, or at least replace the arrows with icons.</p>","replies":[{"id":"dsq-2866741483","author":"tom","deleted":false,"createdAt":"2016-08-30T08:51:31Z","message":"<p>Also I would place the color pipette all the way to left, right next to the color box.</p>","replies":[]}]}]}]