[{"id":"dsq-457709356","author":"bluestorm","deleted":false,"createdAt":"2007-07-15T17:43:34Z","message":"<p>Your \"unsaved flag\" really look like a \"save\" button . It might confuse some users (does it mean i saved it ? i can save it ? i should save it ?).</p><p>Maybe you could add a question mark near the floppy, in order to show you're asking the user wether she wants to save it or not.</p><p>(I'm not a usability pro, so i may be going in the wrong direction here)</p>","replies":[]},{"id":"dsq-457709358","author":"liquidat","deleted":false,"createdAt":"2007-07-15T18:10:47Z","message":"<p>Wow, pretty neat idea. I like it.<br>I would prefer having buttons instead of links, but that might be a minor detail.</p>","replies":[]},{"id":"dsq-457709363","author":"Tom Deblauwe","deleted":false,"createdAt":"2007-07-15T18:13:53Z","message":"<p>I think you should use buttons instead of the text-links. Because you have nice buttons for previous and next already, and then ugly html-like text links, which also do previous and next basically. And also you have another width of the links in every language.</p><p>Maybe you should make the previous and next buttons in the same style as previous and next of konqueror with a dropdown, but then instead of the urls you give the option 'next' and 'next unsaved'. and when \"next unsaved\" is chosen,  change the icon of the next button to something with a little disk in it. and from then on the 'next button' acts like a 'next unsaved button'.</p><p>I don't think that the yellow bar is a good idea, because it takes much space to just give the user an option to save it. <br>Maybe a little icon in the top left corner would be better?</p>","replies":[]},{"id":"dsq-457709368","author":"vr","deleted":false,"createdAt":"2007-07-15T18:19:56Z","message":"<p>Hello,</p><p>First of all: I like your idea, really.</p><p>Other applications modify their title (in title bar, window) in order to say: \"Hey, here is something unsaved.\". kwrite for example appends [modified] to the title and in the taskbar there is also an extra symbol (floppy, as in your thumbnails).</p><p>I think the symbol in the taskbar is very useful. It would be nice to see it in gwenview, too. So if gwenview is minimized, you can take a look at the taskbar entry and see wheter there is something unsaved.</p><p>The save bar need a certain space. So there is the question: can we use some free space?  In the menu bar is a lot of space...but it would look very unorganized...hmm. There is also the option of putting your \"links\" in the toolbar as buttons...but it's not really a solution. I propose the following: use a status bar! A status bar is always useful, it shows the status...or some hints etc...and if there is something unsaved, put your \"save bar\" contents in the status bar. The status bar could be used for different other things, like... :</p><p>Another thing I noticed in some kde application. (Maybe it was kwrite too, in kde4 alpha2). If there is something unsaved and you try closing the window...there is no popup, but a bar (similar to your) on the bottom of the window. It asks wheter it should be saved...I love this! ...popups are just annoying. Of course this \"small and streched diaglog\" must catch one's eye (vertain background color...) What do you think?</p><p>I think buttons in the save bar (or, maybe then the status bar ;-) would look strange. The links are okay...maybe a little bit more padding on the left and right edges. Or...instead of prev/next modified image some little icons...btw, what about \"save as\"?</p><p>By the way...in the third screenshot I see this thumbnail view. Isn't it possible to place the slider (on the bottom) in the middle/center? Would look better :)</p><p>Great idea!</p>","replies":[]},{"id":"dsq-457709371","author":"Daniel Beck","deleted":false,"createdAt":"2007-07-15T18:42:15Z","message":"<p>I like the save-bar a lot. I however think that it will not make the modal save-dialog useless: one should more think of the save bar as a dynamic information indication.</p><p>I really would like this dynamic-information-bar to be generalized and used within other application inside KDE. <br>Eclipse has something very similar. It's an animated tray that gives out warnings (e.g. the document was not saved) or errors (the information on this page is incomplete). see <a href=\"http://europa-mirror1.eclipse.org/eclipse/downloads/drops/R-3.2-200606291905/new_noteworthy/images/animated-messages.png\" rel=\"nofollow noopener\" title=\"http://europa-mirror1.eclipse.org/eclipse/downloads/drops/R-3.2-200606291905/new_noteworthy/images/animated-messages.png\">http://europa-mirror1.eclip...</a></p><p>As an application example, imagine some wizard to configure your email sendmail or SMTP email access. A \"magical bar\" appears and tells you that some information are missing. Or while editing text or changing images, the dynamic bar informs the user that the content is not saved.</p><p>It's a nice and non-obtrusive way of informing the user.</p><p>Greetings, <br>Daniel</p>","replies":[]},{"id":"dsq-457709372","author":"Werner Joss","deleted":false,"createdAt":"2007-07-15T18:44:52Z","message":"<p>good idea,<br>especially the 'save all' link :)<br>and yes, use links instead of buttons - these should be placed near the text, if possible, list growing from left to right.<br>In case of too many links to fit in the bar, some scroll function would be handy ?</p>","replies":[]},{"id":"dsq-457709374","author":"Robert Knight","deleted":false,"createdAt":"2007-07-15T19:40:37Z","message":"<p>Hi Aurélien,</p><p>I have tried out, and I have a couple of comments.</p><p>- The 'save bar' is very small and I think a bit too subtle, perhaps make it a little taller and add a little more colour (either in the way of the background ).</p><p>- Gwenview doesn't appear to have any Undo functionality at the moment?  An easy way to revert changes would be appreciated.</p><p>A reduction in unwanted popups is definitely welcomed :)</p>","replies":[]},{"id":"dsq-457709376","author":"Diederik van der Boor","deleted":false,"createdAt":"2007-07-15T19:41:34Z","message":"<p>I really like this idea, especially the \"Save all\" in the last screenshot. Makes me feel really productive too.</p><p>I love to see a screenshot with classic buttons. The next/previous will become ugly that way though. Perhaps use a shorter \"\" instead? Even better, how about showing a list of modified images in a sidebar?</p><p>I think it's important to have some kind of fade or slide-in animation to show the status bar. This fits well with aseigo's \"Beautiful features\" presenation. I keep noticing user (even my tech-savvy collegues) don't see popup blocker bars. We're trained to see changes in appearance, most people won't notice such small differences in the UI.</p>","replies":[]},{"id":"dsq-457709377","author":"strohel","deleted":false,"createdAt":"2007-07-15T23:06:23Z","message":"<p>Looks really pretty, Aurelien.</p><p>Your love for Gwenview is amazing, looking forward for 2.0</p>","replies":[]},{"id":"dsq-457709379","author":"Shoosh","deleted":false,"createdAt":"2007-07-15T23:25:02Z","message":"<p>Nice idea, looking forward to it!</p>","replies":[]},{"id":"dsq-457709380","author":"zzx","deleted":false,"createdAt":"2007-07-16T00:00:16Z","message":"<p>Remember that what you are proposing has to be for all KDE applications as consistency is important in KDE.</p><p>I'd put in some 16x16 icons next to the save all, save, prev, next bar.</p><p>I'd also incorporate something like 'configure Autosaving'. If every KDE app could autosave (maybe append a timestamp at the end of the filename to deviate between their last saved copy if they dont want to just overwrite) it would be fantastic.</p>","replies":[]},{"id":"dsq-457709383","author":"Jakob Petsovits","deleted":false,"createdAt":"2007-07-16T00:20:24Z","message":"<p>Whatever the outcome of the new search functionality (it seems the save bar will be a good thing), please autosave lossless rotations in any case. They can easily be reverted, and are the most used editing functionality in an image viewer like Gwenview, so they should be most straightforward even if Gwenview can do more advanced stuff as well.</p><p>Given that I already like Gwenview 1.4 and a lot of usability improvements go into 2.0, I'm totally looking forward to having one definitive image viewer for KDE 4 that is both usable and speedy. Way to go!</p>","replies":[]},{"id":"dsq-457709386","author":"Aurélien","deleted":false,"createdAt":"2007-07-16T00:36:07Z","message":"<p>Thanks for all the nice feedback! It seems there is no clear winner in the choice between buttons and links. I will probably give buttons a try to see how they look.</p><p>I will also add some \"bling\" to make the save bar more visible, either slide-in or a background-color fade.</p><p>@bluestorm: I see what you mean, but on the other hand this icon is already used in the taskbar when a KDE application has unsaved changes, so it would be consistent to use it.</p><p>@vr: I will add the \"unsaved icon\" to the taskbar too, thanks for reminding me of this. However, I will probably keep the save bar at the top, since I believe it's more like an extra toolbar.</p><p>@Robert Knight: You are right, I should add undo/redo support, especially when cropping and scaling is in.</p>","replies":[]},{"id":"dsq-457709388","author":"Aurélien","deleted":false,"createdAt":"2007-07-16T00:47:04Z","message":"<p>@zzx: I agree consistency is important, but I am not sure a lot of applications are in Gwenview situation, half document editors, half file browsers. The icons are a good idea, will give it a try.</p><p>@Jakob Petsovits: This was what I previously planned, but I believe it would make the application less predictible as it would be too difficult to understand whether an image would be automatically saved or not. The only drawback of this solution for you will be to select \"Save All\" when you leave the application (which reminds me I should add \"Save All\" to the quit dialog)</p>","replies":[]},{"id":"dsq-457709390","author":"Cornelius Schumacher","deleted":false,"createdAt":"2007-07-16T02:58:10Z","message":"<p>I see where you are coming from and the save bar definitely is a smart idea. But from a point of a user is it really the solution? Why does the user have to care about saving at all?</p><p>It's true, if you do a lossfull operation you can't go back. But wait, if you store the original image or something clever like a diff or some extra data to algorithmically restore the original state, you can go back. It might be some effort to implement that and it might need some additional disk space, but it could relief the user from thinking about saving it all (and get rid of modal dialogs and stuff like that as well).</p><p>So what I as user would like to see is complete transparency of saving. If I modify an image it is stored as modified, but there is a way to get back to the original (maybe something like an \"Undo Bar\"?). This way I never get confused or annoyed by questions about saving, I never loose data and the program essentially behaves exactly as I want to. It does what it's told to do so, no questions asked.</p>","replies":[]},{"id":"dsq-457709391","author":"Shuksh","deleted":false,"createdAt":"2007-07-16T05:29:32Z","message":"<p>I really admire the design principles being implemented by KDE4 apps. To be honest, I found Gwenview's toolbars stacked on top of each other quite confusing - but the navigation tool bar with big icons and text looks so much simpler and more functional. It looks similar to Dolphin which is great - if more KDE apps are fine tuned for this simple design aspect, I'll give up Gnome once and for all. Sorry for being a little offtopic!</p>","replies":[]},{"id":"dsq-457709394","author":"jospoortvliet","deleted":false,"createdAt":"2007-07-16T13:57:46Z","message":"<p>I just tried it from SVN, and it works great. I must say, the link-like text works fine, buttons might make it too big. But it's up to you, of course.</p><p>Concerning what Cornelius just said (sorry to disagree, C, don't attack me next time we meet), I think saving lossy stuff automatically is just a bit too much. Maybe you can save automatically, but notify the user and show an undo button when he/she switches to the next pic? Or ask the usability ppl...</p><p>Saving the lossless things like rotating by default is imho a good thing. Maybe don't even notice the user. I don't see why it is bad, ppl generally don't get lossy vs lossless anyway - they don't care much. They think smoothen &amp; save &amp; sharpen brings back the original. Of course, you can do that instead of complicated save or undo stuff!</p>","replies":[]},{"id":"dsq-457709396","author":"Aurélien","deleted":false,"createdAt":"2007-07-16T16:01:13Z","message":"<p>@Cornelius: What you describe would be nice, but it's a bit too ambitious for my available amount of free time, sorry :-/</p><p>@jospoortvliet: I prefer keeping behavior consistent: if you go through all your images, fix orientations of some, adjust brightness on some others, I believe it's more predictible to have to save all images (the \"save all\" link makes this quick) rather than only a few images automatically saved.</p>","replies":[]},{"id":"dsq-457709398","author":"krill","deleted":false,"createdAt":"2007-07-17T10:47:19Z","message":"<p>like Bkuestorm I think  the \"unsaved flag\" (which is a good idea by the way) should be more visible. A red floppy with a question mark next to or on top of it should be more visible</p>","replies":[]},{"id":"dsq-457709399","author":"mark cox","deleted":false,"createdAt":"2007-07-24T03:57:59Z","message":"<p>Aurélien, <br>I like your mockups, i think it is a very interesting idea. Personally though, i would like to see a preferences checkbox 'Always save reversible changes' which would save lossless changes without asking the user. In that case your mocked-up save bar would only reflect 'lossy' changes.</p><p>Regards,<br>mark</p>","replies":[]},{"id":"dsq-457709400","author":"Linking Links","deleted":false,"createdAt":"2007-12-07T11:41:49Z","message":"<p>Neat idea! But like many other I would prefer a button personally rather than a link.</p>","replies":[]},{"id":"dsq-457709401","author":"Sadarax","deleted":false,"createdAt":"2008-12-28T14:26:03Z","message":"<p>I like the new system, but I would like to request the old option in the Gwenview configuration preferences for: \"Silently discard all changes\" be put back.</p><p>I realize that some changes cannot be undone, so perhaps when this \"Automatically discard all changes\" is enabled, the other permanent modification options are disabled?</p><p>I never save modifications from Gwenview to images. I always want whatever I do to the image to automatically be discard.</p><p>Thank you for your consideration. Gwenview 2 + looks great. I did not think the program could be improved but I was wrong. :)</p>","replies":[]}]
