[{"id":"dsq-457710482","author":"dhaumann","deleted":false,"createdAt":"2009-05-21T14:35:41Z","message":"<p>Reminds me of my trip to Glasgow where my luggage got lost in Heathrow. After a week I flew back and asked in Heathrow about my luggage. They said it right now was under way to Glasgow *by car*. By car? Now? I've told them that I'd only be there one week... It's really amazing how incompetent - in fact how incapable they handled this given that it's their job. I finally got it, two weeks later, wet and moldy inside.<br>Hope it's coming faster for you, but this really sucks ;) Have a great time anyway</p>","replies":[]},{"id":"dsq-457710486","author":"Poliander","deleted":false,"createdAt":"2009-05-21T15:42:43Z","message":"<p>Another blog post on Planet KDE without any relation to KDE at all.</p><p>(Sorry this is a rant, too)</p>","replies":[{"id":"dsq-457712111","author":"Aurélien","deleted":false,"createdAt":"2009-05-21T21:21:29Z","message":"<p>Hey, my roommate is Jonathan Riddell, does this make it a KDE-related post?</p>","replies":[]},{"id":"dsq-457710508","author":"anon","deleted":false,"createdAt":"2009-05-22T11:21:43Z","message":"<p>Oh no - that pushes it dangerously close to 3%!!</p>","replies":[]}]},{"id":"dsq-457710484","author":"Rikrd","deleted":false,"createdAt":"2009-05-21T15:44:09Z","message":"<p>Oh but wait, with all those necessary things you wouldn't even be able to enter the cabin.  \"For your security...\" of course.</p><p>\"For my security...\" I wasn't even to bring an artisanal cheese in the cabin, it was packed in vacuum, so I promise it wasn't the smell.</p><p>Anyway... welcome to Barcelona, and have a great time here.</p>","replies":[{"id":"dsq-457710498","author":"Chani","deleted":false,"createdAt":"2009-05-21T22:41:56Z","message":"<p>I never admit to bringing food in the cabin. so far they haven't asked.</p>","replies":[]}]},{"id":"dsq-457710481","author":"annma","deleted":false,"createdAt":"2009-05-21T16:25:00Z","message":"<p>You can find at Carrefour travel items and I always pack in my cabin luggage some basic stuff in a zip lock bag.</p><p>Well however you are in Barcelone so it does not look like you are so unlucky! The one and only time I was invited to a UDS summit my plane never took off because of a strike... Never was invited again, too bad as Barcelona is only a few kilometers from Toulouse.</p><p>I'd be happy to learn more about the future of Edubuntu which seems in jeopardy. For the sake of KDE-Edu, I hope you'll push it.</p><p>What exactly is your role within Canonical?</p><p>Have a nice time!</p>","replies":[{"id":"dsq-457710495","author":"Aurélien","deleted":false,"createdAt":"2009-05-21T21:24:12Z","message":"<p>Oh I remember you blogged about this disaster. I was so sorry for you... who knows what opportunity was missed with that :/. I guess I should be happy at least my body got delivered correctly :)</p><p>Will check these Carrefour travel items!</p><p>About my role within Canonical: I have been hired as a KDE developer, in the Desktop Experience (DX) team.</p>","replies":[]}]},{"id":"dsq-457710487","author":"Tomaz Canabrava","deleted":false,"createdAt":"2009-05-21T16:25:59Z","message":"<p>At least they didn't steal nothing from your luggage. <br>my last trip, somebody on the airplane stealed all my gifts.</p>","replies":[]},{"id":"dsq-457710488","author":"Andreas","deleted":false,"createdAt":"2009-05-21T16:59:27Z","message":"<p>I've heard that CDG is the worst European airport in terms of luggage loss - or was it actually a statistic? In any case it was pretty convincing. So everybody try to avoid this airport if possible :/</p>","replies":[{"id":"dsq-457710496","author":"Aurélien","deleted":false,"createdAt":"2009-05-21T21:25:16Z","message":"<p>One of my coworkers says the same and he says this is because CDG has a really good software system to handle lost luggages, so they try to use it as much as possible!</p>","replies":[]}]},{"id":"dsq-457710492","author":"loki99","deleted":false,"createdAt":"2009-05-21T18:24:29Z","message":"<p>Buy whatever you need and send the bills to Air France/Roissy Charles de Gaulle to get a refund.</p>","replies":[]},{"id":"dsq-457710491","author":"Enrico Ros","deleted":false,"createdAt":"2009-05-21T19:38:28Z","message":"<p>My god.. I know about the contact lenses pain!<br>This post will remind me that contact lens eyedrops are needed just as much as the toothbrush ;-)<br>BTW: be cool, everything will be all right, and you'll love Barcelona :D (I did!)</p>","replies":[]},{"id":"dsq-457710499","author":"samat.io (Samat K Jain)","deleted":false,"createdAt":"2009-05-21T23:48:37Z","message":"<p>It's said that the traveler's best friend is the credit card...</p><p>I'd personally pack less and avoid the hassle of lugging around extra weight and the risk of losing things. You can always buy inexpensive, consumable items (toothbrush, contact lens fluid, etc) at your destination.</p>","replies":[{"id":"dsq-457710503","author":"Aurélien","deleted":false,"createdAt":"2009-05-22T02:00:47Z","message":"<p>That makes lot of sense in most situation, but in this case we are located quite far away from any shop (It's 70€ to reach Barcelona by taxi if I am not mistaken), not to mention that I would miss interesting talks, so it wouldn't have been an option.</p>","replies":[]}]},{"id":"dsq-457710502","author":"Ian Monroe","deleted":false,"createdAt":"2009-05-22T00:11:20Z","message":"<p>The only reason to check luggage is for liquids (which sounds like is your case, so that sucks!). Otherwise you're a fool to trust the airline.</p>","replies":[]},{"id":"dsq-457710504","author":"Stephen","deleted":false,"createdAt":"2009-05-22T03:12:21Z","message":"<p>Pack some travel insurance next time.</p>","replies":[{"id":"dsq-457710509","author":"Mike","deleted":false,"createdAt":"2009-05-25T13:37:19Z","message":"<p>I really do not think that you need an insurance for that. At least for me the airline paid for lost package the one time it happened. And the other time my bag was delayed, they paid for the necessities. So my recommendation would be to go to town, buy everything needed and send them the bill, including the taxi one.</p>","replies":[]}]},{"id":"dsq-457710506","author":"Zeke Connor","deleted":false,"createdAt":"2009-05-22T07:19:50Z","message":"<p>I remember this problem when I came back from my flight in Toronto to Houston. Apparently when I made a stop in Charlotte, South Carolina. They mistakenly put it on the wrong plane and when I got back home I had to wait 2 days to get it. Lucky I get it all back in one piece. This was my first time air traveling &gt;.&lt;. It sucks, why can&amp;#039t airports do a better job at this?</p>","replies":[]}]
