[{"id":"dsq-457710527","author":"Harald","deleted":false,"createdAt":"2009-06-21T14:43:30Z","message":"<p>this functionality should really really be integrated into ksnapshot, imho.</p>","replies":[]},{"id":"dsq-457710528","author":"Milian Wolff","deleted":false,"createdAt":"2009-06-21T14:54:09Z","message":"<p>Please don't make drag'n'drop mandatory. A simple shortcut is much faster to use.</p>","replies":[]},{"id":"dsq-457710529","author":"Dread Knight","deleted":false,"createdAt":"2009-06-21T14:57:08Z","message":"<p>I was thinking about ksnapshot as well.<br>Other than that, sounds like an useful project.</p>","replies":[]},{"id":"dsq-457710530","author":"Nick","deleted":false,"createdAt":"2009-06-21T15:33:53Z","message":"<p>it would be cool if it generated SVG with png background, with notes on other layers. then it would be easy to add animation to it and so it could replace wink screencast generation tool (it is closed source and uses swf flash)</p>","replies":[]},{"id":"dsq-457710532","author":"Frank","deleted":false,"createdAt":"2009-06-21T15:38:58Z","message":"<p>Thanks, this looks great and certainly makes creating meaningful screenshots a lot easier!</p><p>But unlike the others, I think this should remain a separate program and not be integrated into KSnapshot which is intended to be a very simple program for just one purpose - take a screenshot and save it.</p>","replies":[]},{"id":"dsq-457710536","author":"pano","deleted":false,"createdAt":"2009-06-21T16:55:35Z","message":"<p>This could become a really great application imho.<br>I just tested it and it works quite good already, but of couse it still lacks some things here and there.</p>","replies":[]},{"id":"dsq-457710533","author":"Michael Rudolph","deleted":false,"createdAt":"2009-06-21T19:01:23Z","message":"<p>Hi Aurélien,</p><p>have you had a look at skitch?<br><a href=\"https://skitch.com/\" rel=\"nofollow noopener\" title=\"https://skitch.com/\">https://skitch.com/</a></p><p>They seem to be doing pretty much the same thing that you are trying to achieve. And they are doing it quite nicely. So you might want to have a look, if you haven't already.</p><p>Keep up the good work!</p><p>michael</p>","replies":[{"id":"dsq-457710538","author":"Aurélien","deleted":false,"createdAt":"2009-06-21T22:11:42Z","message":"<p>Yes, part of the idea of Annot8 comes from Skitch. Unfortunately, it's Mac OS X only.</p>","replies":[]}]},{"id":"dsq-457710539","author":"Seb Ruiz","deleted":false,"createdAt":"2009-06-22T02:55:22Z","message":"<p>As mentioned a few times before, this really should be integrated directly into ksnapshot to make this really really really useful.</p><p>It could become skitch for linux!</p>","replies":[]},{"id":"dsq-457710540","author":"Sam","deleted":false,"createdAt":"2009-06-22T20:23:48Z","message":"<p>It would be nice to have it hooked into kwin's left context menu where you could move windows to the left, right.</p><p>I also believe it should be integrated into ksnapshot.</p>","replies":[]},{"id":"dsq-457710544","author":"pano","deleted":false,"createdAt":"2009-06-23T01:17:43Z","message":"<p>I would rather see ksnapshot in annot8 and not the other way around ;-)<br>This simply means that, ksnapshot stays like it is, a nice, (powerful) standalone screenshot-taking application.<br>Annot8 on the other hand would be another separate app, with ksnapshots snapshot-taking features and its own annotation features.</p><p>What do you say?</p>","replies":[]},{"id":"dsq-457710545","author":"Dread Knight","deleted":false,"createdAt":"2009-06-23T09:33:02Z","message":"<p>Maybe ksnapshot should have a \"Send image to application...\" feature...</p>","replies":[{"id":"dsq-457710550","author":"Aurélien","deleted":false,"createdAt":"2009-06-23T18:18:12Z","message":"<p>As nick said, there is already such a feature in KSnapshot. It's a nice way to start Annot8 with your fresh screenshot for now.</p>","replies":[]}]},{"id":"dsq-457710548","author":"Nick","deleted":false,"createdAt":"2009-06-23T17:58:12Z","message":"<p>Dread Knight: it already has.</p>","replies":[]},{"id":"dsq-457710552","author":"Aurélien","deleted":false,"createdAt":"2009-06-23T18:22:43Z","message":"<p>Regarding integrating this into KSnapshot: I think KSnapshot should remain simple and not be turned into a more complex application.</p><p>If I decide to integrate more powerful screenshot options in Annot8 (grab window, with or without window decoration...) it would be interesting to share code with KSnapshot. For now I believe screenshoting should be kept simple in Annot8: it's probably easier to grab the whole screen or window, then crop it. This way the application keep the whole initial shot in memory, making it possible to adjust the crop rect later.</p>","replies":[]}]
