[{"id":"dsq-457712023","author":"Aleix","deleted":false,"createdAt":"2012-01-20T21:43:00Z","message":"<p>Hey Aurélien!<br>Why would you use Webkit/HTML if you can use QtQuick? :P</p>","replies":[{"id":"dsq-457712572","author":"Aurélien","deleted":false,"createdAt":"2012-01-20T22:27:04Z","message":"<p>It's an experiment, and a way to ensure I am not entirely clueless about where the web is going these days :)</p>","replies":[]}]},{"id":"dsq-457712017","author":"TheGhost","deleted":false,"createdAt":"2012-01-22T21:56:12Z","message":"<p>What do think of \"YoQ\" or \"YoQadi\" as possible name ?</p>","replies":[{"id":"dsq-457712020","author":"Aurélien","deleted":false,"createdAt":"2012-01-23T02:07:34Z","message":"<p>Thanks for the suggestion, but having two applications whose names only differ by the case of one character sounds a bit confusing too me.</p>","replies":[]}]},{"id":"dsq-457712021","author":"Matteo Nardi","deleted":false,"createdAt":"2012-01-23T15:41:40Z","message":"<p>Thank you for sharing this! I find it extremely interesting.<br>The advantages of using such a widely used technology are appealing:<br>- Almost non-existent entry level for new contributors<br>- There are a low of frameworks/tools/knowledge available<br>- It might make it easier to make a web (browser based) version of the application</p><p>I'd love to hear about the disadvantages and understand what can't be done using this approach..(eg. look&amp;feel differences, performance impacts etc.)  I'm looking forward to the next articles in the series.</p>","replies":[]},{"id":"dsq-457712015","author":"Alan","deleted":false,"createdAt":"2012-01-23T17:48:36Z","message":"<p>HTML forms absolutely SUCK for data entry as they depend almost exclusively on the mouse.<br>At the moment I've had to take a temping job which uses web-based forms and the inability to effectively use hot keys means I'm rapidly developing RSI from having to use a mouse so much - hence the rant.<br>If and when it becomes possible to create a decent HCI with the web which doesn't force mouse usage HTML is ONLY of use in a read-only environment.</p>","replies":[{"id":"dsq-457712570","author":"Aurélien","deleted":false,"createdAt":"2012-01-24T03:30:47Z","message":"<p>You can specify access keys for form fields, but browse support vary. I want to explore how this work with QtWebKit.</p>","replies":[]}]},{"id":"dsq-457712014","author":"skierpage","deleted":false,"createdAt":"2012-01-25T00:20:07Z","message":"<p>Just write entirely HTML5-based apps with local storage, let people try them from your web site, and package them using the Chrome/Mozilla/Opera/Yahoo widget systems (those are the four \"web app\" systems I know of)  so that people can also run them from their desktop, home page, or a dedicated browser tab. And make KDE's support for running such HTML-based apps the best of the lot.</p><p>@Alan, I can work most HTML forms entirely from the keyboard. Native apps... not so much, it's hit and miss.</p>","replies":[]}]
