[{"id":"dsq-457710344","author":"Jos","deleted":false,"createdAt":"2009-02-27T04:25:40Z","message":"<p>Congratulations Aurélien!<br>It is great to see Canonical investing in developers at this time. KDE developers, even.</p>","replies":[]},{"id":"dsq-457710342","author":"seele","deleted":false,"createdAt":"2009-02-27T04:45:54Z","message":"<p>Looking forward to you joining the Kubuntu family!</p>","replies":[]},{"id":"dsq-457710339","author":"jappel","deleted":false,"createdAt":"2009-02-27T04:45:58Z","message":"<p>yay, congrats!</p>","replies":[]},{"id":"dsq-457710341","author":"Jordi","deleted":false,"createdAt":"2009-02-27T08:06:38Z","message":"<p>I dont know the policy of Canonical about in-work development but it would be terrific that as an insider you can tell us what the work there is focusing on. <br>It seems that the days where Canonical was focusing almost exclusively in GNOME are over! Good for you! Congrats</p>","replies":[]},{"id":"dsq-457710337","author":"Andreas","deleted":false,"createdAt":"2009-02-27T09:54:14Z","message":"<p>I am happy for you and Kubuntu! Good luck with your new job.</p>","replies":[]},{"id":"dsq-457710345","author":"Daniel Holbach","deleted":false,"createdAt":"2009-02-27T10:26:40Z","message":"<p>Congratulations and welcome to the team soon! Hope to see you at UDS!  :-)</p>","replies":[]},{"id":"dsq-457710346","author":"Timothee","deleted":false,"createdAt":"2009-02-27T10:36:46Z","message":"<p>Congrats!</p>","replies":[]},{"id":"dsq-457710349","author":"Bugsbane","deleted":false,"createdAt":"2009-02-27T12:17:08Z","message":"<p>Go Aurélien!</p><p>This couldn't have happened to a more deserving coder. Thrilled to hear you'll be let loose on my desktop soon. :)</p><p>Bugsbane</p>","replies":[]},{"id":"dsq-457710352","author":"Alexis Menard","deleted":false,"createdAt":"2009-02-27T13:40:55Z","message":"<p>I am super happy for you...</p>","replies":[]},{"id":"dsq-457710353","author":"baxeico","deleted":false,"createdAt":"2009-02-27T14:57:13Z","message":"<p>Congratulations! I appreciated your work on Gwenview for KDE4 very much. I think you will be a very important \"add on\" to Kubuntu. :)</p><p>First request about notifications (you mentioned it, so I think it's permitted ;) ):<br>I don't know yet what is the direction Kubuntu want to take for notifications, so maybe this is already addressed: IMHO a great feature would be to give the user the option of enable actions on  notifications, based on the application (or groups of applications).<br>As someone already wrote (seele, aseigo), I feel very useful and intuitive to have a \"CHAT\" button in a Kopete notification, but on the other hand I think  that having un-obtrusive notifications for other apps (for example on file copy, move or delete), with no actions and \"fading out\" on mouse hover (as shown in Shuttleworth blog), should be another useful feature.</p><p>So, to summarize the request: let the \"actions on notification\" stuff be configurable for each application or group of applications.</p>","replies":[]},{"id":"dsq-457710357","author":"Anon","deleted":false,"createdAt":"2009-02-27T14:59:05Z","message":"<p>They've made a great choice :) Hope you have a good time there and help to deliver on Mark's promise of making Kubuntu a \"first-class distro\"!</p>","replies":[]},{"id":"dsq-457710361","author":"Werner Joss","deleted":false,"createdAt":"2009-02-27T16:05:13Z","message":"<p>Hello Aurélien,<br>I'm very happy to read that - I hope you will have a good time at Canonical.<br>It is also good to read they hired one more KDE developer :)<br>btw. you might not remember, we met at Linuxtag 2004 in Karlsruhe at the kde booth.</p>","replies":[]},{"id":"dsq-457710362","author":"Seren","deleted":false,"createdAt":"2009-02-27T16:56:39Z","message":"<p>As a Kubuntu user, I appreciate the move from Canonical to hire more KDE Developer(s).</p><p>On a more personnal level, good luck !</p>","replies":[]},{"id":"dsq-457710363","author":"Nicolas Ternisien","deleted":false,"createdAt":"2009-02-27T17:40:56Z","message":"<p>That's a really good news, congratulations!</p><p>KDE needs a full-time developer like you (and what you made in Gwenview) to improve its \"Desktop Experience\"</p>","replies":[]},{"id":"dsq-457710367","author":"A","deleted":false,"createdAt":"2009-02-27T18:18:55Z","message":"<p>Congratulations with your new job and thanks for Gwenview (it rocks)!  I don't know if it is Kubuntu-specific or not, but the notifications in KDE 4.2 in Kubuntu Intrepid disappear too fast.  One day I was playing around with the desktop cube and suddenly a notification appeared stating that desktop effects in KWin were temporarily disabled because the load was too heavy and that I could enable them again by ... doing something I could not read because the notification was already gone (I could not find another way of reenabling desktop effects than kwin --replace, for some reason checking the appropriate checkbox in the systemsettings did not work at that moment).  There is only one solution (in my opinion) for the problem of too fast disappearing notifications and that is a button which allows you to open old notifications.  This would show for example the last 5 notifications and a \"History\" button which allows you to see older notifications and a \"Clear history\" button which allows you to clear the notification history.</p>","replies":[]},{"id":"dsq-457710371","author":"Aurélien","deleted":false,"createdAt":"2009-02-27T19:49:08Z","message":"<p>Thank you all for the kind words!</p><p>@Werner Joss: If I am not mistaken, we talked about Quanta and external tools, is it correct? If it is, then I remember you :)</p>","replies":[]},{"id":"dsq-457710370","author":"Temet","deleted":false,"createdAt":"2009-02-27T20:07:53Z","message":"<p>Hum, I think you're a very good dev (and I may have talked to you... were you at \"linux solutions\" in Paris last year?) ... but I really dislike what Ubuntu does with KDE (worst KDE experience ever).</p><p>I hope you will be able to change that in a good way! ;)</p>","replies":[]},{"id":"dsq-457710372","author":"Aurélien","deleted":false,"createdAt":"2009-02-27T22:16:47Z","message":"<p>@Temet: yes, I was at \"linux solutions\" last year, so we probably talked :)</p><p>Until now KUbuntu has been almost entirely a community-powered project. I think they do their best but are suffering from lack of manpower. You just need to spend a few hours on #kubuntu-devel to appreciate the dedication level of the community.<br>The fact that Canonical is now hiring Qt/KDE devs (note the 's'...) is probably a sign that things are going to improve.</p>","replies":[]},{"id":"dsq-457710373","author":"Anon","deleted":false,"createdAt":"2009-02-27T22:40:23Z","message":"<p>\"The fact that Canonical is now hiring Qt/KDE devs (note the ’s’…) is probably a sign that things are going to improve.\"</p><p>Any hints as to who your and Jonathan's new colleague will be? :)</p>","replies":[]},{"id":"dsq-457710374","author":"Lure","deleted":false,"createdAt":"2009-02-28T00:45:14Z","message":"<p>This is great news for Kubuntu and also Canonical as they get great developer on their board!</p><p>As Kubuntu developer I am glad to see more KDE developers on Canonical's payroll.</p>","replies":[]},{"id":"dsq-457710375","author":"Smarter","deleted":false,"createdAt":"2009-02-28T03:23:07Z","message":"<p>Welcome in the team! ;)<br>(Also, cool! didn't know they planed to hire other KDE devs :))</p>","replies":[]},{"id":"dsq-457710381","author":"Kåre","deleted":false,"createdAt":"2009-03-03T11:01:04Z","message":"<p>Congratulations Aurélien!</p>","replies":[]},{"id":"dsq-457710386","author":"emonkey","deleted":false,"createdAt":"2009-03-04T13:28:50Z","message":"<p>Sounds very nice and I'm very happy to see that the KDE part in Canonical is growing. Congratulation to your new job and the possibility to work on KDE on your daily job.</p>","replies":[]},{"id":"dsq-457710384","author":"MacSlow","deleted":false,"createdAt":"2009-03-04T18:23:22Z","message":"<p>Hey Aurelien!</p><p>Welcome aboard! Will you already come with us to CapeTown?</p><p>Best regards ...</p><p>Mirco \"MacSlow\" Müller</p>","replies":[]},{"id":"dsq-457710383","author":"Aurélien","deleted":false,"createdAt":"2009-03-04T20:04:23Z","message":"<p>@MacSlow: Unfortunately my current job ends on the 11th of march, so I won't be able to make it to CapeTown.</p>","replies":[]},{"id":"dsq-457710385","author":"watch","deleted":false,"createdAt":"2009-03-05T08:29:36Z","message":"<p>I really appreciate the fact that Canonical is investing in Kubuntu, good move.</p>","replies":[]},{"id":"dsq-457710378","author":"Alexandra","deleted":false,"createdAt":"2009-03-05T14:47:45Z","message":"<p>Congratulations! Good news. :)<br>I hope the job will be as fun as it sounds!</p>","replies":[]},{"id":"dsq-457710387","author":"lee","deleted":false,"createdAt":"2009-04-03T05:38:54Z","message":"<p>congratz on ur new job. ur excitement really comes thru!</p><p>\"there's something about new experiences.. they awaken the sleeper within us. the sleeper must awaken.\" - frank herbert</p>","replies":[]}]