[{"id":"dsq-457710106","author":"lsakd","deleted":false,"createdAt":"2008-12-04T01:39:29Z","message":"<p><a href=\"http://vimeo.com/2415987\" rel=\"nofollow noopener\" title=\"http://vimeo.com/2415987\">http://vimeo.com/2415987</a><br>for the online video</p>","replies":[]},{"id":"dsq-457710107","author":"Elias P.","deleted":false,"createdAt":"2008-12-04T01:59:46Z","message":"<p>A really nice addition to Gwenview, thx a lot!<br>What about making it possible to drag'n'drop the tags from the tag editor to images? This would make it even more usable.</p><p>Regards, Elias P.</p>","replies":[]},{"id":"dsq-457710109","author":"Kron","deleted":false,"createdAt":"2008-12-04T02:26:06Z","message":"<p>Are tags shared with digikam?</p>","replies":[]},{"id":"dsq-457710110","author":"jmu","deleted":false,"createdAt":"2008-12-04T02:47:02Z","message":"<p>And same goes for rating - are those shared with the digikam and/or with dolphin as well?</p><p>Anyway, good stuff. Me likes.</p>","replies":[]},{"id":"dsq-457710111","author":"Aurélien","deleted":false,"createdAt":"2008-12-04T02:53:39Z","message":"<p>@Elias: Actually I am not completely satisfied with the current tag dialog. It may change in KDE 4.3.</p><p>@Kron, jmu: No, tags and ratings are not shared with Digikam. But since they are stored using Nepomuk, they are shared with Dolphin and any other application which supports Nepomuk.</p>","replies":[]},{"id":"dsq-457710112","author":"Joel Mandell","deleted":false,"createdAt":"2008-12-04T03:07:37Z","message":"<p>Yeaaah! Finally!!! What can I say..someone utilizes nepomuk more! Thats awesome. Good job :)</p>","replies":[]},{"id":"dsq-457710113","author":"joao pinto","deleted":false,"createdAt":"2008-12-04T05:34:46Z","message":"<p>Isn't Digikam going to use nepomuk too? Thank you for these features and for the screencast!</p>","replies":[]},{"id":"dsq-457710114","author":"Rafael Fernández López","deleted":false,"createdAt":"2008-12-04T05:56:06Z","message":"<p>Great stuff !!! I am really happy to see that Nepomuk is getting into everyday apps !! =)</p><p>The filtering, and the tagging in general (specially with the bucket icon) is really amazingly powerful, really great job Aurélien.</p>","replies":[]},{"id":"dsq-457710115","author":"Parker","deleted":false,"createdAt":"2008-12-04T06:10:02Z","message":"<p>Excellent screencast. It was a very clear and well paced. I will admit that your voice did make me rather sleepy.</p><p>Also, great work with the tag integration in Gwenview.</p>","replies":[]},{"id":"dsq-457710118","author":"Sergio Pistone","deleted":false,"createdAt":"2008-12-04T07:16:50Z","message":"<p>Nice to see Nepomuk being integrated into more apps. Also nice to see is how much Gwenview has improved in KDE4. Thanks for the work you've put into it.<br>I'd like to point out the one thing I found kind of annoying about it, hopefully you'll think of it as constructive criticism. My issue is with the loading of thumbnails: the current algorithm seems to be too conservative as it only loads the thumbnails when they are shown. This optimization, which would generally seem like a good idea, in practice makes quite hard to browse through the images in a directory. For example, when viewing the images in full screen mode, it's not possible to use the scrollbar in the thumbnails bar to quickly search for an image because the thumbnails will not be loaded unless you stop for some time to see them, and then only those currently being shown would be loaded, so if you move the scrollbar to see other (not yet loaded) images you have to wait again. I think it would be best if thumbnails were loaded in the background, regardless of whether they are shown or not, so they are already available when you need them.<br>Anyway, I hope you don't take this negatively. Regardless of this little issue, this is one of the little gems in KDE4.</p>","replies":[]},{"id":"dsq-457710104","author":"Linus Berglund","deleted":false,"createdAt":"2008-12-04T14:01:52Z","message":"<p>Thanks. Thanks. Thanks. This is a killer feature.</p>","replies":[]},{"id":"dsq-457710102","author":"peter","deleted":false,"createdAt":"2008-12-04T14:24:58Z","message":"<p>\"I think it would be best if thumbnails were loaded in the background, regardless of whether they are shown or not, so they are already available when you need them.\"</p><p>I totally agree and hope that gwenview will add this option in.</p>","replies":[]},{"id":"dsq-457710103","author":"Dread Knight","deleted":false,"createdAt":"2008-12-05T00:43:49Z","message":"<p>Very nice!</p><p>But the filter atm is rather 'geekish'. Use Picasa for a while and see how they do things.</p><p>It would be nice a time-slider, the idea would be to make things more visually and interactive. If you need vector graphics or mock-ups for it i might be able to help out : )</p><p>Cheers!</p>","replies":[]},{"id":"dsq-457710101","author":"Aurélien","deleted":false,"createdAt":"2008-12-05T14:04:34Z","message":"<p>@Sergio Pistone, peter: generating thumbnails for all images is quite intensive and would not scale well when browsing huge photo lists.<br>Nevertheless, I can probably make Gwenview generate thumbnails for images which are not \"far away\" from the visible ones, so that you do not have to wait as often. (adding to my todo list)</p><p>@Dread Knight: Indeed, the date filter can use some work, it's quite recent. mock-ups are always welcome!</p>","replies":[]},{"id":"dsq-457710119","author":"Nosk","deleted":false,"createdAt":"2008-12-15T23:48:44Z","message":"<p>&gt;joao pinto<br>&gt;Isn’t Digikam going to use nepomuk too? Thank</p><p>It's planned for Digikam 0.11<br><a href=\"http://www.digikam.org/drupal/node/381#comment-17927\" rel=\"nofollow noopener\" title=\"http://www.digikam.org/drupal/node/381#comment-17927\">http://www.digikam.org/drup...</a></p>","replies":[]},{"id":"dsq-457710121","author":"Mehe","deleted":false,"createdAt":"2009-01-23T16:06:25Z","message":"<p>Filters are really the best feature to have besides the very basic features of an image viewer (display images in list and full screen)!</p><p>But I agree with Dread Knight, picasa-style time selection sliders would be more useful for most non-powerusers.</p><p>Also nice would be some more easy-to-use search function. The current one isn't quite visual / flexible enough. Something like firefox-style highlighting of search terms in files / tags, and a search term &amp; criteria selection popup bar (like in \"/\" - searches in firefox), coupled with actually only displaying the matching files / folders in the main screen would be great.</p><p>However, the current form of presenting the filters is bound to be extremely useful as well, if you could manage to include OR-logic besides the current AND one, and perhaps grouping...</p><p>Well, these suggestions are all I have... Looking forward to where this is going, either way!</p>","replies":[]},{"id":"dsq-457710124","author":"","deleted":true,"createdAt":"2009-12-07T01:00:31Z","message":"","replies":[{"id":"dsq-457710125","author":"Aurélien","deleted":false,"createdAt":"2009-12-07T01:35:51Z","message":"<p>Hi, Nepomuk uses Soprano, which itself can use multiple backends. You may need to install the Sesame backend, which works much better than the Redland backend (on Kubuntu, package name is soprano-backend-sesame).</p>","replies":[]}]},{"id":"dsq-457710126","author":"","deleted":true,"createdAt":"2009-12-08T01:36:20Z","message":"","replies":[{"id":"dsq-457710128","author":"Aurélien","deleted":false,"createdAt":"2009-12-08T20:14:43Z","message":"<p>Yes:<br>- open systemsettings<br>- go to \"Advanced\" tab<br>- open \"Desktop search\"<br>- check the \"Enable Nepomuk Semantic Desktop\" box<br>- click \"Apply\"</p><p>Should work better hopefully.</p>","replies":[{"id":"dsq-457710129","author":"","deleted":true,"createdAt":"2009-12-08T23:19:42Z","message":"","replies":[]}]}]}]
