[{"id":"dsq-457709787","author":"boom1992","deleted":false,"createdAt":"2008-03-29T20:17:04Z","message":"<p>Looks really cool, what about making the current picture in fullscreen mode a bit bigger and then nice fade in/out effects when switching (like in macosx taskbar?)</p><p>Lukas</p>","replies":[]},{"id":"dsq-457709789","author":"Jonas","deleted":false,"createdAt":"2008-03-29T20:36:38Z","message":"<p>Very nice! Look forward to trying that out!</p><p>Oh, and a question while I'm here. I don't know if I've missed something but is it possible to get the main window to expand or shrink depending on the size of the picture?</p><p>Let me explain in more detail. Let's say I start Gwenview by clickling on a picture in Dolphin. The directory in question contain pictures of different sizes.</p><p>The first fits perfectly in the window (this is with Gwenview in view-mode with just the menubar and the toolbar, and zoom to fit enabled). I hit the next button, and if the image is smaller I get gray borders around the image. It would be great if the window itself shrunk when that happens, and then expands again when a bigger picture is displayed.</p>","replies":[]},{"id":"dsq-457709775","author":"David Johnson","deleted":false,"createdAt":"2008-03-29T21:01:35Z","message":"<p>The expanding button looks like a tab, which can be confusing. In addition, changing an icon in the top toolbar to a button in the bottom toolbar/statusbar doesn't simplify the UI at all. I think it would be better just to have a toggle toolbutton for this in the toolbar.</p>","replies":[]},{"id":"dsq-457709776","author":"Robin","deleted":false,"createdAt":"2008-03-29T21:09:24Z","message":"<p>Wow, looks good :). But the icons in the fullscreen view somehow look out of place.</p>","replies":[]},{"id":"dsq-457709782","author":"AC","deleted":false,"createdAt":"2008-03-29T22:18:49Z","message":"<p>Very nice, but I think it would be nice if the picture names were also shown on the thumbnail bar (as they many times contain useful information).</p>","replies":[]},{"id":"dsq-457709783","author":"Nuno Pinheiro","deleted":false,"createdAt":"2008-03-29T22:45:02Z","message":"<p>Nice work on the full screen mode congrats</p>","replies":[]},{"id":"dsq-457709784","author":"BeCe","deleted":false,"createdAt":"2008-03-29T23:21:02Z","message":"<p>+1 for David Johnson.</p>","replies":[]},{"id":"dsq-457709785","author":"Leo S","deleted":false,"createdAt":"2008-03-29T23:24:42Z","message":"<p>Looks great!  Gwenview rocks.</p><p>Just one minor niggle about the fullscreen view.  The thumbnails looks great, but the left side of the bar looks a little cluttered.  After all one of the reasons for a fullscreen is to concentrate on the picture and remove other UI clutter.</p><p>Some ideas to simplify:<br>- Remove the extension from the image name.  It is not important to know whether the current picture is a jpg or png in fullscreen mode.<br>- Remove either the time or both the time and date.  Right now at a glance it just looks like a string of random numbers which adds clutter.  Fullscreen mode if for viewing pictures, not for detailed analysis.  This information could be put into a tooltip instead as a compromise.<br>- I don't know what the wrench icon does, but I assume some sort of settings.  Without knowing what's in those settings I won't complain, but perhaps the fullscreen mode shouldn't need dedicated settings.  Or at least not an icon for them.<br>- The combo box for time delay is not needed.  Either that can be adjusted in the settings (from the wrench icon if you want to keep it), or it can be adjusted in the global gwenview settings.  It definitely doesn't need to be constantly visible.</p><p>Fullscreen view is not another application, it should be a very simple view.</p><p>These are just well-meaning suggestions though.  This work already looks fantastic.  Thank you!</p>","replies":[]},{"id":"dsq-457709766","author":"Leo S","deleted":false,"createdAt":"2008-03-29T23:38:21Z","message":"<p>Here's a very rough mockup for how I think might improve it.</p><p><a href=\"http://simplysensibleconsulting.ca/gwenview_mockup.jpeg\" rel=\"nofollow noopener\" title=\"http://simplysensibleconsulting.ca/gwenview_mockup.jpeg\">http://simplysensibleconsul...</a></p><p>The icons should be centered vertically to look better, but that surpasses my kolourpaint skills :)</p>","replies":[]},{"id":"dsq-457709767","author":"Markus Mauder","deleted":false,"createdAt":"2008-03-30T00:19:23Z","message":"<p>Looks great!</p><p>I agree with Leo S about the fullscreen view though: the number of widget on the left side makes the UI look cluttered.<br>Before I saw Leo's I created my own mockup:<br><a href=\"http://pics.roffnoppe.de/gwenview-fullscreen-mockup-1_0.png\" rel=\"nofollow noopener\" title=\"http://pics.roffnoppe.de/gwenview-fullscreen-mockup-1_0.png\">http://pics.roffnoppe.de/gw...</a></p><p>The ideas were pretty similar, but the result is surprisingly different:<br>I did away with the image name completely. The idea being that the fullscreen view should focus on the picture in a leisurely viewing kind of way.<br>Assuming that the wrench icon lets one specify more details about the slide show, I de-emphasized it by enlarging the slide show button. Also in my mockup the time combo box is gone (moved into the wrench menu) because it's not a frequent action (I might be wrong about this).</p><p>Where my mockup goes further though is by placing the next and previous buttons outside of the toolbar. I don't know if it is a toolbar (technically speaking) and how hard it would be to put the buttons into this custom position. Their new positions should spacially communicate their function.</p><p>Hope this helps. This is not to be understood as a proposal, more as food for thought. Leo makes some excellent point and really, we are just nitpicking.</p><p>Thanks a lot for gwenview,<br>- Markus</p>","replies":[]},{"id":"dsq-457709773","author":"Leo S","deleted":false,"createdAt":"2008-03-30T02:27:13Z","message":"<p>Nice one Markus.  Making it symmetrical adds a lot to the aesthetic.  I like the buttons on the side too.  The only question is, if it is a wide picture that goes to the screen edge, where do the buttons go?  Perhaps they can just fade in when you get close to the screen edge.  <br>But perhaps I'm getting ridiculous now :)</p>","replies":[]},{"id":"dsq-457709772","author":"metellius","deleted":false,"createdAt":"2008-03-30T02:52:38Z","message":"<p>Regarding the UI placement selection in fullscreen mode: One could also just provide a few checkboxes in the settings that hide/show the widgets according to the users request. Or, who knows, maybe that's overcomplicating things again.</p><p>Just my 2.42 cents.</p>","replies":[]},{"id":"dsq-457709757","author":"Aurélien","deleted":false,"createdAt":"2008-03-30T02:54:56Z","message":"<p>Thanks for all this feedback, especially to Leo and Markus!</p><p>I like the idea of centering the caption text. Will probably do so.</p><p>About the displayed text: I should have told you about  a new entry in the wrench button menu, which shows a dialog to let you choose which information should be displayed in the bar. I am thinking about setting the default to only show the shooting date.</p><p>I like the idea of using a smaller icon for the wrench button, as it won't be used as often as the others. I want to keep it there, though: one of my design idea for Gwenview is to provide users with configuration options in their context rather than in a separate configuration dialog. At least whenever it makes sense.<br>Right now this configuration menu let you configure the few slideshow options (loop and random) from within fullscreen mode. I think it's much more convenient than having to leave fullscreen mode to open the application configuration dialog.<br>Something needs to be done for the slideshow timing though. I will probably replace it with a slider. Should look much better, but I need to think about a place to place it.</p><p>@Markus: your mockup is interesting. As I said I keep the idea of a smaller wrench icon. I am afraid about two things though:<br>- All those interface panes will come up from the borders as you move the mouse, this is going to be quite invading.<br>- Position of the previous and next buttons makes it difficult to move back and forth as you have to travel the whole screen to go from one button to the other.</p>","replies":[]},{"id":"dsq-457709758","author":"tim","deleted":false,"createdAt":"2008-03-30T08:04:43Z","message":"<p>This looks interesting. Will there be a version for GNOME? I'm looking<br>for an alternative for gthumb.</p>","replies":[]},{"id":"dsq-457709760","author":"Ian Monroe","deleted":false,"createdAt":"2008-03-30T11:28:04Z","message":"<p>Totally snazzy. :)</p>","replies":[]},{"id":"dsq-457709761","author":"tux","deleted":false,"createdAt":"2008-03-30T14:19:59Z","message":"<p>I simply love this BEAUTIFUL piece of software!</p><p>One remark: what about getting rid of the vertical dividing lines between the pictures in the thumbnail bar? they don't seem to have any use! Without the lines the thumbnail bar would look even more simple!</p>","replies":[]},{"id":"dsq-457709762","author":"Psychotron","deleted":false,"createdAt":"2008-03-30T19:46:05Z","message":"<p>Uuh, cool! Especially I like the fullscreen one. How about a mouse over fisheye effect (like OS X dock for instance)?</p><p>Greets Michael</p>","replies":[]},{"id":"dsq-457709763","author":"TheBlackCat","deleted":false,"createdAt":"2008-03-30T21:48:11Z","message":"<p>Excellent work.  I was never really happy with the preview mode.  I obviously have not tried it, but this replacement looks nearly ideal to me.</p><p>Two questions, is there (or will there be) an option to place the bar on the side?  Having it on the bottom is good for normal monitors, but having it on the side is much better for wide-screen monitors.</p><p>Second, is there or will there be an option resize the thumbnails?  The one benefit I can see of the preview panel is that it has its own size slider for quickly and easily resizing the previews.  I don't see that here.  On the other hand, if you are able to drag the edge of the thumbnail bar to resize it, and have all thumbnails all grow or shrink accordingly, that would be easier still.  However it is not obvious from the picture whether that is possible or not.  In Gwenview and Dolphin, and probably other programs as well, there is a thin but distinctive bar with dots where resizing is possible.  I don't see that.</p><p>@ David: I actually like the placement of the button.  Three reasons.  First, it is not a view, but a bar.  I think it is useful to keep them separate.  Second, the button is closer to where the bar will appear, which I think is probably better ergonomics.  Third, it is possible (if not likely) that other bars may appear later.  For instance I know that some people want PhotoFlow implemented in Gwenview, and if that ever happens (a big if, I know) it could be placed as a button next to the thumbnail button.  Still other views could be implemented in the same manner.</p><p>@ Tim:  As long as you have KDE 4 libraries and necessary kparts are installed, it is my understanding you should be able to use the apps in Gnome.  I sincerely doubt that a version that is independent of KDE libs is forthcoming, since I am pretty sure Gwenview depends very heavily on KDE 4.</p>","replies":[]},{"id":"dsq-457709754","author":"Markus Mauder","deleted":false,"createdAt":"2008-03-30T22:27:53Z","message":"<p>Hi Aurélien!</p><p>I just built gwenview to see how the fullscreen view feels. I must say, I am pretty amazed! It feels very natural and fun to use.</p><p>&gt; I am thinking about setting the default to only show the shooting date.<br>Only the date is a good idea. I tried date and time (there is not \"date only\" option afaict) and that makes a difference.</p><p>&gt; one of my design idea for Gwenview is to provide users with configuration options in their context rather than in a separate configuration dialog.<br>That's a very good idea. I for one don't mind the settings button too much, so long as it is not given the same importance as the slide show button.</p><p>&gt; Something needs to be done for the slideshow timing though. I will probably replace it with a slider. Should look much better, but I need to think about a place to place it.<br>If you insist that it is a frequent enough action to warrant a user interface element on the toolbar a slider may be the way to go. I tried putting it in the same menu bar as the settings button and that didn't look too out of place. That was with the navigation elements inside a different toolbar though.</p><p>&gt; - All those interface panes will come up from the borders as you move the mouse, this is going to be quite invading.<br>Yup, I tried it now and I agree. Maybe fading would be less invading, but the proper solution is probably to move the next/previous buttons somewhere else.<br>I still don't like them up there with the rest of the interface. I can't put my finger on it, but I think it has something to do with the fact that I expect to click on them a lot more often than the others.</p><p>&gt; - Position of the previous and next buttons makes it difficult to move back and forth as you have to travel the whole screen to go from one button to the other. <br>I thought of this, but decided to put them there anyway, because I was hoping the next -&gt; prev -&gt; next order of steps would be infrequent. Of course it happens and it is annoying to have to move 1600 pixels to get there. So lets leave them next to each other.</p><p>I tried a few ideas, but couldn't come up with a way to add another bar to the bottom of the screen. Patch at <a href=\"http://files.roffnoppe.de/gwenview/gwenview-fullscreen-extra-toolbar.patch\" rel=\"nofollow noopener\" title=\"http://files.roffnoppe.de/gwenview/gwenview-fullscreen-extra-toolbar.patch\">http://files.roffnoppe.de/g...</a>, but the changes are really rather trivial (screenshot at <a href=\"http://pics.roffnoppe.de/gwenview/gwenview-fullscreen-extra-toolbar.png)\" rel=\"nofollow noopener\" title=\"http://pics.roffnoppe.de/gwenview/gwenview-fullscreen-extra-toolbar.png)\">http://pics.roffnoppe.de/gw...</a>.</p><p>To address your points (and mine) maybe the following ideas might work:<br>- separate navigation from settings / mode switching by creating a new bar at the bottom of the screen.<br>This was the part that failed. I added the new toolbar to a new row in the grid layout so I could get a better idea of how it would feel. Takes away a lot of space obviously, but helps with the crowdedness. An extra slider taking up space in the main toolbar might make it worth while though.<br>- avoid having to move the mouse too far by putting the prev/next buttons next to each other.<br>If a second toolbar would be ok with you I would put them on there together with the thumbnail bar.<br>- Larger play button, small configure button and interval slider next to it.<br>We talked about the configure button. If moving it to the configure menu is out of the question, the interval widget might fit here.<br>- separation of slide show and fullscreen related actions by moving fullscreen to the other side of the screen.<br>The right side of the screen also happens to be where the close button is in the default setup. Just something that occured to me, maybe it helps usability.</p><p>I am not sure about the extra toolbar, which became a quite integral part of this new concept. Cherry-pick the improvments you like, please :)</p><p>- Markus</p>","replies":[]},{"id":"dsq-457709791","author":"Mciahł Pilch (8siem)","deleted":false,"createdAt":"2008-06-15T16:08:00Z","message":"<p>Preview mode was much better :/<br>Now when I want to change directory I have to turn to 'Browse mode\" change directory and turn back \"View mode\". This is terrible. Please make sth to easy change directories in this mode maybe a litle file tree beside the thumbnails or folder thumbnails.</p>","replies":[]},{"id":"dsq-457709792","author":"Aurélien","deleted":false,"createdAt":"2008-06-15T17:54:43Z","message":"<p>@Mciahł Pilch: To switch to \"browse mode\", press \"Escape\", to switch back to \"view mode\", press \"Enter\" when you are on the wanted image.</p>","replies":[]}]
