[{"id":"dsq-457709578","author":"Pellaeon","deleted":false,"createdAt":"2007-12-24T18:45:17Z","message":"<p>It's nice stuff, although you broke the gradient background on the scrollable parts when using the Oxygen style engine.</p>","replies":[]},{"id":"dsq-457709577","author":"Ivo","deleted":false,"createdAt":"2007-12-24T19:07:26Z","message":"<p>That's much better, thanks :)</p>","replies":[]},{"id":"dsq-457709573","author":"Aurélien","deleted":false,"createdAt":"2007-12-24T19:43:09Z","message":"<p>@Pellaeon: I do not understand what you mean. Which part of the background is broken?</p>","replies":[]},{"id":"dsq-457709574","author":"Chani","deleted":false,"createdAt":"2007-12-24T19:58:51Z","message":"<p>thank you, thank you, thank you. :)</p><p>now if only I could open the proxy settings from System Settings after having opened and closed it in konq... it seems konq doesn't really close it, or at least makes system settings think that it's still in use. I guess that's what b.k.o is for ;)</p>","replies":[]},{"id":"dsq-457709576","author":"Aurélien","deleted":false,"createdAt":"2007-12-24T20:03:12Z","message":"<p>@chani: My guess is that Konq does not delete its setting dialog. If you open the dialog, go to some page, close it and open it again, you will notice the dialog opens on the page which was current when you closed it.</p>","replies":[]},{"id":"dsq-457709567","author":"Alex","deleted":false,"createdAt":"2007-12-24T20:19:07Z","message":"<p>Looks good!<br>But I also noticed that there were too many grid lines in KDE4 dialogs. If removing those  lines, I think they will have  clean vision.</p>","replies":[]},{"id":"dsq-457709568","author":"Fri13","deleted":false,"createdAt":"2007-12-24T20:37:01Z","message":"<p>That scrollbar is good and bad (earlier version), bad thing was that user needed to scroll to see Cancel, Apply and OK. Good thing was user could get those buttons even with 1280x800 resolution screen what is pretty typical on laptops. Because that konqueror config panel is too big (height) to fit that size screen so it pushed space down but keeped window itself as it was and you needed only scroll down.</p><p>Yes, typical TFT screen size is 1280x1024 and bigger onces are coming but laptops has 1440x900, 1280x800 or even 1024x768 and for those screen sized, konqueror settings panel is just too big and would need much rework. At least java&amp;javascript and plugins settings what automatically resize config window over screern size.</p>","replies":[]},{"id":"dsq-457709569","author":"eliasp","deleted":false,"createdAt":"2007-12-25T00:44:45Z","message":"<p>Hi,<br>nice to see, there's some work put into this dialog. A thing that bugged me a long time in Konqueror, is the missing proxy profiles support, e.g. 'Home', 'Office', 'Customer A', 'Customer B' + a way to switch them in a fast comfortable way.</p><p>Any chance having this one day in Konqueror?</p><p>Thank you &amp; Regards,</p><p>Elias P.</p>","replies":[]},{"id":"dsq-457709571","author":"kwilliam","deleted":false,"createdAt":"2007-12-25T03:29:33Z","message":"<p>Excellent work!  Now if only the modules would resize decently, so one doesn't get the unnecessary horizontal scrollbars...</p>","replies":[]},{"id":"dsq-457709565","author":"Aurélien","deleted":false,"createdAt":"2007-12-26T03:05:47Z","message":"<p>@eliasp: I don't know about proxy profiles support: I am not a Konqueror developer, I am just tweaking the user interface to make it friendlier.</p>","replies":[]},{"id":"dsq-457709566","author":"Chani","deleted":false,"createdAt":"2007-12-26T09:09:53Z","message":"<p>eliasp: proxies are a kde-wide thing, not just for konqueror :) and someone was planning a rewrite of certain proxy things for 4.1 - so you *might* get proxy profiles then. I'm not sure.</p>","replies":[]},{"id":"dsq-457709563","author":"kwilliam","deleted":false,"createdAt":"2007-12-26T21:11:42Z","message":"<p>Awesome!!!  I love the new look for Search.  (Although it doesn't show if there is any any hits in Advanced... perhaps Advanced and General could be on the same page when doing search?)  And you've gotten rid of many of the evil horizontal scrollbars!  The Appearance settings, for instance, is completely fixed.  Way to go!  I may actually like System Settings after all!  :-)</p>","replies":[]},{"id":"dsq-457709564","author":"Aurélien Gâteau","deleted":false,"createdAt":"2007-12-27T05:56:15Z","message":"<p>@kwilliam: actually, the new search is not from me. It's Will Stephenson work. cf <a href=\"http://www.kdedevelopers.org/node/3169\" rel=\"nofollow noopener\" title=\"http://www.kdedevelopers.org/node/3169\">http://www.kdedevelopers.or...</a></p>","replies":[]}]
