[{"id":"dsq-457711875","author":"kedadi","deleted":false,"createdAt":"2011-07-20T03:01:54Z","message":"<p>That's really cool.</p><p>Hopefully Qt5 will be around soon.</p><p>Cheers.</p>","replies":[]},{"id":"dsq-457711876","author":"Kai Mast","deleted":false,"createdAt":"2011-07-20T03:24:56Z","message":"<p>Thank you!</p>","replies":[]},{"id":"dsq-457711880","author":"George Brooke","deleted":false,"createdAt":"2011-07-20T03:54:45Z","message":"<p>It would be great if this could in some way make it possible for icons of things like skype to be controlled by the end user, that would mean I could finally get rid of the last annoying splash of colour in my monochrome systray.</p>","replies":[]},{"id":"dsq-457711884","author":"Znurre","deleted":false,"createdAt":"2011-07-20T08:52:17Z","message":"<p>Much kudos for this!<br>As a developer I've wanted to have this for some time.<br>Thanks!</p>","replies":[]},{"id":"dsq-457711886","author":"Aaron Seigo","deleted":false,"createdAt":"2011-07-20T09:14:07Z","message":"<p>if the API for this is rich enough and the implementation supports the SNI features properly, then when a Qt version comes with this support we could simply move to using that in KDE apps and even deprecate the implementation in libkdeui. no point in duplication.</p><p>so: do you think this is realistically possible?</p>","replies":[{"id":"dsq-457711889","author":"Aurélien","deleted":false,"createdAt":"2011-07-20T11:55:12Z","message":"<p>I don't think it would be a good idea: sni-qt tries to map the QSystemTrayIcon API to the SNI API but there are features in SNI which are not possible to express with the QSystemTrayIcon API. For example QSystemTrayIcon does not have a concept of categories. Right now sni-qt creates SNI in the Application category. You can set a custom category by defining a property named \"_qt_sni_category\" on the QSystemTrayIcon object but it's a hack (which I need to document, btw).</p><p>To summarize, I see this project as a temporary solution and as a way to reach applications out of our control (Skype) but having a proper, Qt-only, SNI implementation which applications would opt-in to support would be better in the long run (which makes me realize naming this project sni-qt was not the best idea I had, it should be something like systemtrayicon-sni, but that's quite long)</p>","replies":[{"id":"dsq-457712530","author":"Girish","deleted":false,"createdAt":"2011-07-20T18:40:40Z","message":"<p>It would make sense to QSystemTrayIcon::setCategory() instead of a dynamic property. As long as this is documented to be platform specific, such API is not a problem.</p>","replies":[{"id":"dsq-457712700","author":"Aurélien","deleted":false,"createdAt":"2011-07-20T19:32:03Z","message":"<p>I would agree, but I didn't want to extend Qt API with a patch which is not going to be upstreamed soon.</p>","replies":[{"id":"dsq-457712806","author":"Markus","deleted":false,"createdAt":"2011-08-02T00:53:29Z","message":"<p>Yeah but since it's not going into Qt 4.x anyway, a revised patch for 5.0 should be better. Qt 5.0 isn't supposed to be fully compatible with 4.x anyway, so why not extend the patch to cover all our needs?</p>","replies":[{"id":"dsq-457712942","author":"Aurélien","deleted":false,"createdAt":"2011-08-02T02:01:07Z","message":"<p>This will have to be decided when I start working on a 5.x version of this work.</p>","replies":[]}]}]}]}]}]},{"id":"dsq-457711888","author":"Guest","deleted":false,"createdAt":"2011-07-20T09:37:54Z","message":"<p>Skype, you say? :D Oh, well done, sir!</p>","replies":[]},{"id":"dsq-457711893","author":"noname","deleted":false,"createdAt":"2011-07-20T12:47:43Z","message":"<p>And once more thanks to Canonical, Mark and you for making this possible across desktops and toolkits!</p>","replies":[]},{"id":"dsq-457711896","author":"toto","deleted":false,"createdAt":"2011-10-26T08:36:26Z","message":"<p>Thank for this information. I hope this problem will fix in Qt 5 :)</p>","replies":[]}]