[{"id":"dsq-457711133","author":"sheytan","deleted":false,"createdAt":"2010-07-05T16:49:36Z","message":"<p>Yeah! This is cool, anyway it has some bugs. It doesn't look nice with small panels, like 20px. This makes then the systray icons scaling bad. Here two screenshots:</p><p>first with menu bar. Take a look at the systray icons:<br><a href=\"http://img337.imageshack.us/img337/4058/snapshot1p.png\" rel=\"nofollow noopener\" title=\"http://img337.imageshack.us/img337/4058/snapshot1p.png\">http://img337.imageshack.us...</a></p><p>And here without menubar:<br><a href=\"http://img29.imageshack.us/img29/7089/snapshot2zh.png\" rel=\"nofollow noopener\" title=\"http://img29.imageshack.us/img29/7089/snapshot2zh.png\">http://img29.imageshack.us/...</a></p>","replies":[{"id":"dsq-457712324","author":"Aurélien","deleted":false,"createdAt":"2010-07-05T17:56:23Z","message":"<p>Good point, please file a bug about this on <a href=\"https://launchpad.net/plasma-widget-menubar\" rel=\"nofollow noopener\" title=\"https://launchpad.net/plasma-widget-menubar\">https://launchpad.net/plasm...</a></p>","replies":[]}]},{"id":"dsq-457711131","author":"Ricky Laishram","deleted":false,"createdAt":"2010-07-05T17:45:00Z","message":"<p>Wow! That looks interesting. Which package do I have to install to get that in Kubuntu?</p>","replies":[]},{"id":"dsq-457711136","author":"The User","deleted":false,"createdAt":"2010-07-05T19:54:27Z","message":"<p>I love this feature!<br>When it is finished (probably even before ;)) I will create an auto-hiding panel containing the menu bar and some other plasmoids. :)</p><p>Does it work with QMenuBar, too?</p>","replies":[{"id":"dsq-457712332","author":"Aurélien","deleted":false,"createdAt":"2010-07-05T20:46:59Z","message":"<p>Yes, it works with Qt and KDE applications.</p>","replies":[]}]},{"id":"dsq-457711135","author":"The User","deleted":false,"createdAt":"2010-07-05T19:55:21Z","message":"<p>Btw:<br>Why is it in launchpad and not in KDE-SVN/Git?</p>","replies":[{"id":"dsq-457712328","author":"Aurélien","deleted":false,"createdAt":"2010-07-05T20:48:05Z","message":"<p>Because it's part of my work for Canonical. Except for some special cases, we do all our work in Launchpad.</p>","replies":[{"id":"dsq-457712331","author":"Fri13","deleted":false,"createdAt":"2010-07-05T21:29:27Z","message":"<p>Hopefully the code will get moved to KDE Git so it can be easily be added to be tested in other distributions than just Ubuntu. Even that Canonical pays you to make that, it is not good for community it is placed to launchpad what slows down the distribution. :-(</p>","replies":[]}]}]},{"id":"dsq-457711134","author":"Ritesh Raj Sarraf","deleted":false,"createdAt":"2010-07-05T21:30:24Z","message":"<p>This was long asked for. Thank you for making this happen. I had lost hopes when people dropped it when moving to KDE4.<br>Since you mention that Qt too needs to be patched, I wonder if other distros are going to pull it soon. At least, hopefully, if Debian could pull it.....</p>","replies":[]},{"id":"dsq-457711130","author":"TheGZeus","deleted":false,"createdAt":"2010-07-05T23:34:15Z","message":"<p>Hmm.<br>Here's hoping the patch gets brought into Qt proper.</p><p>A true fork is... problematic.</p><p>KDE had this feature once, so I think it'll get back in...</p>","replies":[{"id":"dsq-457711141","author":"Aurélien","deleted":false,"createdAt":"2010-07-06T01:31:53Z","message":"<p>We are in contact with Qt developers and hope to get this back in Qt, hopefully in 4.8.</p>","replies":[]}]},{"id":"dsq-457711140","author":"andi","deleted":false,"createdAt":"2010-07-05T23:54:44Z","message":"<p>looks great.</p><p>Is it also possible to put the application icon and the name left to the menu bar, so that everyone know which application was active?</p><p>great work</p>","replies":[{"id":"dsq-457711144","author":"Aurélien","deleted":false,"createdAt":"2010-07-06T01:33:20Z","message":"<p>There has been some discussions on this. For now it is not possible but it could be added. The window manager decorations are a good way to know which application is active though :)</p>","replies":[]}]},{"id":"dsq-457711145","author":"Saleel Velankar","deleted":false,"createdAt":"2010-07-07T22:11:28Z","message":"<p>hmm, I installed this from the unity repo for lucid but gtk apps dont seem to comply. MyPaint for example. Perhaps I need to install something other than the plasma widget?</p>","replies":[{"id":"dsq-457711149","author":"Aurélien","deleted":false,"createdAt":"2010-07-11T16:40:03Z","message":"<p>Oups, indeed, for gtk applications you need the appmenu-gtk package.</p>","replies":[]}]},{"id":"dsq-457711148","author":"T___U","deleted":false,"createdAt":"2010-07-13T03:57:23Z","message":"<p>Thank you Aurélien, I was definitely missing this. :-)</p><p>Do you think there will be eventually a way to make it work with <a href=\"http://OO.org\" rel=\"nofollow noopener\" title=\"OO.org\">OO.org</a> and Mozilla apps ? (yeah, I guess they are the most used apps by many of us :-)</p><p>I heard they were not true GTK apps... But maybe it can be worked around ?</p>","replies":[{"id":"dsq-457711152","author":"Aurélien","deleted":false,"createdAt":"2010-07-13T12:54:56Z","message":"<p>From what I know of Mozilla apps, it would be quite hard. Like rewriting the equivalent of the Qt and GTK patch for them. I don't know about OOo, but I guess it's the same. As far as I know, it's not going to happen during Maverick cycle.</p>","replies":[]}]},{"id":"dsq-457711151","author":"ike","deleted":false,"createdAt":"2010-07-14T07:45:23Z","message":"<p>xbar drives me nuts. i appreciate it, and i happen to love the bespin style the best anyways, but this will be much nicer for the menu, thank you</p>","replies":[]},{"id":"dsq-457711156","author":"Eol","deleted":false,"createdAt":"2010-07-17T19:21:39Z","message":"<p>Currently, appmenu-gtk and your patch for Qt works with APPMENU_DISPLAY_BOTH environment variable. But appmenu-gtk shows both menus when APPMENU_DISPLAY_BOTH=1, else it shows only one. Your patch for Qt shows both menus when APPMENU_DISPLAY_BOTH isn't empty (is defined). Can you fix it? Here is patch:</p><p>diff --git a/src/gui/widgets/qmenu_x11.cpp b/src/gui/widgets/qmenu_x11.cpp<br>index 21a77e3..9ec0f71 100644<br>--- a/src/gui/widgets/qmenu_x11.cpp<br>+++ b/src/gui/widgets/qmenu_x11.cpp<br>@@ -58,7 +58,7 @@ void QMenuBarPrivate::x11CreateMenuBar(QMenuBar *menuBar)<br> {<br>     static bool firstCall = true;<br>     static bool envSaysNo = !qgetenv(\"QT_X11_NO_NATIVE_MENUBAR\").isEmpty();<br>-    static bool envSaysBoth = !qgetenv(\"APPMENU_DISPLAY_BOTH\").isEmpty();<br>+    static bool envSaysBoth = (qgetenv(\"APPMENU_DISPLAY_BOTH\") == \"1\");</p><p>     if (!menuBar-&gt;parentWidget())<br>         return;</p><p>I don't know where to post bugs, so I post it here =\\</p>","replies":[{"id":"dsq-457711170","author":"Aurélien","deleted":false,"createdAt":"2010-07-19T18:19:31Z","message":"<p>Thanks for the patch, I applied it. I just set up a Launchpad project to track bug reports: <a href=\"https://launchpad.net/appmenu-qt\" rel=\"nofollow noopener\" title=\"https://launchpad.net/appmenu-qt\">https://launchpad.net/appme...</a></p>","replies":[]}]},{"id":"dsq-457711169","author":"avlas","deleted":false,"createdAt":"2010-07-25T17:49:30Z","message":"<p>I love this feature :)</p><p>I found though that in Kontact, the menu is not changing when moving for instance from Kmail to Akregator. I know that it is still in early stages, but this is very promising and I'm using it already in Kubuntu Lucid.</p><p>Thanks for this great work!</p>","replies":[{"id":"dsq-457711177","author":"Aurélien","deleted":false,"createdAt":"2010-08-04T23:56:27Z","message":"<p>Good catch! just fixed it today.</p>","replies":[{"id":"dsq-457712326","author":"avlas","deleted":false,"createdAt":"2010-08-05T09:12:04Z","message":"<p>Great!</p><p>May I ask if it will be updated also in Kubuntu Lucid? I think this is a good option for people that wants to use it and/or wants to test it</p><p>Thanks!</p>","replies":[{"id":"dsq-457712339","author":"Aurélien","deleted":false,"createdAt":"2010-08-05T13:50:56Z","message":"<p>Yes, for now we release binary packages in Maverick and in Lucid Unity PPA.</p>","replies":[]}]}]}]},{"id":"dsq-457711173","author":"Ike","deleted":false,"createdAt":"2010-08-02T02:40:22Z","message":"<p>so as far as programs that use other toolkits and partially use gtk, like firefox and openoffice. I remember hearing that Shuttleworth ws saying work woud be made into making these work (in regards to the netbook addition that i'm assumging will be using this same method). Do you know about anybody looking into this. If it was possible would it be implemented into the menu, or would they be extensions for firefox and openoffice that sent the menus to dbusmenu. (i'm not savvy on the tech stuff so excuse me if i'm mistaken about the technologies)</p>","replies":[{"id":"dsq-457711176","author":"Aurélien","deleted":false,"createdAt":"2010-08-04T23:55:18Z","message":"<p>I don't know of anybody working on it, but it is a problem which will need to be resolved at some point. My personal hope is that Firefox and OOo devs realize this new menubar is here to stay and they should integrate with it.</p>","replies":[]}]},{"id":"dsq-457711175","author":"Ike","deleted":false,"createdAt":"2010-08-02T02:40:53Z","message":"<p>edition*</p>","replies":[]},{"id":"dsq-457711168","author":"avlas","deleted":false,"createdAt":"2010-08-17T01:41:16Z","message":"<p>The more I use the menubar, the more I love it!</p><p>I would like to point two issues that I still have with it. Once they are solved, I think the user experience will be even greater!</p><p>One is that I cannot get gtk applications working in the menubar (I use the version 0.1.8, the one that is working in lucid right now, so I don't know if it has been fixed in the new versions).</p><p>The other is that depending on the wallpaper's colors you may want to change the font color to white. This is very useful if the wallpaper is dark.</p><p>Again, this may have changed in the meantime...</p><p>Thanks for your great work!</p>","replies":[{"id":"dsq-457712338","author":"Aurélien","deleted":false,"createdAt":"2010-08-17T17:49:54Z","message":"<p>- For gtk applications to integrate in the menubar you must install the appmenu-gtk package.<br>- As for the font color, the menubar applet is using Plasma buttons, so it should follow the Plasma theme.</p>","replies":[{"id":"dsq-457712658","author":"avlas","deleted":false,"createdAt":"2010-08-17T18:14:00Z","message":"<p>I have appmenu-gtk (0.1.3-0lucid2) already installed in my computer, but for some reason it's not working for me.</p><p>Regarding the font, thanks a lot for telling, I will edit it! :)</p><p>Anyway, maybe it would be good to have the possibility to change only the color font of this particular widget like in other widgets.</p><p>One last thing, I realized that sometimes the menubar shows undescores for shorcuts of applications, but I couldn't manage them to work.</p><p>Follow with this great work and thanks!</p>","replies":[{"id":"dsq-457712776","author":"avlas","deleted":false,"createdAt":"2010-09-14T20:08:34Z","message":"<p>Regarding the possibility to edit the font color, I would still strongly recommend to give an option within the widget configuration. I tried several times to change it from the plasma configuration, but I could find the right way to do so, even after looking for quite a few documentation webpages talking on plasma.</p>","replies":[{"id":"dsq-457712917","author":"avlas","deleted":false,"createdAt":"2010-09-14T20:09:58Z","message":"<p>Sorry, I meant I couldn't find the right way to do so</p>","replies":[]}]}]}]}]},{"id":"dsq-457711159","author":"avlas","deleted":false,"createdAt":"2010-09-11T08:27:40Z","message":"<p>new version of menubar is working so great, congratulations! the only issue that I see is in gimp, when you move to a secondary window the menu disappears and I would say it should be held on.</p><p>thanks a lot for your work!</p>","replies":[{"id":"dsq-457711163","author":"Aurélien","deleted":false,"createdAt":"2010-09-14T01:42:35Z","message":"<p>Some apps create multiple top-level windows. Right now there is no way for an application to tell the menubar system: \"Please show the 'main' menubar for all my tool windows\". This is something we need to work on.</p>","replies":[]}]},{"id":"dsq-457711160","author":"avlas","deleted":false,"createdAt":"2010-09-12T18:54:44Z","message":"<p>also Amarok is making weird things, it is only one menu available, which says 'group by' (or something similar, as my kde is in another language), after exploring internet</p>","replies":[{"id":"dsq-457711167","author":"Aurélien","deleted":false,"createdAt":"2010-09-14T01:44:34Z","message":"<p>I would be very interested to reproduce this bug: I noticed that Amarok exposes multiple menubars on DBus: the correct one and multiple \"group by\" bars. I always get the correct one shown so I haven't worried about this bug too much. If you can provide steps to reproduce it I'll have a look at it.</p>","replies":[{"id":"dsq-457712337","author":"avlas","deleted":false,"createdAt":"2010-09-14T03:38:25Z","message":"<p>the way I reproduce it is quite simple actually. once in amarok, I click on internet and then any of the options there, in my case lastfm, jamendo, magnatune... once you click one of them the menubar changes to group by and even if you come back to main options you cannot get out from this group by.</p>","replies":[{"id":"dsq-457712656","author":"Aurélien","deleted":false,"createdAt":"2010-09-14T19:41:34Z","message":"<p>Should be fixed once this patch gets in: <a href=\"https://code.launchpad.net/~agateau/amarok/appmenu-fix\" rel=\"nofollow noopener\" title=\"https://code.launchpad.net/~agateau/amarok/appmenu-fix\">https://code.launchpad.net/...</a></p><p>Thanks for reporting! (amazing I get more reports from blog entries than from launchpad)</p>","replies":[{"id":"dsq-457712775","author":"avlas","deleted":false,"createdAt":"2010-09-14T20:00:24Z","message":"<p>great, thanks a lot!</p><p>with respect to launchpad, surely it's because I do things wrong but I found much more useful and efficient to explain issues directy to developers. my impression is that bugs in launchpad are sometimes in the limb for long time before someone pays attention to them.</p><p>also to report a bug is sometimes more difficult than to put a comment in a blog. I know it is not the case, but when I go to launchpad for me it's hard even to find the option 'report a bug'.</p><p>please, take these comments not as a complain but as a constructive criticism, I do appreciate a lot the owrk you all are doing!</p>","replies":[]},{"id":"dsq-457712772","author":"avlas","deleted":false,"createdAt":"2010-09-24T02:03:08Z","message":"<p>now, amarok is working great, thanks!</p><p>may I ask you a couple of things? do you know when, if it will at all, the menubar will support firefox, chromium and openoffice?</p><p>right now they are the only applications out of the menubar</p><p>on the other hand, I have wxMaxima showing double menus on the menubar and on the application, did you notice it?</p><p>thanks again!</p>","replies":[]}]}]}]}]},{"id":"dsq-457711161","author":"sheytan","deleted":false,"createdAt":"2010-09-14T00:16:42Z","message":"<p>Hey, ive two ideas.</p><p>1st: What about some kinetic animations for appear/disappear the menu bar<br>2nd: When the desktop is focused, display the desktop menu like the others, in line, not as a button :)</p><p>Thanks for this, this one rocks! :D</p>","replies":[{"id":"dsq-457711164","author":"Aurélien","deleted":false,"createdAt":"2010-09-14T01:40:22Z","message":"<p>1. Animations could be nice, but it's a bit late for this kind of work in this Kubuntu cycle. I would be a bit worried about animations getting a bit painful though.<br>2. I am not sure what you mean. The menu is displayed as a menu, would you expect the menu entries (\"Run Command...\", \"Add Widgets...\"...) to be top level items? That would look weird IMO because people are expecting top level items to be containers, not actions.</p>","replies":[]}]},{"id":"dsq-457711180","author":"Bigbrovar","deleted":false,"createdAt":"2011-01-12T15:33:47Z","message":"<p>Hi I am using the plasma-wget-menubar on Kubuntu which I have to say as really improved my workflow and helps makes the UI of applications to be free of unnecessary clutter. However I did observed some issues I am encountering when I have the widget enabled. mainly some applications take a long time (like 4 mintute) to start, during which the whole desktop (plasma-shell) freezes and becomes unresponsive till the application launches then everything would unfreeze and the desktop becomes usable again. I do not experience this when I have the widget disabled and not all kde/Qt application is affected. I however do have the issue with Clementine, Dragon Platyer, and JUk. I filed a bug on the issue here <a href=\"https://bugs.launchpad.net/ubuntu/+source/plasma-widget-menubar/+bug/701527\" rel=\"nofollow noopener\" title=\"https://bugs.launchpad.net/ubuntu/+source/plasma-widget-menubar/+bug/701527\">https://bugs.launchpad.net/...</a> Please let me know if there is anything I can do to resolve this problem</p>","replies":[{"id":"dsq-457712340","author":"Aurélien","deleted":false,"createdAt":"2011-01-12T20:23:43Z","message":"<p>Thanks for reporting the bug. I will have a look at it.</p>","replies":[]}]},{"id":"dsq-457711182","author":"jonathas roberto","deleted":false,"createdAt":"2011-02-19T21:49:43Z","message":"<p>hi! looks great but... how install in opensuse 11.3 using kde 4.6.0???</p>","replies":[{"id":"dsq-457712344","author":"Aurélien","deleted":false,"createdAt":"2011-02-20T15:40:33Z","message":"<p>Right now you can't install this on opensuse, unless you apply the Qt patch yourself. Hopefully Qt 4.8 will include this patch, making it much easier to use appmenu.</p>","replies":[]}]}]
