[{"id":"dsq-457710843","author":"KDE user from Poland","deleted":false,"createdAt":"2009-12-17T04:23:50Z","message":"<p>Personally i think that the biggest advantage of Colibri is small notification-bubbles size. Default-plasma notification bubbles are su HUGE. Thay took to much space for me.</p><p>Ind i'm not a geeky pro-user, i'm normal user who want his work done. And those default-notifications are to irritating.</p>","replies":[]},{"id":"dsq-457710850","author":"Markus","deleted":false,"createdAt":"2009-12-17T04:27:16Z","message":"<p>Looks good. Remids me of Growl ( <a href=\"http://growl.info/\" rel=\"nofollow noopener\" title=\"http://growl.info/\">http://growl.info/</a> ) which is awesome.</p>","replies":[]},{"id":"dsq-457710851","author":"apol","deleted":false,"createdAt":"2009-12-17T04:38:43Z","message":"<p>Can you show what it looks like the notifications with actions? Like kopete's for instance.</p><p>Thanks</p>","replies":[{"id":"dsq-457710871","author":"Aurélien","deleted":false,"createdAt":"2009-12-17T14:02:21Z","message":"<p>Sure, here it is: <a href=\"http://imagebin.ca/view/MsHnuW.html\" rel=\"nofollow noopener\" title=\"http://imagebin.ca/view/MsHnuW.html\">http://imagebin.ca/view/MsH...</a></p>","replies":[]}]},{"id":"dsq-457710853","author":"Francis","deleted":false,"createdAt":"2009-12-17T04:52:11Z","message":"<p>Thats fine, but, only for kubunters, if you like this kind of notification without buttons and the possibility of click through the notification can use Ayatana, already installed in Kubuntu, just marking a radiobutton.</p><p>Go to Preferences in systray (right mouse button), Information tab and select Ayatana notification. You can choose the position of notifications too.</p><p>For other distros colibri is a good option.</p>","replies":[]},{"id":"dsq-457710854","author":"bq","deleted":false,"createdAt":"2009-12-17T05:07:51Z","message":"<p>I like it a lot because regular plasma notifications occupies a really big space on screen. Actually the combination of those could be really awesome. Imagine that jobs would be handled by plasma notifications and a all the rest by colibri.</p><p>But hey, how about screen brightness and volume notifications? Sorry, but state of them in SC 4.3.* is awful...</p>","replies":[{"id":"dsq-457710875","author":"Aurélien","deleted":false,"createdAt":"2009-12-17T13:21:55Z","message":"<p>Actually, you can get exactly this: Colibri only does notifications, so job progress are still handled by Plasma.</p><p>I don't know about screen brightness, but I suggest you test KMix in KDE 4.4, you may find something similar to this: <a href=\"http://imagebin.ca/view/VjwpGS4.html\" rel=\"nofollow noopener\" title=\"http://imagebin.ca/view/VjwpGS4.html\">http://imagebin.ca/view/Vjw...</a> :)</p>","replies":[{"id":"dsq-457712201","author":"bq","deleted":false,"createdAt":"2009-12-17T15:42:06Z","message":"<p>That is GREAT! I keep track of features in the next release, but I missed this one. Thanks!</p>","replies":[]},{"id":"dsq-457712192","author":"Alejandro Nova","deleted":false,"createdAt":"2009-12-17T17:44:04Z","message":"<p>I do not use Kubuntu and I'm in the line for this.</p><p>There are a lot of uses for passive and actionless notifications (volume, screen brightness, MSec notifications, Amarok songs). If I can use them along KNotify ones, and if KDE apps support them, it would be great.</p>","replies":[]}]}]},{"id":"dsq-457710855","author":"Dieppe","deleted":false,"createdAt":"2009-12-17T05:10:21Z","message":"<p>Nice, just what I wanted. Hope this will end up in Gentoo when 4.4 is released.</p><p>Thanks for the good work!</p>","replies":[]},{"id":"dsq-457710857","author":"wt","deleted":false,"createdAt":"2009-12-17T05:28:01Z","message":"<p>That one can \"click through\" the notification to the window beneath is of extreme interest to me.  For the longest time, I have kept an eye out for some way to have, say, a movie playing Always On Top at X% transparency but be able to work with the windows beneath it as if the movie were not in the way at all.  The same idea applied to notifications seems very good to me.</p>","replies":[]},{"id":"dsq-457710858","author":"Raul Silva","deleted":false,"createdAt":"2009-12-17T05:31:34Z","message":"<p>Excellent!</p><p>I haven't tried it yet, but from the looks of it, it seems as \"notifications done right\". It reminds me of Growl.</p><p>I posted a suggestion some while ago, over on the KDE Forums, about the notification system looking like this. I always felt that the \"sliding\" effect was too restrictive, and that having floating notifications enable a much more flexible desktop.</p><p>It's cool when we find someone that shares your point of view, and on top of that, is able do to something about it.</p><p>So, good work! =)</p>","replies":[]},{"id":"dsq-457710859","author":"QUASAR","deleted":false,"createdAt":"2009-12-17T06:06:16Z","message":"<p>Nice, thanks!</p>","replies":[]},{"id":"dsq-457710860","author":"Fri13","deleted":false,"createdAt":"2009-12-17T06:47:53Z","message":"<p>\"because the idea of passive notifications does not fit with Plasma team vision.\"</p><p>It is not about vision... it is about usability studies what shows that passive pop-up is not intuitive and does disturb user more than pop-up what includes the actions.</p><p>The usability testing results just does not fit the Canonical vision.</p>","replies":[]},{"id":"dsq-457710863","author":"Kishore","deleted":false,"createdAt":"2009-12-17T08:08:31Z","message":"<p>i have used these notifications in karmic and i really liked them. But the lack of actions really troubled me and i had to go back.</p><p>1) I use kepas for local LAN file sharing. When someone tries to send me a file it shows up as a notification with two actions to either accept or reject. This simply does not work with Ayatana.</p><p>2) Power manager (PowerDevil) sends a notification that it is about to sleep in 10 seconds. Click cancel to stop. Again...</p>","replies":[{"id":"dsq-457710876","author":"Aurélien","deleted":false,"createdAt":"2009-12-17T13:30:17Z","message":"<p>I didn't know about Kepas, will give it a try. Is there no other way than a notification to accept or reject the transfer?</p><p>About PowerDevil, I proposed a patch to turn this dialog into a dialog which would not steal focus: it generated quite a large thread on the kde-core-devel mailing list, but it was rejected in the end.<br>The work-around I am using is to set the timeout to something much longer, like 5 minutes, so that you get enough time to plug your laptop, cancelling the scheduled suspend.</p>","replies":[{"id":"dsq-457712195","author":"Kishore","deleted":false,"createdAt":"2009-12-17T22:31:25Z","message":"<p>Nope. There is no other way to accept/reject.</p>","replies":[]}]}]},{"id":"dsq-457710864","author":"pns","deleted":false,"createdAt":"2009-12-17T08:18:23Z","message":"<p>Good thing is, it shows the power of KDE 4 plasma desktop modularity. Easy to replace every component with other. Packagers can choose what their distro wants as default. Individuals can change by simple clicks.</p>","replies":[]},{"id":"dsq-457710865","author":"KDS","deleted":false,"createdAt":"2009-12-17T08:45:51Z","message":"<p>Thank you for your work!<br>I like this idea of passive notifications, and I think it should be enhanced and incuded upstream as an option (like many other program options), like in Kubunut 9.10.</p><p>The problems that Kishore describes should be considered, and I think that a normal notification with this two options (cancel, and accept.) should apear. It is necesary.</p><p>Fri13: About which tests do you refere? How made them? Can you provide a link or something?</p>","replies":[]},{"id":"dsq-457710866","author":"Rich Johnson","deleted":false,"createdAt":"2009-12-17T09:37:49Z","message":"<p>I myself, only use 1 app that I like a notification from, and that is Kopete. Right now I am bothered by having to click on something for other notifications. So because of that, thank you a ton for releasing Colibri, and just so you know, we are packaging it right now, as I type this, someone, somewhere, is packaging it for 10.04 :) Thanks!</p>","replies":[{"id":"dsq-457712194","author":"Aurélien","deleted":false,"createdAt":"2009-12-17T18:05:24Z","message":"<p>Great news, thanks!</p>","replies":[]}]},{"id":"dsq-457710867","author":"Ted Gould","deleted":false,"createdAt":"2009-12-17T09:48:52Z","message":"<p>@Kishore: Obvoiusly applications have to be aware whether the notifications they're sending are passive or contain actions.  If they just assume there will be buttons, then the messages and the interactions will be sub-optimal.  Unfortunately, these situations have to be worked through on an app-by-app basis.  There are some general guidelines on the Notify OSD webpages.<br>@Fri13: Link?  I have seen opinions on this, and other things.  The reality is that if passive notifications didn't work at all, the clock on your wall would be useless :)  There is a time and place for both, I doubt anyone could say \"one way works\" universally.</p>","replies":[]},{"id":"dsq-457710878","author":"Alberto Milone","deleted":false,"createdAt":"2009-12-17T13:34:02Z","message":"<p>Thanks a lot for working on this. At first I was sceptical too but now passive notifications really something that I don't want to deny myself as they greatly improve my productivity in GNOME.</p><p>Having passive notifications in Kubuntu will make switching from one GNOME to KDE and vice versa much easier for me.</p>","replies":[]},{"id":"dsq-457710870","author":"charly","deleted":false,"createdAt":"2009-12-17T15:22:53Z","message":"<p>Hi,</p><p>If the passive popups does not fit in the plasma developpers vision, maybe queued and floating popups do.<br>If notifications already have priority and the queue could be sorted according to that, i don't see any usablity issue.</p><p>Nice work anyway, I understand the present system does not please some people.</p><p>Regards,</p><p>Charly</p>","replies":[]},{"id":"dsq-457710841","author":"Sascha Peilicke","deleted":false,"createdAt":"2009-12-17T16:04:08Z","message":"<p>The question to me is, why do we need this? The new status notification spec developed within KDE was already considered worthy by Gnome and they started to adopt it (<a href=\"http://gould.cx/ted/blog/Having_a_tidy_systray)\" rel=\"nofollow noopener\" title=\"http://gould.cx/ted/blog/Having_a_tidy_systray)\">http://gould.cx/ted/blog/Ha...</a>. Why another one instead of collaborating with what's already there?</p>","replies":[{"id":"dsq-457712189","author":"Aurélien","deleted":false,"createdAt":"2009-12-17T17:35:33Z","message":"<p>The status notification spec is about icons in the systemtray, not about notification bubbles.</p>","replies":[]}]},{"id":"dsq-457710839","author":"Martin Gräßlin","deleted":false,"createdAt":"2009-12-17T16:09:22Z","message":"<p>About the kcm: I think it would fit better to the Desktop section than to Appearance. The main point is to provide a different functionality and not a different appearance - at least I hope so ;-)</p>","replies":[{"id":"dsq-457712199","author":"pano","deleted":false,"createdAt":"2009-12-17T17:29:42Z","message":"<p>I agree with Martin here. In fact after installing colibri, I went to the \"Desktop section\" to change the colibri options :-P</p>","replies":[]},{"id":"dsq-457712191","author":"Aurélien","deleted":false,"createdAt":"2009-12-17T17:37:56Z","message":"<p>Good point, fixed!</p>","replies":[]}]},{"id":"dsq-457710835","author":"jpmorelli","deleted":false,"createdAt":"2009-12-18T18:58:13Z","message":"<p>I love this notification style much more than the standard of KDE !!! Please don´t stop with the project, it´s awesome ! ... and thank you for it.</p>","replies":[]},{"id":"dsq-457710836","author":"Tommy.S","deleted":false,"createdAt":"2009-12-19T01:11:17Z","message":"<p>I believe Fri13 meant this study. <a href=\"http://www.obso1337.org/2009/response-to-the-proposed-canonical-notification-system/\" rel=\"nofollow noopener\" title=\"http://www.obso1337.org/2009/response-to-the-proposed-canonical-notification-system/\">http://www.obso1337.org/200...</a></p><p>And what is problem with KDE4 notification? It has passive, non-action notifications as well when needed? Isn't this obsolete?</p>","replies":[{"id":"dsq-457712185","author":"Aurélien","deleted":false,"createdAt":"2009-12-19T03:58:17Z","message":"<p>Thanks for the link!</p><p>The problem with KDE4 notifications (at least for me) is that I find them too intrusive and require too much interactions to get rid of them.</p><p>Colibri provide a lighter alternative at the cost of some features (actions). As I said, you may or may not like this.</p>","replies":[]},{"id":"dsq-457712188","author":"Ted Gould","deleted":false,"createdAt":"2009-12-22T21:23:01Z","message":"<p>Thanks for the link.  Just to be clear, it's not a usability study, but a literature review.  And I disagree with Celeste on her conclusions (she knows this).  I think that the key difference there is the discussion on whether a notification system that allows actions can ever be a \"glance\" type interruption.  I would argue that anytime a user has to evaluate whether they need to interact with the notification it has already moved up the interruption scale from \"glance.\"</p><p>Unfortunately, I don't believe that user tests can validate this or not because a user would have to use the various notification systems being tested for an extended period of time before they would know what to do with them.  Locking people in a room for days is probably impractical :)</p><p>Today, I think this is going to have to be decided by user perference.  Choose yours!</p>","replies":[]}]},{"id":"dsq-457710832","author":"Siv","deleted":false,"createdAt":"2009-12-21T21:35:40Z","message":"<p>Just wanted to thank you for colibri, which I find way less intrusive than the standard system in 4.4, so keep it up with your good work!</p>","replies":[]},{"id":"dsq-457710879","author":"Michael Krog","deleted":false,"createdAt":"2009-12-28T11:23:44Z","message":"<p>The default KDE 4 notifications was the direct cause that me and my wife switched away from kde about a year ago.</p><p>Sure, it was in an earlier stage then.</p><p>But today we both use Growl-style notifications, her's on mac, mine in Gnome.</p><p>I really like this Colibri alternative.</p>","replies":[]},{"id":"dsq-457710880","author":"Anthony Earles","deleted":false,"createdAt":"2010-02-12T19:53:49Z","message":"<p>Thanks for this!</p><p>I've just updated to KDE 4.4 through the normal update channels and really missed Ayatana.</p><p>Installing Colibri helped me to get back to the desktop I love!!</p><p>Have you any idea if/when it will be included in the main Kubuntu repos?</p>","replies":[{"id":"dsq-457712206","author":"Aurélien","deleted":false,"createdAt":"2010-02-13T22:43:32Z","message":"<p>I'm working on it! I hope it can be included in Lucid.</p>","replies":[]}]},{"id":"dsq-457710886","author":"acidrums4","deleted":false,"createdAt":"2010-04-13T21:13:16Z","message":"<p>A stupid cuestion: It can be ported to Gnome? Notify-OSD really sucks! Developers do what they want but not what the users want about notify-osd!</p>","replies":[{"id":"dsq-457712209","author":"Aurélien","deleted":false,"createdAt":"2010-04-14T12:49:13Z","message":"<p>It probably can be ported, just not by me :). Actually I think it would probably be faster to patch/fork notify-osd to behave the way you want it to.</p><p>It runs on GNOME: but I am not sure this is what you want.</p>","replies":[]}]},{"id":"dsq-457710889","author":"bigbrovar","deleted":false,"createdAt":"2010-04-24T20:42:07Z","message":"<p>I noticed this package now comes with lucid (repo) I installed it but i have not been able to enable it. I tried choosing a position from systemsettings and rebooted like twice still the default notification is what comes up. any thought on this?</p>","replies":[{"id":"dsq-457712208","author":"Aurélien","deleted":false,"createdAt":"2010-04-27T13:32:26Z","message":"<p>Did you disable Plasma notifications? You can do so from the configuration dialog of the systemtray applet. Check the README here for more information:<br><a href=\"http://gitorious.org/colibri/colibri/blobs/master/README\" rel=\"nofollow noopener\" title=\"http://gitorious.org/colibri/colibri/blobs/master/README\">http://gitorious.org/colibr...</a></p>","replies":[]}]},{"id":"dsq-457710885","author":"rieper","deleted":false,"createdAt":"2010-05-09T12:14:43Z","message":"<p>it looks nice and i would love to test it, but i encounter depency problems: <br>Unpacking notify-colibri (from notify-colibri_20100410-1_amd64.deb) ...                                                                                                                                      <br>dpkg: error processing notify-colibri_20100410-1_amd64.deb (--install):                                                                                                                                      <br> trying to overwrite '/usr/share/dbus-1/services/org.freedesktop.Notifications.service', which is also in package notification-daemon 0.4.0-2<br>removing this is no option since blueman depends on that daemon.</p>","replies":[{"id":"dsq-457712205","author":"Aurélien","deleted":false,"createdAt":"2010-05-10T14:32:36Z","message":"<p>That's still on my ever growing TODO list :/. Never heard of packages named notify-colibri. Where does it come from?</p>","replies":[]}]},{"id":"dsq-457710890","author":"CyberneticianDave","deleted":false,"createdAt":"2010-06-09T18:56:42Z","message":"<p>Hi. Got this from the Lucid repo (AMD64) and seems to be working OK, two problems though:<br>1. Nothing has been added to System Settings<br>2. It's displaying on the wrong screen, I'd like it to display on the right screen but it's displaying on the left (which is shared using a KVM so doesn't always display my Linux desktop :-S)</p><p>Would be grateful for any help you can offer!</p>","replies":[{"id":"dsq-457710892","author":"Aurélien","deleted":false,"createdAt":"2010-06-09T20:49:07Z","message":"<p>The System Settings problem is strange: it should be in \"Look &amp; Feel &gt; Desktop\".</p><p>The screen problem is a known limitation, I need to find time to work on it.</p>","replies":[{"id":"dsq-457712210","author":"CyberneticianDave","deleted":false,"createdAt":"2010-06-09T20:58:22Z","message":"<p>Bizarre. Perhaps it will turn up after I reboot? I'll update you tomorrow.</p><p>If there's anything I can do to help with screen placement let me know.</p>","replies":[{"id":"dsq-457712632","author":"CyberneticianDave","deleted":false,"createdAt":"2010-06-10T12:50:26Z","message":"<p>Just to let you know that it has appeared after rebooting, so that's good!</p><p>I'd really rather use Colibri than the oversized Plasma notifications, so if there's anything I can do to get it on a different screen I'd be really grateful!</p>","replies":[{"id":"dsq-457712635","author":"Aurélien","deleted":false,"createdAt":"2010-06-10T14:20:55Z","message":"<p>If you know a bit about C++ and Qt, you can try to do this:<br>1. Add a combobox to the kcm so that it let you choose the screen. The combobox should contain an \"automatic\" entry and then one entry per screen<br>2. Modify the source of the colibri binary itself to take this new option into account.</p>","replies":[{"id":"dsq-457712756","author":"CyberneticianDave","deleted":false,"createdAt":"2010-06-10T15:57:12Z","message":"<p>I know a bit of c++ but nothing about Qt, I'm afraid. Wouldn't know where to begin!</p><p>I'd be happy to involved in testing any changes you make though!</p>","replies":[]}]}]}]}]}]},{"id":"dsq-457710893","author":"Praveesh K P","deleted":false,"createdAt":"2010-08-07T09:14:32Z","message":"<p>This is some thing I have been searching for . The default KDE notifications take too much screen space as well as it's a bit difficult to get rid of them</p>","replies":[]},{"id":"dsq-645750583","author":"Sul","deleted":false,"createdAt":"2012-09-01T01:50:22Z","message":"<p>Is this project no longer maintained? If so, it would be a pity... It is the nicest notification system for KDE.</p>","replies":[{"id":"dsq-648869342","author":"Aurélien","deleted":false,"createdAt":"2012-09-03T17:42:05Z","message":"<p>There hasn't been new release for a long time, but that is because it works for me. I don't feel the need for changes there. Does Colibri have any bug annoying you?</p>","replies":[]}]}]