[{"id":"dsq-457709909","author":"ThreeDays","deleted":false,"createdAt":"2008-06-30T03:16:28Z","message":"<p>I'm hoping it will display the new HDphoto format.</p>","replies":[]},{"id":"dsq-457709910","author":"Yorick","deleted":false,"createdAt":"2008-06-30T04:44:16Z","message":"<p>Having a not-so-fast CPU and loving Gwenview that sounds great! Thank you so much for your work :)</p><p>You guys make KDE rock!</p>","replies":[]},{"id":"dsq-457709913","author":"deepak","deleted":false,"createdAt":"2008-06-30T08:43:54Z","message":"<p>This is great - will certainly help with the huge images cameras routinely pump out these days. BTW, I was wondering if/when Gwenview will be able to do pre-loading of the next image when viewing a sequence/folder of images.</p><p>Cheers.</p>","replies":[]},{"id":"dsq-457709914","author":"Poldark","deleted":false,"createdAt":"2008-06-30T10:28:35Z","message":"<p>Congratulations!!!</p><p>Gwenview is my favourite image viewer and it has improved a lot  during last months!!!</p>","replies":[]},{"id":"dsq-457709919","author":"lucian1900","deleted":false,"createdAt":"2008-06-30T10:40:38Z","message":"<p>Great! As if it wasn't quite fast already :)</p>","replies":[]},{"id":"dsq-457709920","author":"Jürgen","deleted":false,"createdAt":"2008-06-30T10:47:44Z","message":"<p>Nice. But much more important for me is loading thumbnails at current scroll position first, for fast browsing in large image-directories. Or is this already in dev-version?</p>","replies":[]},{"id":"dsq-457709921","author":"Matthias Kretz","deleted":false,"createdAt":"2008-06-30T12:00:12Z","message":"<p>Good work. Another optimization I've been wondering about is the YUV - RGB colorspace conversion that JPEGs need. I looked at libjpeg once to see whether one can get the YUV data without letting it do the conversion and it seems to be no problem. You could then display the YUV image using XV or upload it as an OpenGL texture and let a fragment shader convert it to RGB. Both methods would also give you scaling of the image on the GPU.</p>","replies":[]},{"id":"dsq-457709923","author":"Aurélien","deleted":false,"createdAt":"2008-07-01T00:50:19Z","message":"<p>@ThreeDays: don't think Gwenview will support HDphoto format, unless there is a Qt decoder for it.</p><p>@deepak: Gwenview does preload the next image, but it only triggers after one second. This should probably be tuned/fixed.</p><p>@Jürgen: Yes, Gwenview 2.1 generates thumbnails for visible images first (in fact it does not generate thumbnails for other images unless they become visible).</p><p>@Matthias Kretz: Using YUV would be interesting, but shoehorning this inside Gwenview loading code (which is intended to be generic) would be quite difficult I am afraid.</p>","replies":[]},{"id":"dsq-457709925","author":"timri","deleted":false,"createdAt":"2008-07-01T10:54:03Z","message":"<p>@ThreeDays: As far as I can tell HD Photo does not fall under the Microsoft Open Specification Promise ( <a href=\"http://www.microsoft.com/interop/osp/default.mspx\" rel=\"nofollow noopener\" title=\"http://www.microsoft.com/interop/osp/default.mspx\">http://www.microsoft.com/in...</a> )<br>so implementing it could get you into patent-troubles à la GIF.</p>","replies":[]},{"id":"dsq-457709928","author":"Radon","deleted":false,"createdAt":"2008-07-02T02:08:25Z","message":"<p>\"@deepak: Gwenview does preload the next image, but it only triggers after one second. This should probably be tuned/fixed.<br>@Jürgen: Yes, Gwenview 2.1 generates thumbnails for visible images first (in fact it does not generate thumbnails for other images unless they become visible).\"<br>I'd be very grateful if you put an option in the settings menu (scroll bar?) so that it's possible to choose how many images forward are preloaded.</p><p>Due to Vista many new computers are overpowered with multiple-cores and gigs of RAM to spare, so it shouldn't be a problem to preload whole fodlers.  Thanks!</p>","replies":[]},{"id":"dsq-457709906","author":"plop","deleted":false,"createdAt":"2008-07-19T16:27:10Z","message":"<p>Hellon</p><p>Is it too much complex to push your update to QT svn  ?</p><p>Bravo à vous  !</p>","replies":[]},{"id":"dsq-457709907","author":"Aurélien","deleted":false,"createdAt":"2008-07-21T01:22:10Z","message":"<p>@plop: I can't push code to Qt svn, except by suggesting Trolltech engineers to have a look at it. I am not sure it would be a good idea anyway since it can loose some image details, which is probably not appropriate in all situations.<br>From what I read of Qt JPEG decoder, it can do some down sampling if you ask it to load the image with a low value for the \"quality\" parameter (not sure it's the right parameter name, this is from memory). This may be what you are looking for.</p>","replies":[]},{"id":"dsq-457709904","author":"Carlos Paredes","deleted":false,"createdAt":"2008-09-25T03:24:52Z","message":"<p>I just have tried gwenview 2.1.1 (from KDE 4.1.1) and, when switching into full screen, it adds a thumbnail line at the top once I set the resolution at 1:1. I can't find a way to remove it (nor the scroll bars) and, whats even worse: the scroll is painfully slow (in a E8400 @ 3.8 GHz!). Outside full screen mode, the scroll is fast... I suspect the slowness caused by the upper thumbnail, fortunately not shown outside full screen.</p><p>I used previous gwenview versions and, as far as I remember, it was *by far* more configurable and fast (in an old Pentium 4 @ 2.8). I can't use the current version to browse my 10 MP pictures at full res/full screen... :-(</p>","replies":[]},{"id":"dsq-457709903","author":"Aurélien","deleted":false,"createdAt":"2008-09-25T13:45:32Z","message":"<p>@Carlos Paredes: Thanks for this totally off-topic comment.</p><p>Nevertheless, you will be happy to know that the thumbnail bar behavior has been changed in Gwenview 2.2: it now only shows when you move the mouse to the top of the screen.</p>","replies":[]},{"id":"dsq-457709929","author":"noska","deleted":false,"createdAt":"2009-08-23T15:46:48Z","message":"<p>C'est vraiment incroyable!<br>J'ai un view PC Portable et un APN qui peut prendre en 4000x3000 ! Alors que l'affichage est insupportablement long (2 à 3 secondes !!) avec la plupart des visionneurs, c'est super rapide dans gwenview grâce à ce système (et contrairement à digikam, ça n'empèche pas d'avoir un zoom de qualité)</p>","replies":[]}]