[{"id":"dsq-457710412","author":"Pier-Olivier Thibault","deleted":false,"createdAt":"2009-04-24T00:59:38Z","message":"<p>Nice, I'll try this #3 option. Thank you!</p>","replies":[]},{"id":"dsq-457710416","author":"jaham","deleted":false,"createdAt":"2009-04-24T01:20:42Z","message":"<p>I remember using a program called gnu stow from my days with linux from scratch which does similar things. <a href=\"http://www.gnu.org/software/stow/\" rel=\"nofollow noopener\" title=\"http://www.gnu.org/software/stow/\">http://www.gnu.org/software...</a></p>","replies":[]},{"id":"dsq-457710418","author":"comawhitex","deleted":false,"createdAt":"2009-04-24T09:41:43Z","message":"<p>I prefer /usr because that is where Gentoo installs :)</p>","replies":[{"id":"dsq-457710425","author":"pinotree","deleted":false,"createdAt":"2009-04-24T15:13:17Z","message":"<p>Yep, that's a nice way to break your system, especially when installing a newer version of some library, which is not compatbile with the system one (for example the core library of poppler, which does NOT guarantee any source- and binary- compatibility).</p>","replies":[{"id":"dsq-457712077","author":"comawhitex","deleted":false,"createdAt":"2009-04-25T02:01:07Z","message":"<p>hehehe. But I'm sure if there is, it will be fixed :)</p>","replies":[]}]}]},{"id":"dsq-457710420","author":"annma","deleted":false,"createdAt":"2009-04-24T10:58:39Z","message":"<p>The discussion started with my questions about the kdegraphics cmake checks which were not accurate. I did not need to build anything from source in fact, my distro provides the required dependencies but they were not dealt with properly by cmake. The Exiv2 minimum version has been lowered and the libgomp-devel package check has been fixed. So the discussion should not have been heated as the questions were pertinent.</p><p>When KDE trunk requires a lib not yet provided by my distro, I put the source in KDE source dir, build it in KDE build dir and I install them in KDE install dir. Sort of way 3. but without root rights. It's then easy to see what I have installed from source and to wipe it all to build clean and to install clean.</p><p>I upgrade my distro every 2 years or so, the rest  of the time I only install security updates but no upgraded packages. No need to break a working kernel or XOrg, right? And I don't have the time to always have my distro at the latest release.</p>","replies":[{"id":"dsq-457712076","author":"Aurélien","deleted":false,"createdAt":"2009-04-24T11:21:54Z","message":"<p>&gt; The Exiv2 minimum version has been lowered<br>That’s what I suggested you to try, but you refused to do it.</p><p>&gt; No need to break a working kernel or XOrg, right?<br>Of course, we are not talking about such big components here. Building Exiv2 by hand does not take the same time as building the kernel or Xorg. If you use the method I present here, there is no way you can break your system.</p>","replies":[{"id":"dsq-457712603","author":"annma","deleted":false,"createdAt":"2009-04-24T12:41:13Z","message":"<p>I did not refuse to do it, but a CMake in a top module that I do not know so well needs some thinking before being modified: I did lower the version after I understood how kdegraphics works regarding Exiv2, just check my commit time. And Gilles fixed the libkraw cmake file.<br>The comment about the kernel upgrade was to justify that I keep a 1 or 2 years old distro overall, not to suggest it should be built by hand. It's to explain why I do not have the very latest libs available.</p>","replies":[{"id":"dsq-457712732","author":"Aurélien","deleted":false,"createdAt":"2009-04-24T14:15:03Z","message":"<p>&gt; a CMake in a top module that I do not know so well needs some thinking before being modified.</p><p>I agree. But the very first thing you could have tried is to disable the version check and see if it builds. This would have brought important information to the discussion, much faster than Gilles or me installing the version of Exiv2 installed on your machine.</p><p>&gt; The comment about the kernel upgrade was to justify that I keep a 1 or 2 years old distro overall, not to suggest it should be built by hand. It’s to explain why I do not have the very latest libs available.</p><p>If you keep a 1 or 2 years old distro (which I completly understand since upgrading/reinstalling distro can be quite time consuming) then you have to be ready to build libraries by hand as time goes on.<br>It would have been faster for you to install the latest Exiv2 than spend the time we actually spent on irc discussing the minimum version.</p>","replies":[]}]}]}]},{"id":"dsq-457710421","author":"Psychotron","deleted":false,"createdAt":"2009-04-24T13:33:15Z","message":"<p>'stow' is the answer! :) I use it all the time, it's soooo convenient! Every lib/app gets it's own directory below /usr/local/stow/ (via build prefix) and then symlinked into /usr/local. When not needed anymore you can simply unsymlink and delete. When using you only need to care about /usr/local (add to KDEDIRS or *PATHs) ...</p>","replies":[{"id":"dsq-457710423","author":"Aurélien","deleted":false,"createdAt":"2009-04-24T14:05:26Z","message":"<p>I remember stumbling on stow some time ago but never tried it. I should give it a look.</p>","replies":[]}]},{"id":"dsq-457710428","author":"elmarco","deleted":false,"createdAt":"2009-04-27T01:11:37Z","message":"<p>stow +1</p>","replies":[]}]
