[{"id":"dsq-457710955","author":"Ben","deleted":false,"createdAt":"2010-04-29T17:29:43Z","message":"<p>Will Gwenview get support for displaying raw files like Dolphin, at least those types with integrated jpeg preview (extracted from dcraw -e)? This would be tremendous.</p>","replies":[{"id":"dsq-457712245","author":"Aurélien","deleted":false,"createdAt":"2010-04-29T21:04:13Z","message":"<p>For now Gwenview supports whatever Qt supports. So if someone write a raw image plugin for Qt, then Gwenview (and all Qt/KDE applications) will be able to display them.</p>","replies":[]}]},{"id":"dsq-457710953","author":"glad","deleted":false,"createdAt":"2010-04-29T22:27:18Z","message":"<p>I only discovered about DBusMenu now, while reading this post.  This is cool!!!  Please keep the Plasma look for the menus in the systray.  I always found it an aberration that when clicking an icon in Plasma, the widget style for KDE apps is used for the menu that appears instead of the Plasma style.</p>","replies":[{"id":"dsq-457712243","author":"Aurélien","deleted":false,"createdAt":"2010-04-30T00:12:04Z","message":"<p>For now the Plasma style has been reverted because:<br>- It was not reviewed by the Oxygen team.<br>- It introduced more inconsistency: some KDE apps have not been ported to KStatusNotifierItem yet. As a result they would not use the Plasma style, so you end up with one application using Plasma style and the other using widget style.</p>","replies":[{"id":"dsq-457712641","author":"TZ","deleted":false,"createdAt":"2010-05-06T23:52:20Z","message":"<p>It will be a part KDE SC 4.5?</p>","replies":[{"id":"dsq-457712765","author":"Aurélien","deleted":false,"createdAt":"2010-05-07T01:02:37Z","message":"<p>Yes, it will be.</p>","replies":[{"id":"dsq-457712903","author":"Eol","deleted":false,"createdAt":"2010-10-04T15:11:09Z","message":"<p>KDE SC 4.5 is out. Is plasma menu a part of it or it was rejected? And if isn't - will it be in KDE SC 4.6?</p>","replies":[{"id":"dsq-457713039","author":"Aurélien","deleted":false,"createdAt":"2010-10-04T18:51:11Z","message":"<p>It is not part of it and it was not rejected: it depends on a Qt patch which won't be in before Qt 4.8, so it can't go in KDE SC yet.</p>","replies":[]}]}]}]}]},{"id":"dsq-457712242","author":"Kevin Kofler","deleted":false,"createdAt":"2010-04-30T01:30:57Z","message":"<p>IMHO the real problem is that Plasma is using its own style in the first place instead of matching the rest of KDE.</p>","replies":[]}]}]
