[{"id":"dsq-645751125","author":"gaboo","deleted":false,"createdAt":"2012-08-08T12:05:20Z","message":"<p>I have to use a Mac for some time now for work. There is iPhoto on it. Tried it. It's so much worse than gwenview it's not even funny. Keep up the good work and thank you!</p>","replies":[{"id":"dsq-645751198","author":"Aurélien","deleted":false,"createdAt":"2012-08-08T13:22:07Z","message":"<p>Come on, don't make me blush :)</p>","replies":[]}]},{"id":"dsq-645751130","author":"Diederik van der Boor","deleted":false,"createdAt":"2012-08-08T12:45:58Z","message":"<p>Thanks for the wonderful summary!</p><p>To be honest, I was a bit disappointed by the KDE 4.9 release, purely judging from the release notes. It didn't seem to bring much refinement nor innovation. These articles highlight exactly why I would love to upgrade to KDE 4.9 instead! :-)</p>","replies":[]},{"id":"dsq-645751121","author":"gumb","deleted":false,"createdAt":"2012-08-08T13:31:19Z","message":"<p>I wonder if the padlock button could instead be placed between the Fit and 100% buttons, and would toggle between the locked / unlocked padlock image when depressed?</p>","replies":[{"id":"dsq-645751129","author":"Sul","deleted":false,"createdAt":"2012-08-19T05:28:33Z","message":"<p>I like this, it is a good idea. Something between the fit and the 100% buttons.</p>","replies":[]}]},{"id":"dsq-645751120","author":"BajK","deleted":false,"createdAt":"2012-08-08T14:00:18Z","message":"<p>Does Gwenview have, or are you planning to add, support for multitouch guestures, such as two finger scrolling and pinch-to-zoom, or three-finger-swipe to switch between pictures?</p>","replies":[{"id":"dsq-645751197","author":"Aurélien","deleted":false,"createdAt":"2012-08-08T14:43:26Z","message":"<p>It does not have support for multitouch right now. It would be a nice addition but I do not have any multitouch hardware right now.</p>","replies":[]}]},{"id":"dsq-645751115","author":"Trapanator","deleted":false,"createdAt":"2012-08-08T15:05:18Z","message":"<p>Marvellous. This is the best gwenview release of all times.</p>","replies":[]},{"id":"dsq-645751112","author":"Shawn Peterson","deleted":false,"createdAt":"2012-08-08T15:07:16Z","message":"<p>Looks great.  Thanks for making my desktop better!</p>","replies":[]},{"id":"dsq-645751110","author":"Sam","deleted":false,"createdAt":"2012-08-08T15:40:57Z","message":"<p>Very nice.<br>I especially like the \"dragged images preview\".</p>","replies":[]},{"id":"dsq-645751107","author":"nenadsuperzmaj","deleted":false,"createdAt":"2012-08-08T16:11:08Z","message":"<p>Hi Aurélien, congrads on the new release.</p><p>Do you have any report in the past few months of Gwen crushing in Kubuntu? It always did a fantastic job for me, but recently started to crash on browsing folders with many images. Do you have any info on this?</p>","replies":[{"id":"dsq-645751195","author":"Aurélien","deleted":false,"createdAt":"2012-08-08T16:30:58Z","message":"<p>I would need more information to help you: like which version of Gwenview have you been running. If it still happens please file a bug on <a href=\"http://bugs.kde.org\" rel=\"nofollow noopener\" title=\"http://bugs.kde.org\">http://bugs.kde.org</a></p>","replies":[]}]},{"id":"dsq-645751104","author":"FiNeX","deleted":false,"createdAt":"2012-08-08T16:59:47Z","message":"<p>Thanks! Really thanks! I'd ever loved gwenview due to that feature (zoom and position remembering) and now bringing it back makes me happy!!! :-)</p><p>Thanks, thanks and thanks again!!!!</p>","replies":[]},{"id":"dsq-645751097","author":"rom1dep","deleted":false,"createdAt":"2012-08-08T19:21:59Z","message":"<p>Fun fact, in fullscreen mode, when clicking and dragging image to the screen border, the mouse magically pop out at the opposite side of the screen, (that's normal, it also works like this when not in fullscreen), but there is a strange behavior when doing the same on the new UI element showing image path :)</p>","replies":[{"id":"dsq-645751132","author":"Aurélien","deleted":false,"createdAt":"2012-08-08T21:13:10Z","message":"<p>Not sure I get it. What happens?</p>","replies":[]}]},{"id":"dsq-645751135","author":"Heller","deleted":false,"createdAt":"2012-08-09T00:36:33Z","message":"<p>I'd like to have the breadcrumb in view mode too. Is this a planned feature ? Should I open a bko wish or do you think it's something that won't be included for some reasons ?</p><p>And thank you btw ! I love this kind of article :)</p>","replies":[{"id":"dsq-645751205","author":"Aurélien","deleted":false,"createdAt":"2012-08-09T12:37:08Z","message":"<p>You are not the first one to request that, maybe I'll cave in :)</p>","replies":[]}]},{"id":"dsq-645751138","author":"kraftor","deleted":false,"createdAt":"2012-08-09T03:46:31Z","message":"<p>If it wasn't for this blog post, I wouldn't know about any of these features, so thank you, and thank you for this great app :) However, it would be nice if these features where discoverable somehow, though I don't have any idea about how to achieve this. Maybe you'll manage in the future :)</p>","replies":[]},{"id":"dsq-645751140","author":"Amit Kulkarni","deleted":false,"createdAt":"2012-08-09T18:23:45Z","message":"<p>Will you please fold the version into main kde? i.e so we packagers don't have to hunt for latest version of gwenview?</p><p>thanks</p>","replies":[{"id":"dsq-645751143","author":"Aurélien","deleted":false,"createdAt":"2012-08-09T18:53:34Z","message":"<p>What do you mean?</p>","replies":[]}]},{"id":"dsq-645751144","author":"Amit Kulkarni","deleted":false,"createdAt":"2012-08-09T21:32:07Z","message":"<p>Err. sorry.</p>","replies":[]},{"id":"dsq-645751145","author":"gisthoughts","deleted":false,"createdAt":"2012-08-09T21:36:04Z","message":"<p>My mistake. Gwenview is already having same version as KDE. <a href=\"ftp://ftp.kde.org/pub/kde/stable/4.9.0/src/gwenview-4.9.0.tar.xz\" rel=\"nofollow noopener\" title=\"ftp://ftp.kde.org/pub/kde/stable/4.9.0/src/gwenview-4.9.0.tar.xz\">ftp://ftp.kde.org/pub/kde/s...</a></p><p>Why do you refer to Gwenview as 2.9? It confused me for a second.</p>","replies":[{"id":"dsq-645751200","author":"Aurélien","deleted":false,"createdAt":"2012-08-10T12:19:21Z","message":"<p>This is the version used in Gwenview about dialog. Should probably change it to match KDE SC version.</p>","replies":[]}]},{"id":"dsq-645751148","author":"Anders Lund","deleted":false,"createdAt":"2012-08-10T01:38:37Z","message":"<p>Nice development, but there is a behavior change that is not mentioned: sorting and filtering now works on the exif date instead of the file date, which may be nice in some situations, but very bad in other.</p><p>I prefer file date for that mostly, but what about having both? This version of gwenview have low usability for me for that reason :(</p>","replies":[{"id":"dsq-645751199","author":"Aurélien","deleted":false,"createdAt":"2012-08-10T12:16:41Z","message":"<p>It was always supposed to be sorted by exif date but a change in kdelibs broke it. In 2.9 I changed the implementation to avoid this bug.<br>Having said this, I understand sorting by exif date is slower. having both could be nice. Should be easy to implement if you are interested (hint! hint!)</p>","replies":[{"id":"dsq-645751202","author":"Anders Lund","deleted":false,"createdAt":"2012-08-10T13:40:10Z","message":"<p>The problem is not speed (although the current date sorting is indeed very slow), but function. I get batches of images from others, so being able to look at them by file date is much smarter when I want to view a new batch.</p>","replies":[]}]}]},{"id":"dsq-713712795","author":"Tractorman2011","deleted":false,"createdAt":"2012-11-19T10:58:06Z","message":"<p>Thank you for Gwenview.   I first used a distro that had something else as the default and it was so awful  I went online to find something better.   I found Gwenview and now have been using it for years. </p><p>A small thought: I had been looking for the slideshow interval and finally found it in your instruction manual.  Having the setting inside the full-screen configuration does not seem obvious to me, though there may be a reason it fits there.  My first thought was always to look in Settings - Configure Gwenview.   Now that I have found it, there is no problem for me, but others may be looking for it and not finding it.</p><p>Again, my thanks for your work.  You must really love the project, as you have given us so much. </p><p>Have a great holiday season.</p><p>Ed</p>","replies":[{"id":"dsq-713814331","author":"Aurélien Gâteau","deleted":false,"createdAt":"2012-11-19T14:39:11Z","message":"<p>Hi,</p><p>The slideshow delay is in the fullscreen configuration because I expected user would want to adjust it while the slideshow is running, so it would be faster to go there than having to:<br>1. leave the slideshow<br>2. open the settings dialog and change the value<br>3. close the dialog<br>4. restart the slideshow<br>5. Go back to 1. if the new delay was actually too fast/slow.</p>","replies":[]}]},{"id":"dsq-714941084","author":"Tractorman2011","deleted":false,"createdAt":"2012-11-20T15:24:19Z","message":"<p>That explanation makes sense, though I still wish it were easier to find the first time. If the user does know where to look, the setting does not seem available. </p><p>A second thought--if I am previewing a batch of pictures in the smaller size, clicking the slideshow button (I added it to my toolbar) changes the image to fullscreen and changes the menus.  I would prefer it stayed the smaller size (I have some vision issues and have to move away from the monitor for the fullscreen size to be comfortable), but I understand that may add unwarranted complexity.</p><p>Thank you for your work.  This is a great program and trivial issues like the ones I have mentioned certainly do not detract from it.        </p>","replies":[]}]