[{"id":"dsq-457710453","author":"Luis Augusto Fretes Cuevas","deleted":false,"createdAt":"2009-05-18T02:08:32Z","message":"<p>Thank you very much for this.</p><p>Just a suggestion, the tree view looks completely out of place because of the white background, wouldn't be better to use the theme background (I know, it may bring problems with the scrollbar)?</p>","replies":[{"id":"dsq-457712086","author":"Aurélien","deleted":false,"createdAt":"2009-05-18T11:04:02Z","message":"<p>I experimented with various colors, for example using the window background color (like Dolphin) or using the thumbnail view background color but it did not look very good.</p><p>Since this view is quite \"standard\" (no need to contrast with images), I figured I should stick with standard colors for now.</p>","replies":[]}]},{"id":"dsq-457710450","author":"Dread Knight","deleted":false,"createdAt":"2009-05-18T02:24:49Z","message":"<p>I think the \"thumbnails\" button should be converted into a tab as well, don't you think? :P</p><p>Keep up the good work! Gwenview is more and more awesome!</p>","replies":[{"id":"dsq-457712091","author":"Aurélien","deleted":false,"createdAt":"2009-05-18T11:05:28Z","message":"<p>You mean the \"Thumbnail Bar\" button in the image view status-bar? My plan was to use a splitter collapser for this one as well, but I am not sure whether it will happen in Gwenview 2.3.</p>","replies":[]}]},{"id":"dsq-457710451","author":"IAnjo","deleted":false,"createdAt":"2009-05-18T02:38:18Z","message":"<p>Will it be possible to fully hide the “Splitter Collapser”?</p><p>I think it sticks out quite a bit when you're just trying to display some pictures.</p>","replies":[{"id":"dsq-457712084","author":"Aurélien","deleted":false,"createdAt":"2009-05-18T11:07:12Z","message":"<p>Not in 2.3. But has I said it is an experiment, so I will probably adjust its look and feel based on the feedback I get. Don't forget it's fully hidden when you go fullscreen.</p>","replies":[]}]},{"id":"dsq-457710448","author":"Blendiac","deleted":false,"createdAt":"2009-05-18T02:41:06Z","message":"<p>Hey Aurélien,</p><p>Thanks for all your work on Gwenview. Between your job, wife and Clara I'm sure you have plenty to keep you busy!</p><p>Could I suggest using a toolbar button to show / hide the sidebar instead? We have established precedents for this (like the split button in Dolphin) and it stays out of the way of viewing the photos. It keeps the controls centralised and also retains visibility when viewing light grey photographs. :)</p><p>The tabs, defaults and folderview all look fabulous, and Clara looks like an absolute cutie.</p><p>Thanks again for working on a great app and I hope you didn't get beaten too bad at MarioKart! ;)</p>","replies":[{"id":"dsq-457712087","author":"Aurélien","deleted":false,"createdAt":"2009-05-18T11:11:28Z","message":"<p>Mmm... there used to be a button to show/hide sidebar, but I thought it was less obvious than a button on the splitter, so I tried this instead. It would also be a bit odd now that the sidebar may be visible or hidden depending on the view mode, because it would change state when you press either the \"browse\" or \"view\" button.</p><p>About Mario Kart: I still manage to win, but I am not sure for how long!</p>","replies":[]}]},{"id":"dsq-457710446","author":"Jos Poortvliet","deleted":false,"createdAt":"2009-05-18T09:56:02Z","message":"<p>I like the splitter collapser, as it is very intuitive. It didn't take me long to figure out how it works when it showed up in SVN.</p><p>I do however think the tabs belong on top of the sidebar - I hadn't noticed them until you mentioned them!!! On a large screen the content of the sidebar is on top, then there is a large nothingness, then the tabs. If you move them to the top it takes less movement with the mouse - you rarely have to go to the bottom of the app (toolbuttons, menu's and actions are on top. Only zoom and thumbnails on bottom).</p><p>My second suggestion would be to change the previous and next buttons to the same ones as in Dolphin - consistency would be good.</p><p>Third, but this is more of a feature request, have you seen the zoom bar in KOffice 2.0 beta? I think it would fit in Gwenview perfectly.</p><p>Fourth, I love your picture overlays when browsing folders. Unfortunately they are different from Dolphin. Maybe you should talk to Peter and figure out a common look... Get the plasma guys on board as well, plasma lacks the overlay completely ;-)</p><p>Last, please continue with your work on gwenview, it's really great! I love your willingness to experiment above all (eg the splitter collapser, history, thumbar, fullscreen look).</p><p>Oh, and Clara is the cutest thing ever - and you seem to be a good dad, playing with her ;-)</p>","replies":[{"id":"dsq-457712082","author":"Aurélien","deleted":false,"createdAt":"2009-05-18T11:20:49Z","message":"<p>About tabs position: as you said in a latter comment, quite a few apps use tabs at bottom right now. My opinion on this is that having them on bottom keeps the top of the screen cleaner, and with hopefully decent default tab settings, only advanced users will want to switch tabs.</p><p>About previous and next buttons: they are not the same as Dolphin for a good reason: Dolphin buttons let you browse an history, while Gwenview previous and next buttons let you go through a list, like a media player playlist.</p><p>About KOffice 2.0 zoom bar: I had a look at it, but was not convinced by the zoom combobox. I believe switching between zoom-to-fit and 100% should be a one click operation (like Picasa). But it would look nicer if we could get real support for segmented buttons in Qt...</p><p>About overlays: Yes, something needs to be done there, maybe for KDE4.4. I would also like to get support for the nifty folder previews.</p>","replies":[]}]},{"id":"dsq-457710444","author":"Fri13","deleted":false,"createdAt":"2009-05-18T10:23:16Z","message":"<p>I like this idea, where there are multiple tabs on one sidepanel. I use that on Dolphin too in some situations.</p><p>But, I hope that sidebar would be a dock, like on the dolphin. So it can be dragged to right side. It takes little more vertical space when there comes the handles but we get the sidepanel hovering as well then, even on fullscreen.</p><p>The tabs belongs for me bottom of the sidepanel, like on Dolphin, Konsole and many other applications. Even that konqueror and few others use them top.</p>","replies":[{"id":"dsq-457712078","author":"Aurélien","deleted":false,"createdAt":"2009-05-18T11:23:38Z","message":"<p>Gwenview 1.x used a lot of docks, but I witnessed how difficult it was to handle for end users. I am not sure I want to go this way for 2.x, even if the new docks are much nicer than the older ones. It would also make it harder to implement features like splitter collapser I think.</p>","replies":[]}]},{"id":"dsq-457710442","author":"Fri13","deleted":false,"createdAt":"2009-05-18T10:27:17Z","message":"<p>Forget to mention, that sidepanel show/hide widget is different than any other application has. <br>It has good idea what help in some situations \"How do I hide the sidepanel\"?</p><p>I like the Amarok styled sidepanels where there are tabs on the sidebar. These days monitors are 16:10 or next trend 16:9 and we have space on horisontal position but not on vertical. And this way we would get rid of the tabs bottom/top, but tie to sidepanel to one side of the window. So I would go the dockable sidepanel with tabs.</p>","replies":[]},{"id":"dsq-457710441","author":"Jos Poortvliet","deleted":false,"createdAt":"2009-05-18T10:28:57Z","message":"<p>Maybe it is possible for the sidebar to use the same widget as Marble uses. And about the tabs location, maybe this is something which could use a discussion on kde-usability... Having a common solution in all apps would be a big improvement.</p>","replies":[{"id":"dsq-457712079","author":"Aurélien","deleted":false,"createdAt":"2009-05-18T11:27:28Z","message":"<p>This is the QToolBox. The problem with this widget is that it's difficult to go back because controls go up and down everytime you click them.</p><p>I would rather have us use a solution similar to Evolution / Outlook sidebars: a set of non-movable buttons at the bottom of the sidebar. I have a local branch which features such a sidebar, but it used quite a bit of vertical space and I decided I didn't want to be too \"non-standard\", so I went for bottom sidebars.</p>","replies":[]}]},{"id":"dsq-457710436","author":"Jos Poortvliet","deleted":false,"createdAt":"2009-05-18T10:31:19Z","message":"<p>I also forgot to mention, KOffice has the tabs on bottom as well - it uses dockers extensively, and they work pretty good. So maybe they DO belong on bottom. It's just that the huge empty space below the actions on my 19\" screen is so... huge... and if you have a resolution larger than my 1280x1024 (which isn't that excessive) it's even bigger...</p>","replies":[{"id":"dsq-457710456","author":"Boudewijn Rempt","deleted":false,"createdAt":"2009-05-19T01:52:21Z","message":"<p>Actually, we filed a bug report with TT to ask to make it possible to put the docker tabs on top -- I really dislike them at the bottom. It's not a KOffice feature that they are there -- it's lack of a feature in Qt :-)</p>","replies":[]}]},{"id":"dsq-457710435","author":"Martin","deleted":false,"createdAt":"2009-05-18T11:06:59Z","message":"<p>Since you ask... Yes, I do think that the splitter is a visual annoyance in its current position, on top of the picture. Gwenview's primary job, after all, is to display pictures, and it can be argued that it does slightly worse at that with the splitter there. This is certainly true for those users that are not be interested in the features offered by the side bar.</p><p>Anyway: nice work!</p>","replies":[]},{"id":"dsq-457710455","author":"mmmm","deleted":false,"createdAt":"2009-05-18T12:40:45Z","message":"<p>Please make sidebar standard draggable widget like in Dolphin! This fixed sidebar is really terrible for people who wants to customize things in their way.</p><p>I really don't understand why you doesn't use standard Qt 4/KDE 4 draggable sidebar like Dolphin and other Qt 4/KDE 4 applications do :-( Gwenview is excellent application, but this fixed sidebar completely ruins experience for me :-(</p>","replies":[{"id":"dsq-457712090","author":"Aurélien","deleted":false,"createdAt":"2009-05-18T14:22:29Z","message":"<p>Quoting a previous reply on this post:</p><p>\"Gwenview 1.x used a lot of docks, but I witnessed how difficult it was to handle for end users. I am not sure I want to go this way for 2.x, even if the new docks are much nicer than the older ones. It would also make it harder to implement features like splitter collapser I think.\"</p>","replies":[]}]},{"id":"dsq-457710432","author":"Enrico Ros","deleted":false,"createdAt":"2009-05-18T15:07:53Z","message":"<p>Just an idea for the splitter collapser: you could set its opacity as qBound(0.0, 1.0 - 0.01 * (QCursor::pos().x() - splitterPos.x()), 1.0) when the mouse cursor moves (you know what I mean ;-). So that appears only when you get near it.</p>","replies":[]},{"id":"dsq-457710457","author":"KennV","deleted":false,"createdAt":"2009-05-19T08:44:52Z","message":"<p>Here's some more food for thought for your splitter-collapser:</p><p>Maybe you could make it similar to a hidden panel in plasma.  When it's collapsed it glows when the mouse gets near with the button sliding out to be clicked on.  When it's open the button could be present.</p><p>KennV</p>","replies":[{"id":"dsq-457710462","author":"Aurélien","deleted":false,"createdAt":"2009-05-20T12:56:39Z","message":"<p>I had a try at it, will probably enable it. Thanks for the suggestion (and thanks to Enrico Cos as well!)</p>","replies":[]}]},{"id":"dsq-457710458","author":"A. P.","deleted":false,"createdAt":"2009-05-19T20:06:40Z","message":"<p>Gwenview is definitely becoming better and better. Many thanks for your good work!<br>One suggestion: It would be great if one could use file operations in the sidebar like folder renaming, copying and moving per drag'n drop.</p>","replies":[]},{"id":"dsq-457710463","author":"xl","deleted":false,"createdAt":"2009-05-20T22:10:47Z","message":"<p>Great product Aurélien, fantastic job.</p><p>Bringing  back the folder view is a great idea.  I did have a few request / suggestion which I'm not sure have already been addressed:</p><p>- I am currently using v. 2.2.3 which in browse mode does not preload all thumbnails in a folder unless you scroll over them.  Is it possible to let the pre-loader continue to run even while the thumbnails are not in the visible part of the browse view?</p><p>- I thought the preview mode was a great way of browsing both the thumbnails as well as viewing the image at the same time.  I prefer a tabular thumbnail view as opposed to  the thumbnail bar.  Is there any possibility of that ever becoming an option?</p><p>Otherwise I really love the fact that gwenview loads images quite rapidly compared to other image viewers out there.  Great work!</p>","replies":[{"id":"dsq-457712094","author":"Aurélien","deleted":false,"createdAt":"2009-05-21T01:58:49Z","message":"<p>About thumbnail generator: it still does not load everything, but it should generate thumbnails for the next hidden row so that if you don't scroll too fast you don't see them getting generated.</p><p>About tabular thumbnail view... don't spoil my next blog post... :)</p>","replies":[]}]},{"id":"dsq-457710465","author":"scippio","deleted":false,"createdAt":"2009-05-24T01:49:25Z","message":"<p>Great! Thank you :)<br>I have a little question... <br>It would be possible to implement a zoom out under 100%?</p>","replies":[{"id":"dsq-457712096","author":"Aurélien","deleted":false,"createdAt":"2009-05-24T02:07:15Z","message":"<p>Gwenview can zoom out under 100% as long as the zoomed image do not fit in the window. I don't think it would be useful to be able to zoom out further.</p>","replies":[{"id":"dsq-457712605","author":"Fri13","deleted":false,"createdAt":"2009-05-24T03:36:14Z","message":"<p>Many times photographer needs to get neutral gray around the photo to actually see the differences on edges of photos.<br>When the edge of photo and edge of application gets space to breath, the photo's balance, colors, structure etc are easily seen.</p><p>That is one thing why many use papers to hide arounds of paper photos to see the actual photo. Unless you have clear table without any stuff on it so you can get same effect.</p>","replies":[]},{"id":"dsq-457712608","author":"scippio","deleted":false,"createdAt":"2009-05-24T03:54:44Z","message":"<p>Not usefull? Are you crazy? I _VERY_ usefull for many painters and concept artist! I must using gqview :( (sry my english is not good)</p>","replies":[{"id":"dsq-457712742","author":"Fri13","deleted":false,"createdAt":"2009-05-24T13:33:01Z","message":"<p>I think we need a option to settings to allow user to zoom farther than 100%  or \"fit to screen\" -size. Normal users who just want to see the picture on their emails/webpages etc might not care but pro users does.</p><p>There is nicely room next to \"Enlarge smaller images\" for the \"Allow full zoom out\" etc.</p>","replies":[{"id":"dsq-457712883","author":"Aurélien","deleted":false,"createdAt":"2009-05-26T13:46:49Z","message":"<p>Maybe we could add a \"margin\" setting which would define how many pixels should be kept around the image when in zoom-to-fit mode?</p>","replies":[]},{"id":"dsq-457712862","author":"scippio","deleted":false,"createdAt":"2009-05-29T07:32:15Z","message":"<p>reply to Aurélien under me:<br>hmm... or add simple zoom out settings...</p>","replies":[]}]}]}]}]},{"id":"dsq-457710466","author":"brzzz","deleted":false,"createdAt":"2009-05-25T18:34:37Z","message":"<p>Hi!<br>I like this sidebar idea. But I have some suggestion about toggle button. I think that toogle edge will be better than that button (somethink like in Opera; I hope you understand me, here is animation of this: <a href=\"http://img527.imageshack.us/img527/3507/toogleedge.gif\" rel=\"nofollow noopener\" title=\"http://img527.imageshack.us/img527/3507/toogleedge.gif\">http://img527.imageshack.us...</a> ). This solution is more useful I think :-)<br>Oh, and it is possible to add advanced exif information to Gwenview? I miss it ;-)</p><p>regards from Poland<br>sorry for bad english</p>","replies":[{"id":"dsq-457710470","author":"Aurélien","deleted":false,"createdAt":"2009-05-26T13:50:29Z","message":"<p>I have been thinking about toggling edges. I decided not to go this way because I was afraid it would waste space when collapsed, but I am not completely satisfied with the current solution. What does anyone else think about toggling edges.</p><p>About advanced exif information: what do you need which is not provided by Gwenview?</p>","replies":[{"id":"dsq-457712097","author":"brzzz","deleted":false,"createdAt":"2009-05-26T22:50:51Z","message":"<p>Oh, I didn't see, that it had already been there (in 2.3 version) ;-)</p>","replies":[]}]}]},{"id":"dsq-457710472","author":"Gareth","deleted":false,"createdAt":"2009-06-11T00:52:48Z","message":"<p>Sniffle.</p><p>I just installed kde 4.3b2 and i don't like it :(</p><p>Why has the sidebar moved to the left? i can't move it back..</p><p>Is there some secret way of moving it back to the right??</p>","replies":[{"id":"dsq-457710475","author":"Gareth","deleted":false,"createdAt":"2009-06-11T00:59:48Z","message":"<p>Also i can't have the meta info and \"open with\" options visible at the same time. which is how i used gwenview the most up till now.</p><p>Oh and the little expander thing that sticks out from the sidebar into the image viewing area is annoyingly distracting.</p><p>Sorry to be so negative, On the plus side the thumbnails load blindingly fast now which is awesome.</p>","replies":[{"id":"dsq-457712099","author":"Aurélien","deleted":false,"createdAt":"2009-06-11T11:02:24Z","message":"<p>You can right click on the image to reach \"open with...\"</p><p>I am not completely satisfied with the sidebar collapser either, but it will have to stay at least for KDE4.3.</p>","replies":[]}]},{"id":"dsq-457712098","author":"Aurélien","deleted":false,"createdAt":"2009-06-11T11:01:16Z","message":"<p>It was moved to the left because it would have been odd to have a folder view on the right. It also makes it possible to put thumbnails on the right.</p><p>There is no way to move it back, sorry.</p>","replies":[{"id":"dsq-457712105","author":"Gareth","deleted":false,"createdAt":"2009-06-11T21:00:28Z","message":"<p>Could you maybe turn all 3 views into panels much like dolphin does. You could then arrange them however you want and would fit in with how other kde apps such as dolphin and koffice2 work?</p>","replies":[{"id":"dsq-457712612","author":"Aurélien","deleted":false,"createdAt":"2009-06-12T01:30:18Z","message":"<p>Quoting a previous reply on this post:</p><p>“Gwenview 1.x used a lot of docks, but I witnessed how difficult it was to handle for end users. I am not sure I want to go this way for 2.x, even if the new docks are much nicer than the older ones. It would also make it harder to implement features like splitter collapser I think.”</p>","replies":[]}]},{"id":"dsq-457712106","author":"Gareth","deleted":false,"createdAt":"2009-06-12T20:03:01Z","message":"<p>Im just wondering if im the only person who finds it extremely uncomfortable having the file information and properties on the left.</p><p>Trading one set of comfortableness for another seems like an exercise in futility to me.</p>","replies":[]}]}]},{"id":"dsq-457710477","author":"Rajeev","deleted":false,"createdAt":"2009-08-12T12:52:42Z","message":"<p>How you managed the side bar close button?When I press the close button, the onUnload event is called. Actually I need a confirm box, containing the text \"Do you want to close the side bar?\". Even when I press the cancel, the side bar is closed. How can I set \"Ok\" and \"Cancel\" options to the window.onUnload event? Is this only applicable for websites? Or Does Sidebar have special event handling for close?</p>","replies":[{"id":"dsq-457712108","author":"Aurélien","deleted":false,"createdAt":"2009-08-12T14:17:41Z","message":"<p>You do know this article is talking about an application, not a website, right?</p>","replies":[]}]},{"id":"dsq-457710480","author":"ursulakatariina","deleted":false,"createdAt":"2010-03-08T16:57:23Z","message":"<p>The sidebar... Can it be changed to right side of the window? I hate it being on the left . It's allways been on the right. Is it possible?</p><p>I love Gwenview.</p>","replies":[{"id":"dsq-457712109","author":"Aurélien","deleted":false,"createdAt":"2010-03-09T03:23:06Z","message":"<p>Unfortunately it is not possible right now.</p>","replies":[]}]}]
