[{"id":"dsq-2524107058","author":"Adam Kruszewski","deleted":false,"createdAt":"2016-02-19T22:45:14Z","message":"<p>Also a nice and light alternative: Gogs (<a href=\"https://gogs.io/)\" rel=\"nofollow noopener\" title=\"https://gogs.io/)\">https://gogs.io/)</a>. A single binary, lightweight git hosting environment. Works great and I think it is a half-way between full fledged GitLab and a bare bones gitolite. I'm not affiliated with Gogs, I'm just a very satisfied user as I use it on a cheap vps to host my own personal projects.</p>","replies":[{"id":"dsq-2524731748","author":"Aurélien Gâteau","deleted":false,"createdAt":"2016-02-20T08:54:27Z","message":"<p>Looks nice! The UI seems to be \"slightly\" inspired from GitHub :)</p>","replies":[]}]},{"id":"dsq-2524472427","author":"Dima","deleted":false,"createdAt":"2016-02-20T03:14:32Z","message":"<p><a href=\"https://launchpad.net\" rel=\"nofollow noopener\" title=\"https://launchpad.net\">https://launchpad.net</a> has gained native support for git a while back. And yes, just like with bazaar there is push to create a git repository.</p>","replies":[]},{"id":"dsq-2524730062","author":"whatever","deleted":false,"createdAt":"2016-02-20T08:51:34Z","message":"<p>github seems anything but ethical.</p><p>In addition to this recent go around where they have high level managers expressly stating discriminatory bigoted beliefs and employees verifying they have bigoted interview processes, they have in the past, and many times, silenced free speech and freedom of expression as embodied in code repositories that giithub management didn't like for political reasons, including</p><p>C Plus Equality<br>GamerGateOP<br>ToleranUX<br>WebM for Retards</p><p>They need to make sure they hire and promote (and fire) in ways that protect protected classses (gender, race, religion, age, national origin, and they need to keep their bloody fingers away from the delete key when it comes to repositories whose speech they dislike.</p><p>GitHub is indeed the problem..</p>","replies":[{"id":"dsq-2524739474","author":"Aurélien Gâteau","deleted":false,"createdAt":"2016-02-20T09:06:54Z","message":"<p>With ethical I mean: produce proprietary code but does not use unfair tactics to eliminate competitors and also contributes to free software.</p><p>There may be \"discriminatory bigoted beliefs\" behind the scene, and that is sad if it's true (any reliable reference for that?) but so far it has not affected projects hosted on GitHub.</p><p>Regarding GamerGate, there is a fine line to walk between free  speech and organized harassment. I am personally fine with them taking down these repositories.</p>","replies":[{"id":"dsq-2526098534","author":"whatever","deleted":false,"createdAt":"2016-02-21T05:25:26Z","message":"<p>Um, I suspect you truly haven't investigated first hand much about GamerGate, but regardless, only one of those four repos has anything to do with GamerGate. The others are parodies of feminist theory as might be seen in software.</p>","replies":[{"id":"dsq-2529330604","author":"Aurélien Gâteau","deleted":false,"createdAt":"2016-02-22T20:06:59Z","message":"<p>Actually, as a listener of the Isometric podcast, I sadly know quite a bit about GamerGate.</p><p>Regarding whether GitHub should have kept the other repos, it is their decision if they don't want to host something they do not feel comfortable with. As I said, you have plenty of alternative choices if GitHub does not want to host your repo.</p>","replies":[{"id":"dsq-2529531559","author":"whatever","deleted":false,"createdAt":"2016-02-22T21:54:26Z","message":"<p>&gt; Each week, join game developer Brianna Wu, technology journalists Georgia Dow and Mikah Sargent, and game enthusiast Steve Lubitz as they analyze the week’s biggest stories in the video game industry from different perspectives.</p><p>Yeah, you know tons about GamerGate. :/</p><p>&gt; Regarding whether GitHub should have kept the other repos, it is their decision if they don't want to host something they do not feel comfortable with</p><p>It is their decision, but code is speech, and removing repos that offer views they disagree with, and do not otherwise harass, threaten violence, discriminate, spam, incite violence or similar is no way to host an open source community filled with people of diverse views.</p><p>There was nothing wrong with those repos except the political views did not agree with those of github. If there is any more reason to ditch github than that, I cannot think of it.</p><p>Would you use github if it banned:</p><p>+ prochoice repos<br>+ prolife repos<br>+ proIsrael repos<br>+ antiIsrael repos<br>+ pro Republican repos<br>+ pro Democrat repos<br>+ pro Socialism repos</p><p></p>","replies":[{"id":"dsq-2534295593","author":"Alex Bennée","deleted":false,"createdAt":"2016-02-25T09:10:26Z","message":"<p>\"Would you use github if it banned:...\"</p><p>Maybe, maybe not. GitHub is a private company free to set the parameters of which projects they are willing to host. Free speech is not about others having to carry your message if they don't want to.</p>","replies":[{"id":"dsq-2535013161","author":"whatever","deleted":false,"createdAt":"2016-02-25T17:58:12Z","message":"<p>The question is about your own personal behavior, not about forcing github to carry these repos.</p><p>It's 1945 and your nearby housing development won't sell to blacks, or Jews, would you live there?</p><p>\"Maybe, maybe not. GitHub is a private company free to set the parameters of which projects they are willing to host. Free speech is not about others having to carry your message if they don't want to. That housing development has the best views in the city!\"</p><p>It's 1960 and your nearby bakery won't sell to blacks, would you use them yourself?</p><p>\"Maybe, maybe not. GitHub is a private company free to set the parameters of which projects they are willing to host. Free speech is not about others having to carry your message if they don't want to. That bakery makes the best cakes!\"</p><p>It's 1990 and your local country club, where many business functions are held, won't let women become members, would you use them?</p><p>\"Maybe, maybe not. GitHub is a private company free to set the parameters of which projects they are willing to host. Free speech is not about others having to carry your message if they don't want to. That country club has the best 19th hole! Anybody who wants to be known joins!\"</p><p>Oh!. Okay, it's 2005 and your nearby pizza place won't sell pizza to gays, would you use them?</p><p>\"Maybe, maybe not. GitHub is a private company free to set the parameters of which projects they are willing to host. Free speech is not about others having to carry your message if they don't want to. Best pies in town!\"</p><p>Would you use github if it banned:</p><p>+ prochoice repos<br>+ prolife repos<br>+ proIsrael repos<br>+ antiIsrael repos<br>+ pro Republican repos<br>+ pro Democrat repos<br>+ pro Socialism repos</p><p>\"Maybe, maybe not. GitHub is a private company free to set the parameters of which projects they are willing to host. Free speech is not about others having to carry your message if they don't want to. Github functionality is unsurpassed!\"</p><p>Shameful.</p>","replies":[{"id":"dsq-2539054235","author":"Aurélien Gâteau","deleted":false,"createdAt":"2016-02-26T21:42:35Z","message":"<p>&gt; There was nothing wrong with those repos except the political views did <br>not agree with those of github. If there is any more reason to ditch <br>github than that, I cannot think of it.</p><p>Ditch GitHub. That is entirely your choice. As I explain in this article, you have plenty of alternative solutions to host your projects.</p>","replies":[]}]}]}]}]}]}]}]},{"id":"dsq-2524802316","author":"Kevin Funk","deleted":false,"createdAt":"2016-02-20T10:42:58Z","message":"<p>Brillant article. Exactly my thoughts about the recent \"GitHub bashing\"... Let's make this one thing clear: The GitHub UX is just light-years ahead of other comparable solutions, that's what makes people use the service without a lot of consideration.</p><p>If you do want to *own* your data: Do the hosting yourself (and accept *all* the inherent problems you get with it (additional maintenance needs for the systems, reduced accessibility for outsiders), your choice. Let's face it: Your project doesn't get less contributions if you don't use GitHub. The barrier to contribute to random projects (not hosted on well-known hosting platforms) isn't raised by the existence of GitHub. It's as high (or low) as before.</p><p>GitHub really isn't the problem, there are plenty of other solutions where to host your project. You decide what's best for your project.</p>","replies":[{"id":"dsq-2524821102","author":"Colin","deleted":false,"createdAt":"2016-02-20T11:10:50Z","message":"<p>&gt; Your project doesn't get less contributions if you don't use GitHub</p><p>This isn't always true. Did you read the ESLint quote in this article? As a programmer, I didn't start contributing to open source software until 5~6 after I began programming. It was intimidating. I've learned Github now, so I'm comfortable checking out code and submitting patches there. I've filed a single patch to a project on Sourceforge, though I doubt I did it correctly because IIRC it was basically a giant .diff attached to an issue report. I was fortunate that this was a small project, but if I had filed my patch incorrectly to a different project, there are plenty of cases in which I would have been shouted at.</p><p>That's in no way a problem of the host. But it means that I'm more likely to stick with what I know, rather than risk trying to learn a new platform only to use it incorrectly and have the risk of being yelled at.</p><p>Furthermore, when you're searching for projects to use and/or contribute to, where do you search? A Google search with no filter won't likely give you many results. A DuckDuckGo search with \"!github\" will give you very relevant results. Until there's a filter group, like \"!opensource\" that would search Github, Gitlab, Sourceforge, etc, your project will likely get less visibility, and thus fewer contributors, if you host it somewhere else than Github.</p><p>But again, this is no fault of Github's. It's exactly the issue that this article was touching on.</p>","replies":[]}]},{"id":"dsq-2524939967","author":"Martin Drapeau","deleted":false,"createdAt":"2016-02-20T13:34:18Z","message":"<p>For an enterprise, GitHub offers you powerful features and a lot of convenience for very little money. The ROI is incredible. For a team of developers, it has revolutionized how we develop code together. Code reviews become a breeze. For a developer, GitHub is your resume, like LinkedIn for is for suits. It also offers you a powerful tool for personal projects with inexpensive private repos in the cloud. You can even host your blog and personal webpage on GitHub for free. In addition, GitHub has become the backbone of the open source community. It lets developers shine and makes it so simple for anyone to get involved with little friction.</p><p>On GitHub there are no ads and everything is fast and reliable. Its actually quite impressive how fast it is, and how efficient everything you do is. The only thing I feel is lacking is good project management all starting with Issues. That may evolve over time based on feedback provided by the community. Ideas like issue templates is a good step forward. I just don't want to see MS Project or JIRA cloned into it. So GitHub, do take your time on that front. I'm not in a hurry.</p><p>I do love GitHub. And I'm all in for alternatives. At this point, I do not see the benefit of switching.</p>","replies":[]},{"id":"dsq-2525250793","author":"Lamont Granquist","deleted":false,"createdAt":"2016-02-20T17:39:10Z","message":"<p>I don't think its \"arrogant\" at all.  Open Source contributors are already working for free.  I don't think its unreasonable for them to desire that GitHub contribution history that prospective employers can look at.  The poster there has a perfectly valid point about losing an incentive to contribute if the project moves off GitHub.</p><p>Don't shoot the messenger.</p>","replies":[{"id":"dsq-2525508021","author":"Aurélien Gâteau","deleted":false,"createdAt":"2016-02-20T20:40:52Z","message":"<p>I don't know about you, but when I contribute to a project, I do it because I want to fix a bug or add a feature. Building a reputation around my contribution is just a nice side-effect. So yes, I find it arrogant to say \"if you leave GitHub, I won't contribute anymore because I can't brag about my contributions\". Furthermore, you can still brag about your contributions anyway:  nothing prevents you from linking to work on a resume, even if they are not hosted on GitHub, or write about them on a blog. The only thing you miss is the list of repositories you forked.</p>","replies":[{"id":"dsq-2525511451","author":"Lamont Granquist","deleted":false,"createdAt":"2016-02-20T20:43:28Z","message":"<p>And I find you to be arrogant for having a purity test for open source contributions that you measure others against.</p>","replies":[{"id":"dsq-2525670809","author":"Aurélien Gâteau","deleted":false,"createdAt":"2016-02-20T22:49:36Z","message":"<p>What do you mean with \"purity test\"?</p>","replies":[]}]}]}]}]