[{"id":"dsq-2381823457","author":"Ivan Čukić","deleted":false,"createdAt":"2015-11-27T22:42:05Z","message":"<p>Cool! Like the idea for the project, seems to work nicely - will test it a bit more during the following days.</p><p>I'd advise putting a feature comparison with TaskWarrior (and other cli task apps if they exist) to the documentation.</p>","replies":[{"id":"dsq-2381884069","author":"Aurélien Gâteau","deleted":false,"createdAt":"2015-11-27T23:36:11Z","message":"<p>Hi Ivan!</p><p>TaskWarrior has similar goals. From my limited knowledge of it, I think the main differences are that with TaskWarrior  every interaction with your list is done by starting the TaskWarrior binary, whereas Yokadi works as a  shell, which makes a few things more  efficient (completion, a separate history, aliases...)</p><p>Another important difference is that Yokadi lets you attach long-text description to a task. I used to write whole blog posts with Yokadi, and I know Sébastien uses it to write reports for all his meetings for example.</p><p>TaskWarrior is also a project which had received much more work than Yokadi: Yokadi is a side project for all its authors, so there are burst of activities when there is an itch to scratch, then development can slow down for a while. That also means we are not really trying to compete with other applications, we are just happy to use this app and add whatever we feel is missing in it. Therefore I don't feel like writing a  comparison table because it would have a high probability of not getting updated and would become obsolete as the other applications improve :)</p>","replies":[{"id":"dsq-2382755739","author":"Ivan Čukić","deleted":false,"createdAt":"2015-11-28T17:10:47Z","message":"<p>Thanks for the reply.</p><p>I have to say I like the idea of blogging with a tool like this. :)</p>","replies":[]}]}]},{"id":"dsq-2381954731","author":"jstaniek","deleted":false,"createdAt":"2015-11-28T00:46:02Z","message":"<p>Cool work, we need more of that in KDE. Silently hope someone will use the KDb framework for similar project coded using Qt/C++.</p>","replies":[]},{"id":"dsq-2382362183","author":"Victor Varvariuc","deleted":false,"createdAt":"2015-11-28T10:14:20Z","message":"<p>Python 3 is the way to go!</p>","replies":[]}]
