[{"id":"dsq-457711528","author":"dominik","deleted":false,"createdAt":"2010-12-18T20:12:08Z","message":"<p>Thanks! This is definitely an improvement!</p>","replies":[]},{"id":"dsq-457711531","author":"AdeBe","deleted":false,"createdAt":"2010-12-18T20:36:13Z","message":"<p>That's really nice, you are the best! :-)<br>Will it be available in 4.6 KDEPIM, or maybe even in 4.4.x series?<br>Keep it up, I'm looking forward for next improvements.</p>","replies":[{"id":"dsq-457711536","author":"Aurélien","deleted":false,"createdAt":"2010-12-18T20:49:59Z","message":"<p>It is in KDE trunk, so most likely 4.6. I do not plan to backport this changes for 4.4.</p>","replies":[{"id":"dsq-457711550","author":"Luca Beltrame","deleted":false,"createdAt":"2010-12-19T00:59:52Z","message":"<p>KDEPIM 4.6 will not be released with the rest of 4.6, according to a recent message on the kde-pim ML. When that will be out it is unknown (at least at this time).</p>","replies":[{"id":"dsq-457712417","author":"Aurélien","deleted":false,"createdAt":"2010-12-19T02:27:01Z","message":"<p>Ohh... maybe I'll try to backport my fixes to the 4.4 branch then.</p>","replies":[{"id":"dsq-457712418","author":"Markus","deleted":false,"createdAt":"2010-12-19T07:24:53Z","message":"<p>Is there a chance that as part of your official Canonical duties you can help fix the blocker bugs in Kontact 4.6? If that'll result in a release in time for the \"spring distros\" (incl. Kubuntu), it would be perfect.<br>I saw a screenshot of the new KOrganizer in the last Commit Digest and the new \"New Event\" window alone looks so much more pleasant to use.</p>","replies":[{"id":"dsq-457712668","author":"Luca Beltrame","deleted":false,"createdAt":"2010-12-19T16:24:27Z","message":"<p>As some have already said on the kde-pim ML, it's not only a matter of time. The code base is complex, and aside fixing \"papercuts\", other bits require a more-than-superficial knowledge of the components of the PIM stack.</p><p>In short, it's a sort of vicious circle for now.</p>","replies":[{"id":"dsq-457712785","author":"Markus","deleted":false,"createdAt":"2010-12-19T17:04:53Z","message":"<p>Yes, it is complex. That's why I asked if that can be done on Canonical's payroll.</p>","replies":[]}]},{"id":"dsq-457712422","author":"Aurélien","deleted":false,"createdAt":"2010-12-19T18:03:38Z","message":"<p>No, this is not going to happen. Besides, my understanding is that the reasons behind this delay are more complex than a need for UI polishing. Since I know nothing about Akonadi, I wouldn't be very helpful to get kdepim in shape for KDE SC 4.6.0.</p>","replies":[{"id":"dsq-457712426","author":"Markus","deleted":false,"createdAt":"2010-12-19T23:59:12Z","message":"<p>Yeah, I meant fixing the remaining Akonadi issues. That is not a task for 1day/week with no prior Akonadi experience.<br>Too bad all Kontact developers were hired by a company that's currently more interested in bringing Akonadi to f*cking Windows Mobile and maintaining an ancient KDE3 version. Now there is absolutely no non-KDAB developer left who works on the Kontact 4.6 and no Linux distributor seems interested in helping out....</p>","replies":[]}]}]}]}]},{"id":"dsq-457711591","author":"Gres","deleted":false,"createdAt":"2011-02-01T09:48:22Z","message":"<p>I'm using Akregator 4:4.5.94.1-0ubuntu1~maverick1~ppa1 It says version 1.6 (KDE 4.6) from the Kubuntu experimental PPA, but it has the same UI bugs as the older one. Will your changes be there or is in something wrong with the package?</p>","replies":[{"id":"dsq-457712427","author":"Aurélien","deleted":false,"createdAt":"2011-02-02T03:01:12Z","message":"<p>I am not sure about version numbers, but it is possible that v4.5.94 was released before my changes, which would explain your issue.</p>","replies":[]}]}]}]},{"id":"dsq-457711532","author":"T___U","deleted":false,"createdAt":"2010-12-18T20:36:39Z","message":"<p>Aurélien : this is most welcome polish, thanks you ! Actually, this had been bugging me for a long time and I never had the idea to report it as a \"bug\".</p><p>Thanks !</p>","replies":[]},{"id":"dsq-457711535","author":"uetsah","deleted":false,"createdAt":"2010-12-18T20:37:03Z","message":"<p>You rock!</p>","replies":[{"id":"dsq-457711566","author":"Markus","deleted":false,"createdAt":"2010-12-19T07:18:21Z","message":"<p>Wanted to write exactly the same :)</p>","replies":[]}]},{"id":"dsq-457711539","author":"T___U","deleted":false,"createdAt":"2010-12-18T21:23:58Z","message":"<p>Aurélien, may I ask what distro you are using ? :-)</p>","replies":[{"id":"dsq-457712416","author":"maco","deleted":false,"createdAt":"2010-12-18T21:41:38Z","message":"<p>He's a Kubuntu dev, so I have a guess!</p>","replies":[]},{"id":"dsq-457711545","author":"jrdls","deleted":false,"createdAt":"2010-12-18T23:03:36Z","message":"<p>He uses Kubuntu. After all he is a Canonical employee 4 days a week :)</p>","replies":[]}]},{"id":"dsq-457711541","author":"Lee","deleted":false,"createdAt":"2010-12-18T22:05:09Z","message":"<p>Moving unread counts into the name column is a step backward; it makes it less readable, less organised, prevents you from sorting by which the most (or least) unread, etc.  Simply making the columns properly sized would solve the issue.</p>","replies":[{"id":"dsq-457711553","author":"Aurélien","deleted":false,"createdAt":"2010-12-19T02:29:42Z","message":"<p>I for one would go further and drop the other columns. I don't think it there is much use for sorting by least unread. The good news for you though is that if you bring back the unread column (by right clicking the tree header and selecting \"unread\") you will get back to the previous configuration: the unread count will go away from the name column.</p>","replies":[]}]},{"id":"dsq-457711542","author":"Cornelius Schumacher","deleted":false,"createdAt":"2010-12-18T22:50:53Z","message":"<p>It's nice to see KOrganizer get some love :-)</p>","replies":[]},{"id":"dsq-457711544","author":"believemewhenisay","deleted":false,"createdAt":"2010-12-18T22:59:22Z","message":"<p>Well done, good job!</p>","replies":[]},{"id":"dsq-457711546","author":"Carlos Licea","deleted":false,"createdAt":"2010-12-19T00:29:13Z","message":"<p>I cannot overstate how appreciated your improvements are. Thanks.</p>","replies":[]},{"id":"dsq-457711547","author":"Jeffery MacEachern","deleted":false,"createdAt":"2010-12-19T00:39:13Z","message":"<p>Oh, well done, sir! :)<br>Out of curiousity, how much work did it take to make these changes?  I read your last article and I agree that this is an area where things sometimes slip a bit.  What do you think about setting up a communal list of \"papercut\" issues like this for people to hack at when they have a chance?  Bugzilla seems a bit clumsy for that purpose; maybe the Community wiki?</p>","replies":[{"id":"dsq-457711555","author":"Aurélien","deleted":false,"createdAt":"2010-12-19T02:34:12Z","message":"<p>It's difficult to say how much time this took because:<br>- I did this part time on some of my fridays but also in the evenings.<br>- This is the kind of changes one does not get right on the first time, so the final diff is not representative of the time spent on it.</p><p>I would like to see a KDE equivalent to the papercut Ubuntu campaign. I am not so much of an organizer so I don't think I am the best person to coordinate this, but would be happy to join!</p>","replies":[{"id":"dsq-457711565","author":"Jeffery MacEachern","deleted":false,"createdAt":"2010-12-19T05:57:23Z","message":"<p>I'll think a bit on it, and then I may propose such a thing on the mailing list, if it doesn't already exist.</p>","replies":[]}]}]},{"id":"dsq-457711549","author":"Med","deleted":false,"createdAt":"2010-12-19T00:41:03Z","message":"<p>This looks really nice. Polish is one of the main areas in which KDE is still clearly behind the competition. +1 for the smart use of unicode glyphs. As all modern major OS should have good unicode fonts, that's a good opportunity to use them.</p>","replies":[]},{"id":"dsq-457711556","author":"Bigbrovar","deleted":false,"createdAt":"2010-12-19T03:12:16Z","message":"<p>Little UI improvements like this always go a long way in improving Usability and add much needed elegance. Keep up the good work.</p>","replies":[]},{"id":"dsq-457711559","author":"Dotan Cohen","deleted":false,"createdAt":"2010-12-19T03:38:31Z","message":"<p>Nice job, the arrow event indicators and the hour alignment have often bugged me. You might want to check the hour alignment for RTL issues, you can start Korganizer with the --reverse flag to start in RTL but in your native language.</p><p>One other idea which ties perfectly into your space-saving measures is this:<br>Half-height non-work hours in day and week view<br><a href=\"https://bugs.kde.org/show_bug.cgi?id=236057\" rel=\"nofollow noopener\" title=\"https://bugs.kde.org/show_bug.cgi?id=236057\">https://bugs.kde.org/show_b...</a></p><p>Thanks!</p>","replies":[]},{"id":"dsq-457711560","author":"Blackpaw","deleted":false,"createdAt":"2010-12-19T04:57:27Z","message":"<p>Excellent, love the changes to akregator</p>","replies":[]},{"id":"dsq-457711562","author":"nuno","deleted":false,"createdAt":"2010-12-19T05:09:47Z","message":"<p>You rock :)  I have loads of apps that need UI work you could join us at oxygen to work on those for exmaple the calandar thingy in korganizer sould  look beter and probably visualy  aligned with the boxes under</p>","replies":[]},{"id":"dsq-457711573","author":"jamboarder","deleted":false,"createdAt":"2010-12-19T14:38:18Z","message":"<p>Very cool!  Thanks for caring!</p>","replies":[]},{"id":"dsq-457711574","author":"arwa","deleted":false,"createdAt":"2010-12-19T16:11:56Z","message":"<p>Hello,</p><p>to be honest, I do not see most of the differences in korganizer (which margins were altered e.g.) Maybe it would be a good idea to mark them with arrows or circles in the screenshots.</p><p>The arrows for events outside the viewport look much better now. But in case of overlapping an event, they are very hard to see (my eyes are not the best). So it might be an idea to put the arrows on top (or bottom) of each column inside the column by shortening the corresponding column a bit. So instead ot the first cell of the column that displays a part of an event there only is the arrow-up-cell set, without overlapping anything. (But this is just a first quick idea.)</p><p>Thanks,<br>arwa</p>","replies":[{"id":"dsq-457711578","author":"Aurélien","deleted":false,"createdAt":"2010-12-19T18:27:58Z","message":"<p>It is probably easier to track if you place the before/after screenshots side by side. Look around the agenda view, or around the items in the sidebar. You should be able to notice that the agenda view is able to show more hours after the change.</p>","replies":[]}]},{"id":"dsq-457711576","author":"Chani","deleted":false,"createdAt":"2010-12-19T16:16:09Z","message":"<p>awesome :) :)</p><p>btw, there's a mistake I keep making in akregator: I mean to click on the top article, but my mouse slips and I click the header by mistake, which sorts the articles by title. it happens at least once a month, and it's no disaster but it's starting to get to me...<br>any ideas on how to solve that? :)</p>","replies":[{"id":"dsq-457712419","author":"Blackpaw","deleted":false,"createdAt":"2010-12-19T16:27:22Z","message":"<p>Yes, I keep doing that too!</p>","replies":[{"id":"dsq-457712671","author":"Mark","deleted":false,"createdAt":"2010-12-21T20:34:29Z","message":"<p>Me too, same problem.</p>","replies":[]}]},{"id":"dsq-457712420","author":"arwa","deleted":false,"createdAt":"2010-12-19T16:53:40Z","message":"<p>Yes, I accidentally click on the column titles in e.g. mail applications (kmail as well as thunderbird) sometimes. An idea would be to turn off this title click sorting option in the settings (probably of the oxygene style) and set the sorting option in a right mouse button context menu or the view menu. The access is not possible so quick this way, but it is safer in handling.</p>","replies":[{"id":"dsq-457712424","author":"Aurélien","deleted":false,"createdAt":"2010-12-19T18:30:36Z","message":"<p>That would work, but I am wondering how useful sorting by title is. Maybe the simplest solution is to not make the title column sortable.</p>","replies":[{"id":"dsq-457712675","author":"zeroheure","deleted":false,"createdAt":"2010-12-23T23:49:56Z","message":"<p>Please, don't remove any sorting feature! <br>Some other ideas:<br>- force a double click for sorting<br>- add space above the first visible line<br>- add a little sort icon in the column (bad idea)<br>- ...<br>- offer good mouse to users!</p><p>Another idea would be to think about the need of these colum title: every one know that the column is a title, is an author, is a date, etc. By removing these indications one can think about other ways to sort columns: pop-down menu, icon, overlayed indicator, etc. The overlayed indicator plus the removal of the column title will add one more line of free space.</p>","replies":[{"id":"dsq-457712788","author":"Aurélien","deleted":false,"createdAt":"2010-12-24T02:36:20Z","message":"<p>Removing the column headers is an interesting approach, but in addition to a new way to sort it would also require full height splitters to be able to resize columns... still, interesting food for thought.</p>","replies":[]}]}]}]}]},{"id":"dsq-457711579","author":"GJDitchfield","deleted":false,"createdAt":"2010-12-19T22:09:43Z","message":"<p>I hope you get to review the backlog of requests at <a href=\"http://bugs.kde.org\" rel=\"nofollow noopener\" title=\"bugs.kde.org\">bugs.kde.org</a> while you are doing this.  I have put in some paper-cut level reports that are as much as six years old...</p>","replies":[]},{"id":"dsq-457711582","author":"Carlos Cordoba","deleted":false,"createdAt":"2010-12-20T02:55:16Z","message":"<p>It's a really good job, thanks for taking time to fix it!</p><p>I would like to make another suggestion: with these improvements, now the calendar widget seems too big compared to the others. I think it could be smaller and better polished. Lighting (under Thunderbird) uses two letters to show day names, with a smaller font size and day numbers put on a square. Something similar is used on Mac. Please take a look at this screenshot:</p><p><a href=\"http://www.lifeclever.com/wp-content/uploads/2007/10/unschedule.jpg\" rel=\"nofollow noopener\" title=\"http://www.lifeclever.com/wp-content/uploads/2007/10/unschedule.jpg\">http://www.lifeclever.com/w...</a></p><p>Again, thanks a lot for all these usability improvements.</p>","replies":[]},{"id":"dsq-457711583","author":"frank","deleted":false,"createdAt":"2010-12-20T05:57:50Z","message":"<p>Just out of curiousity, while you were working on akregator’s columns: did you think about the alignment of the number columns? (<a href=\"https://bugs.kde.org/show_bug.cgi?id=190052)\" rel=\"nofollow noopener\" title=\"https://bugs.kde.org/show_bug.cgi?id=190052)\">https://bugs.kde.org/show_b...</a> It’s a very basic usability issue.<br>I tried fixing this myself a long time ago, but I wasn’t even capable of finding this simple thing in the code. :'-(</p>","replies":[{"id":"dsq-457711586","author":"Aurélien","deleted":false,"createdAt":"2010-12-20T13:04:56Z","message":"<p>No, I didn't fix that bug. Now that those columns aren't visible by default anymore, I suppose it is less critical. To fix it you must modify the initStyleOption() method in subscriptionlistdelegate.cpp. It should adjust option.displayAlignment correctly for unread and total columns.</p>","replies":[]}]},{"id":"dsq-457711585","author":"Kåre","deleted":false,"createdAt":"2010-12-20T12:42:17Z","message":"<p>Nice!</p>","replies":[]},{"id":"dsq-457711589","author":"JohnG","deleted":false,"createdAt":"2010-12-20T19:50:04Z","message":"<p>Just another \"thank you\" from someone who uses both applications daily.  Keep up the great work.</p>","replies":[]},{"id":"dsq-457711590","author":"Splash","deleted":false,"createdAt":"2010-12-21T14:45:13Z","message":"<p>Great!!!!</p>","replies":[]},{"id":"dsq-457711571","author":"Mark","deleted":false,"createdAt":"2010-12-21T20:36:47Z","message":"<p>Great seeing that Akregator receives a little love. There are so many small issues if they would be fixed, the workflow would be much better.</p>","replies":[]},{"id":"dsq-457711572","author":"Hsal","deleted":false,"createdAt":"2010-12-23T05:53:44Z","message":"<p>Desperately needed fine-tuning to these applications, however I suggest you be a little more invasive with the PIM application. The UI there is so convoluted and counter-productive that simply polishing a few details doesn't resolve the greater issues it has. For example, the window to edit appointments has a totally overloaded layout and tab order is unintuitive but also the main view with its far too large calendar &amp; search &amp; checkbox areas requires a serious rework.<br>Thanks for your work though!</p>","replies":[]},{"id":"dsq-457711526","author":"zeroheure","deleted":false,"createdAt":"2010-12-23T23:54:41Z","message":"<p>Thank you! this sort of work is what users need!</p><p>What about the removal of the timezone indicator? \"Europe/ Paris\" is short but think of \"Amerique/ Dakota du Nord/ Etats-Unis d'Amérique\" or \"Amérique/ Saint-Vincent-et-les-Grenadines\".</p>","replies":[{"id":"dsq-457712413","author":"Aurélien","deleted":false,"createdAt":"2010-12-24T02:37:55Z","message":"<p>Indeed the timezone text can grow quite large... Maybe it should be \"ellipsed\" and the full text displayed in a tooltip if it is too long?</p>","replies":[{"id":"dsq-457712665","author":"zeroheure","deleted":false,"createdAt":"2010-12-24T03:08:34Z","message":"<p>Like in korganizer 4.4.7 ?<br>see <a href=\"http://kimsakkat.free.fr/calendar.png\" rel=\"nofollow noopener\" title=\"http://kimsakkat.free.fr/calendar.png\">http://kimsakkat.free.fr/ca...</a></p>","replies":[{"id":"dsq-457712780","author":"Aurélien","deleted":false,"createdAt":"2010-12-24T05:00:44Z","message":"<p>Mmm... yes probably :) It works in trunk as well. I should have checked before commenting.</p>","replies":[]}]}]}]}]