[{"id":"dsq-785107369","author":"Abdurrahman AVCI","deleted":false,"createdAt":"2013-01-31T23:29:31Z","message":"<p>I am using gwenview almost everyday and I am grateful for the work you have done. Thank you.</p>","replies":[]},{"id":"dsq-785193588","author":"ChallisTowerBks","deleted":false,"createdAt":"2013-02-01T00:59:28Z","message":"<p>I, too, use Gwenview almost every day. It's a wonderful program and extremely useful. The edit functions that are part of the program have, imo, saved me hours of time. Now, if only it could handle XCFs consistently! :)</p><p>But, really, congrats. It's a great project with fantastic functionality. Well done.</p><p>Kaz Augustin</p>","replies":[]},{"id":"dsq-785538558","author":"Daniel Aviles","deleted":false,"createdAt":"2013-02-01T08:29:35Z","message":"<p>I agree. It's beautiful and useful, one of the apps that makes KDE SC shine.</p>","replies":[]},{"id":"dsq-785571737","author":"Astor A.","deleted":false,"createdAt":"2013-02-01T09:17:25Z","message":"<p>One of those apps I stopped using recently - when I realised that it is not possible anymore to zoom out more than \"fit\"...<br>I know about the bug report(s) but don't get the intention - this feature was essential for my workflow...</p>","replies":[{"id":"dsq-785778150","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-02-01T14:18:52Z","message":"<p> Can you explain why you need to be able to zoom out more than \"fit\"?</p>","replies":[{"id":"dsq-785918010","author":"Astor A.","deleted":false,"createdAt":"2013-02-01T16:21:55Z","message":"<p>Mostly visually comparing images: e.g. I have maps with different resolutions and detail and need to know exctly where the one (may be even rotated) is to find in the other. It is much easier to be able to zoom out as much as I want to find certain patterns.</p>","replies":[{"id":"dsq-789811804","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-02-05T22:18:27Z","message":"<p>Oh, I have never heard about this way to work with images until now. I understand it makes sense to want to zoom out more in your case. I need to think more about it.</p>","replies":[]}]}]}]},{"id":"dsq-786418422","author":"Smartest OneHere","deleted":false,"createdAt":"2013-02-02T02:21:21Z","message":"<p>Thank you very much for your work on Gwenview.  It's a fantastic tool for viewing folder contents, graphics, etc. and one of my favorite KDE utilities.</p>","replies":[]}]
