[{"id":"dsq-457711291","author":"Aaron Seigo","deleted":false,"createdAt":"2010-11-20T01:27:09Z","message":"<p>\"such as the inability to know the category of a plugin without loading it.'</p><p>this is the entire purpose of KPluginInfo, though it limits plugins to one category per .desktop file. that could be easily remedied, either by trivially extending KPluginInfo or with a kipi-specific .desktop file entry.</p><p>we use this extensively in plasma to avoid the problem you described :)</p>","replies":[{"id":"dsq-457712367","author":"Aurélien","deleted":false,"createdAt":"2010-11-20T01:36:29Z","message":"<p>Porting to KPluginInfo would be a good idea indeed. KIPI API comes from KDE3 and has not evolved much when it was ported to KDE4. Maybe it's time for a refresh.</p>","replies":[]}]},{"id":"dsq-457711292","author":"Antonio","deleted":false,"createdAt":"2010-11-20T01:43:43Z","message":"<p>This looks really cool, but for me looks also quite bloated. I'm pretty sure most of the people will only use 1-3 of those.</p><p>As I guess most of the services need authentication by the user, so why not move this services to a System Settings' panel like 'Sharing Services' or 'Social Services' where you can register/add the accounts you want (using the same list of services available on the KIPI plugins). Very similar to what kopete does with the IM services.<br>Once you register your services, only those (and maybe the ones that doesn't need authentication) should appear on this 'Share' drop-down list and they would be shared between all the KIPI-plugin-enabled applications.</p><p>How does it sound?</p><p>Anyway, really nice work. Keep on it!</p>","replies":[{"id":"dsq-457712368","author":"Aurélien","deleted":false,"createdAt":"2010-11-20T04:09:46Z","message":"<p>My initial plan was to make the button a splitted one (similar to the \"back\" button in Konqueror for example). Clicking on the \"button area\" would trigger the last used plugin, while clicking on the arrow would show the list of available plugins, allowing you to change the plugin in use. I think this approach is even simpler than adding a System Settings panel which I am afraid lots of people would miss.<br>There was some problems with my early prototype though, which made me choose the current approach, at least for now.</p>","replies":[{"id":"dsq-457712374","author":"Kevin","deleted":false,"createdAt":"2010-11-20T05:31:34Z","message":"<p>Maybe it would be possible to add a configuration option to allow users to customize the export list?  That way you could enable 5 or so by default, and users could (if they chose to punish themselves so) enable all of them.</p>","replies":[{"id":"dsq-457712663","author":"Aurélien","deleted":false,"createdAt":"2010-11-20T17:44:38Z","message":"<p>This is a possibility, but I hope the fact Gwenview remembers the last plugin is enough. Anyway it is now too late for 4.6 to add such a configuration option an I want to wait for user feedback before deciding how this feature should evolve.</p>","replies":[]},{"id":"dsq-457712661","author":"Fri13","deleted":false,"createdAt":"2010-11-22T03:32:54Z","message":"<p>I would suggest that Gwenview would follow the digiKam example (kipi-plugins maintainers) and place to the Gwenview's configuration panel a list of the available kipi-plugins where user can disable/enable them as wanted.</p><p>Check out the digiKam's settings -&gt; kipi-plugins as example</p>","replies":[{"id":"dsq-457712771","author":"Aurélien","deleted":false,"createdAt":"2010-11-22T13:53:47Z","message":"<p>That is another possibility, but I prefer solutions which do not require going through a configuration to get a clean UI. Especially since disabling a plugin from this dialog will disable it from both the \"Plugins\" menu and the \"Share\" button.</p>","replies":[]}]}]}]}]},{"id":"dsq-457711296","author":"Alex Merry","deleted":false,"createdAt":"2010-11-20T20:39:31Z","message":"<p>Well, if you only want to load the plugins that have X-KIPI-Interfaces=org.kde.kipi.ExportPlugin in their desktop files, that should be doable.  I think pluginInfo-&gt;service()-&gt;property() should be what you need.</p>","replies":[{"id":"dsq-457711299","author":"Aurélien","deleted":false,"createdAt":"2010-11-21T15:59:34Z","message":"<p>Oh... I wasn't aware KIPI plugins were now exposing their category in their .desktop files. That's great, thanks for the information! I am going to see if I can take advantage of this to reduce loading time.</p>","replies":[]},{"id":"dsq-457711300","author":"Aurélien","deleted":false,"createdAt":"2010-11-21T16:08:04Z","message":"<p>Mmm... actually it seems the Facebook plugin is the only one to have the \"X-KIPI-Interfaces\" key. It needs to be generalized.</p>","replies":[]}]},{"id":"dsq-457711297","author":"tanghus","deleted":false,"createdAt":"2010-11-21T13:10:24Z","message":"<p>\"maybe we need a generic “document-share” icon\"</p><p>There is the openshare icon set. It comes with jpeg, png, eps and svg versions:</p><p><a href=\"http://www.openshareicons.com/\" rel=\"nofollow noopener\" title=\"http://www.openshareicons.com/\">http://www.openshareicons.com/</a></p>","replies":[{"id":"dsq-457711302","author":"Aurélien","deleted":false,"createdAt":"2010-11-21T16:11:23Z","message":"<p>Interesting, but I think it would be better to have an Oxygen version of this icon for consistency and to avoid duplication: right now I would have to ship the icons as part of Gwenview, and each application would have to do the same.</p>","replies":[]}]},{"id":"dsq-457711304","author":"John Stockwell","deleted":false,"createdAt":"2011-09-15T00:59:22Z","message":"<p>It would be really nice if gwenview would read from standard in. The syntax should be</p><p>... | gwenview -</p><p>where the hyphen would tell gwenview to read from stdin.  We then do not have to<br>write diskfiles before viewing.</p>","replies":[{"id":"dsq-457712375","author":"Fuse","deleted":false,"createdAt":"2011-09-15T20:43:19Z","message":"<p>gwenview /dev/stdin</p>","replies":[]}]},{"id":"dsq-457711306","author":"rhys","deleted":false,"createdAt":"2012-01-18T07:20:18Z","message":"<p>hi there, newbie here and happy to be so, Ubuntu is the promised land!  I loaded ubuntu 11.10, loaded gwenview, no list of 'share' plug-ins in menu bar, it says there are no plug-ins listed.  where do i get the plugins please?</p>","replies":[{"id":"dsq-457712376","author":"Aurélien","deleted":false,"createdAt":"2012-01-19T01:56:46Z","message":"<p>You probably need to install the kipi-plugins package. Look for it in Software Center.</p>","replies":[]}]}]
