[{"id":"dsq-904964242","author":"T_U","deleted":false,"createdAt":"2013-05-22T15:57:56Z","message":"<p>This is quite a fine piece of software, thank you Aurélien. I hope Eike will work on optional display of file previews, well, we'll see !</p>","replies":[]},{"id":"dsq-904981017","author":"thijsheus","deleted":false,"createdAt":"2013-05-22T16:15:52Z","message":"<p>Cool. I like homerun, and will update  as soon as AUR lets me (i.e. tonight). Especially looking forward to your very natural implementation of the cheat sheet ;)</p><p>The best news, however, is in the final paragraph of the blog entry. PIM can definitely use some more hands, and definitely the Aurelien type of hands. Good luck there!</p>","replies":[]},{"id":"dsq-905444819","author":"Eike Hein","deleted":false,"createdAt":"2013-05-23T01:26:33Z","message":"<p>Congrats on taking it all the way to 1.0 and thanks for the kind words :).</p><p>T_U: After I get done with the QML port of Plasma's Task Manager widget for 4.11 I am probably going to set my sights on working on the QML port of Folder View (where I've already done a whole bunch of bugfixing on the existing C++ version lately). With Homerun being QML already I see opportunities for code reuse there, specifically for things like syncing up the handling of file and file-like items.</p>","replies":[]},{"id":"dsq-905560812","author":"bzar","deleted":false,"createdAt":"2013-05-23T05:13:30Z","message":"<p>Hi, a couple of questions/suggestions from an avid keyboard user:</p><p>- Is it possible to move between tabs using the keyboard? If not, I'd like this addition. Using the same controls as Konsole (shift-left/right) would be nice.</p><p>- Does the keyboard (letter keys) do anything when you're browsing the tab items using cursor keys? If not, could I suggest making hitting the letter keys either a) jump to the first item starting with that letter, b) filter the view, or c) count as typing to the search box?</p><p>Thanks for this nice piece of software :)</p>","replies":[{"id":"dsq-905620757","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-05-23T07:54:07Z","message":"<p>Moving between tabs with the keyboard is possible with ctrl+pageup, ctrl+pagedown, but you can now set your own shortcuts.</p><p>Letter keys do nothing for now when browsing tab items. I had an intial version which would do c) (which is the same as b) in the case of Homerun) but that was painful to use because one naturally starts to want to use backspace to erase a character, then the arrow keys to move a text caret (which is not there) between the characters, which conflicts with using the arrow keys to move between items. This was also causing buggy behavior because the focused item could be filtered out as user was typing. I could not get it to  work in a way I was satisfied with, so in the end I opted for adding a shortcut to focus the search box instead (ctrl+f or '/')</p>","replies":[{"id":"dsq-905694151","author":"bzar","deleted":false,"createdAt":"2013-05-23T10:26:55Z","message":"<p>Thanks for the response! Both of these work for me :)</p>","replies":[]}]}]},{"id":"dsq-905615161","author":"TheGhost","deleted":false,"createdAt":"2013-05-23T07:39:08Z","message":"<p>Great work!</p><p>It's good to hear that you work on KDEPIM now, the user interface and dialogs (e.g. account wizard) really need some love.</p>","replies":[]},{"id":"dsq-905656904","author":"dude","deleted":false,"createdAt":"2013-05-23T09:07:50Z","message":"<p>great work, it's my new default menu. Big thanks!</p>","replies":[]},{"id":"dsq-905712669","author":"Pete","deleted":false,"createdAt":"2013-05-23T11:02:13Z","message":"<p>Now Homerun only needs a \"Recent used applications\" source to make it perfect. Thank you for your work!</p>","replies":[]},{"id":"dsq-919375050","author":"JaSauders","deleted":false,"createdAt":"2013-06-05T04:20:48Z","message":"<p>Is there any hope for installing this on Debian 7 KDE? (4.8.4)</p>","replies":[{"id":"dsq-919479765","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-06-05T08:05:24Z","message":"<p>Unfortunately no: Homerun depends on kdelibs and kde-runtime 4.10.</p>","replies":[]}]}]
