[{"id":"dsq-457711657","author":"Pedro","deleted":false,"createdAt":"2011-01-22T03:49:40Z","message":"<p>Another aspect you may want to write about is that the default button should be a safe action. For example, \"Format /dev/sda3\" should never be the default.</p>","replies":[{"id":"dsq-457712446","author":"Eike Hein","deleted":false,"createdAt":"2011-01-22T21:12:56Z","message":"<p>And indeed the KMessageBox API has a 'dangerous' flag the developer can pass to auto-focus the correct button in such a case, and the warning* calls generally default to using that flag.</p>","replies":[{"id":"dsq-457712457","author":"Aurélien","deleted":false,"createdAt":"2011-01-23T01:48:06Z","message":"<p>Oh nice! I was wondering what was the goal of the Dangerous flag. The documentation should mention this (/me goes fixing it)</p>","replies":[]}]}]},{"id":"dsq-457711658","author":"J","deleted":false,"createdAt":"2011-01-22T03:51:49Z","message":"<p>+1, good analysis!</p>","replies":[]},{"id":"dsq-457711660","author":"Dion Moult","deleted":false,"createdAt":"2011-01-22T06:00:03Z","message":"<p>Great post! Looking forward to more of these, this is something every developer should think about.</p>","replies":[]},{"id":"dsq-457711661","author":"TheBlackCat","deleted":false,"createdAt":"2011-01-22T07:06:50Z","message":"<p>Good analysis.  Unclear button names are always a hassle.  It sound like your Nepomuk exmaple would be a good case for both \"Do not ask again\" and for adding a \"Start Nepomuk\" button.</p><p>I think your point about \"The “Do not ask again” check box\" being hard to revert is a good one.  Perhaps this is another user-interface mistake, there should definitely be a clear and consistent way to reset these that users can count on being available so they don't have to be so afraid of this option..</p>","replies":[{"id":"dsq-457712451","author":"sebas","deleted":false,"createdAt":"2011-01-22T21:58:23Z","message":"<p>I find that adding a short note how to deal with it is often already useful enough. So the Nepomuk dialog (if we really want to keep it in this way) could get the following:<br>- [x] Do now show again (maybe even enabled by default, so even if the user clicks ok, this warning comes only once)<br>- A note such as \"You can enable Nepomuk in System Settings | Desktop Search later\", and the two buttons \"Dismiss\" and \"Start Nepomuk\".</p><p>BTW, great post Aurelien!</p>","replies":[]}]},{"id":"dsq-457711663","author":"Alain","deleted":false,"createdAt":"2011-01-22T16:58:57Z","message":"<p>Nice read!</p><p>One of my most hated message boxes is the \"Are you really sure you want to quit MYAPP?\" when the close button of the title bar is clicked.</p><p>There are also those situations where you need to go through two or more message boxes to make the application happy. For example, KMail when it first see a weak certificate (ie. self-signed certificate).</p>","replies":[{"id":"dsq-457712456","author":"Aurélien","deleted":false,"createdAt":"2011-01-22T19:49:35Z","message":"<p>Oh, yes I highly dislike those \"are you really sure you want to quit\" messages as well. I can see the point when you close by a shortcut, but not when you use the window button. It would be better to get an unobtrusive indication when you quit so that you know you accidentally triggered a quit action than such a message box.</p>","replies":[{"id":"dsq-457712680","author":"sebas","deleted":false,"createdAt":"2011-01-22T22:01:15Z","message":"<p>The risk there can be mitigated per-app, by saving state correctly. Apps that restart with the same start are highly desirable anyway, as that works much better with session management and Activities.</p><p>If apps have unsaved data and would overwrite an existing file, it's another question, of course. (\"Save\" can also be a destructive action, overwriting a needed file -- and no Undo option then.)</p>","replies":[]}]},{"id":"dsq-457711665","author":"maninalift","deleted":false,"createdAt":"2011-01-22T22:19:33Z","message":"<p>I can see the point if it is some big multimedia editing app, perhaps in a web browser, where you might have lots of tabs open and volatile information in forms on webpages.</p><p>But *not* in something like a media player (yes I'm looking at you Amarok, don't pretend you didn't hear me), it isn't a tragedy if you accidentally stop in the middle of a song is it.</p><p>Don't make it difficult to close the app, make it not be a pain to start the app up again.</p>","replies":[]}]},{"id":"dsq-457711655","author":"Markus","deleted":false,"createdAt":"2011-01-22T20:59:57Z","message":"<p>I wonder whether I am the only person in the world that notices the missing icon in the first screenshot.<br>I tried to fix like <a href=\"https://bugs.kde.org/show_bug.cgi?id=221592\" rel=\"nofollow noopener\" title=\"https://bugs.kde.org/show_bug.cgi?id=221592\">https://bugs.kde.org/show_b...</a> myself but could not understand how. In earlier SC releases missing icons where often the result of leftover code from KDE3 which did not adapt icon name changes since then. But for completely new code, I'm too dumb to understand how to fix that...</p>","replies":[{"id":"dsq-457711671","author":"Aurélien","deleted":false,"createdAt":"2011-01-23T01:52:12Z","message":"<p>I noticed it as well when I took the screenshot and I agree there is a worrying amount of dialogs which do not have a correct icon. In this case I think the icon is not the most important problem to fix though :)</p>","replies":[{"id":"dsq-457712450","author":"Markus","deleted":false,"createdAt":"2011-01-23T06:49:29Z","message":"<p>Not the most important (which are crashes and data corruption) but easy to fix. Before I went on a missing icon fixing frenzy during IIRC the SC 4.3 era, the whole SC was full of missing icons.<br>I tried submitting some of the missing icon bugs as papercuts to your 100 Papercuts thingie but since Canonical treats the whole Kubuntu as a single product -- on the same level as Nautilus and other individual applications in Ubuntu -- naturally not a single one was accepted...</p>","replies":[{"id":"dsq-457712464","author":"Aurélien","deleted":false,"createdAt":"2011-01-24T13:14:23Z","message":"<p>What I meant was that I would rather get rid of the dialog instead of fixing its icon.</p>","replies":[]}]}]}]},{"id":"dsq-457711667","author":"Hans","deleted":false,"createdAt":"2011-01-22T22:20:18Z","message":"<p>“Never use a warning when you mean undo“.</p><p>I've been thinking about this regarding panels in Plasma Desktop. If you try to remove a panel (e.g. right click -&gt; Remove this Panel\") you get a warning \"Do you really want to remove this Panel? [Remove][Cancel]\"</p><p>Despite this warning I've seen people who have accidentally removed a panel and come to the KDE Forums to ask for help. I see two problems with this message box:<br>1. The default action is \"Remove\", see Pedro's comment.<br>2. Many don't know what exactly is being asked (i.e. they don't know what a panel is). For example, one person thought it would remove the panel toolbox.</p><p>So instead of asking for confirmation, wouldn't it be better to \"remove\" the panel (e.g. by hiding it) and instead say \"The panel has been removed. [Undo][OK]\", or something similar.</p>","replies":[{"id":"dsq-457711670","author":"Aurélien","deleted":false,"createdAt":"2011-01-23T01:45:40Z","message":"<p>That would be much nicer! bonus points if you then turn the dialog into a small plasma thing which would take the place of the removed panel and would go away after 30 seconds.</p>","replies":[{"id":"dsq-457711673","author":"Hans","deleted":false,"createdAt":"2011-01-23T03:15:35Z","message":"<p>\"bonus points if you then turn the dialog into a small plasma thing which would take the place of the removed panel and would go away after 30 seconds.\"</p><p>Funny that you mention it since this was my first thought, but I'm concerned that the Plasma thingy would be covered by a window and thus hidden from the user. This can happen if a window is maximized, for example. A solution would be to make the thingy behave like an \"Always Visible\" panel, but isn't a regular message box better in that case?</p><p>Also, I'm not sure if removing it automatically after some time would be such a good idea.</p><p>By the way I'm not really a developer, but if the Plasma people think that this is a good idea I might give it a try to implement it (no promises that I'll succeed though!).</p>","replies":[{"id":"dsq-457711675","author":"Aurélien","deleted":false,"createdAt":"2011-01-23T04:16:10Z","message":"<p>I think it would be better than a message box in the sense that if removing the panel is really what you wanted to do then you do not need to confirm the removal. This is also why I think it should go away after a short delay: I don't think it would be a problem because in this case I would expect the user to realize very quickly he removed something he did not intend to remove, since a panel disappearing is something which is difficult to miss.</p>","replies":[{"id":"dsq-457712460","author":"Hans","deleted":false,"createdAt":"2011-01-24T00:41:10Z","message":"<p>And what about the \"hiding behind a window\" problem?</p><p>I can think of some scenarios where autohiding is not desired. For example: a child is messing around with his father's computer and accidentally deletes the panel. He sees the plasma thingy but don't know what to do, so he goes to ask his father. By the time they're back it's already disappeared.</p><p>Maybe it's a bit of a corner case, but I don't think it's too unlikely. In general I don't like hiding stuff after a delay, it can make it very \"stressful\" for some users. Requiring an additional click to remove a panel (as it is now) is not too bad for such a destructive action, in my opinion.</p>","replies":[{"id":"dsq-457712465","author":"Aurélien","deleted":false,"createdAt":"2011-01-24T13:19:23Z","message":"<p>I think your example is too much of a corner case.</p>","replies":[]}]}]}]}]}]},{"id":"dsq-457711672","author":"Lukas","deleted":false,"createdAt":"2011-01-23T02:30:08Z","message":"<p>One more thing - <b>screenshots</b></p><p>Despite they takes some more real estate of users screen, I still believe that adding a screenshot of what's going to be affected/done is a good idea.</p><p>Like Hans point about removing panels. I hope it is possible to capture the preview of the panel going to be removed, or al least a preview of the default one. Of course it has to be scaled and/or cropped not to take 100%of the screen, but still it is doable.</p><p>Also usage of <b>Icons</b></p><p>Most dialogs uses <b>system-run</b> icon in the title. Why? It must be the last resort of apps without icons.<br>Also, bigger scale icon could fit into dialog itself to give better visual feedback (as if screenshots is impossible to make). A example could b an <a href=\"http://png-2.findicons.com/files/icons/1035/human_o2/128/edit_bomb.png\" rel=\"nofollow noopener\" title=\"edit-bomb.png\">bomb</a> for format sdb, as it is one of the most dangerous action user can make on PC - destroy everything</p>","replies":[]},{"id":"dsq-457711676","author":"Guido","deleted":false,"createdAt":"2011-01-24T01:41:54Z","message":"<p>I think there's an even bigger problem with the “Do not ask again” check box (and the reason why I hate them):<br>You'll never know which action will be performed in the future. Will it be the same one you chose? Or the opposite? Or always the default? Always Cancel? Always format /dev/sda3?<br>If you need to use it, you should make it clear what will actually happen the next time.</p>","replies":[{"id":"dsq-457712461","author":"Aurélien","deleted":false,"createdAt":"2011-01-24T13:13:34Z","message":"<p>Very good point!</p>","replies":[]}]}]