[{"id":"dsq-457709831","author":"WishMaster","deleted":false,"createdAt":"2008-06-15T18:09:10Z","message":"<p>That is a pretty pretty cool idea. I hope somebody will take his time for writing such a containment.</p>","replies":[]},{"id":"dsq-457709832","author":"lsx","deleted":false,"createdAt":"2008-06-15T18:10:55Z","message":"<p>Yeah this would be a pretty sweet idea... Kind of like our version of the Apple Dashboard idea, but more functional.</p>","replies":[]},{"id":"dsq-457709835","author":"lucian1900","deleted":false,"createdAt":"2008-06-15T18:12:05Z","message":"<p>There already is the possibility to show the plasma screen over anything else on a key combination (much like the os x dashboard). It should be possible to make plasma hide most plasmoids (except for the bottom bar, maybe a whitelist) and have them shown only on demand.</p>","replies":[]},{"id":"dsq-457709837","author":"Tony","deleted":false,"createdAt":"2008-06-15T18:21:06Z","message":"<p>Wow, thats a really great idea! I don't like cluttering my desktop with all this stuff aswell.<br>I'm really looking forward to this. Sounds really innovative as well.</p>","replies":[]},{"id":"dsq-457709839","author":"Kame2","deleted":false,"createdAt":"2008-06-15T18:30:35Z","message":"<p>So, if i get it right, all you need is a dashboard that don't sync with the desktop (maybe a desktop that just shows a wallpaper and nothing more?). and a visual tab-based ui to change the containment.<br>i think this would be a good improvement.</p>","replies":[]},{"id":"dsq-457709841","author":"Tom","deleted":false,"createdAt":"2008-06-15T18:30:44Z","message":"<p>Very cool idea!</p><p>I only wish Konqi would work with Netvibes a little bit better.</p>","replies":[]},{"id":"dsq-457709842","author":"SVG Crazy","deleted":false,"createdAt":"2008-06-15T18:31:24Z","message":"<p>Such a great idea!</p><p>I don't know plasma API much either, but I think it can be implemented.</p>","replies":[]},{"id":"dsq-457709844","author":"Jason","deleted":false,"createdAt":"2008-06-15T18:32:39Z","message":"<p>That would be a great idea.... I've seen that on MacOSX <br>It would be cool if you press Strg+F12 and the plasmoids would like slide in or slide out...</p>","replies":[]},{"id":"dsq-457709846","author":"frinring","deleted":false,"createdAt":"2008-06-15T18:47:58Z","message":"<p>Sliding containments (=old-fashionend hiding panels) are planned for 4.2 AFAIK.</p><p>Anyway, I agree very much with your idea. That is what I wait for and miss very much, too (while coding other stuff like useless hex editors). After all KDE is a desktop _environment_, not a desktop _base_ ;)</p>","replies":[]},{"id":"dsq-457709847","author":"Tribe","deleted":false,"createdAt":"2008-06-15T18:50:17Z","message":"<p>It sounds really nice and extremely useful to me, lets see if any plasma hacker can do something about this =)</p>","replies":[]},{"id":"dsq-457709850","author":"Daniel","deleted":false,"createdAt":"2008-06-15T18:50:45Z","message":"<p>Looks like \"I want the dashboard and the wallpaper to show different containments.\"</p>","replies":[]},{"id":"dsq-457709853","author":"Jonas","deleted":false,"createdAt":"2008-06-15T18:54:22Z","message":"<p>Well, I'm no developer at all but I just wanted to say that I REALLY like this idea. Maybe I'm just too stuck in my ways but I have yet to become friends with the ZUI...love the idea but it doesn't really suit me. At least not yet.</p>","replies":[]},{"id":"dsq-457709857","author":"Firmo","deleted":false,"createdAt":"2008-06-15T19:00:04Z","message":"<p>Well, we already have something like this, the dashboard view (or whatever it's called). However i'm really looking foward an option to place the plasmoids in a \"dashboard view only\"  mode, so I can actually see my wallpaper (or maybe one or two relevant plasmoids) in the \"default\" view, and if I want to see the others I just have to hit Ctrl+F12.</p>","replies":[]},{"id":"dsq-457709859","author":"Jonathan Turner","deleted":false,"createdAt":"2008-06-15T19:04:49Z","message":"<p>I second it, this sounds like a good idea.  I'm also not a fan of plasmoids on top of my wallpaper, and I think this would be a cool way to appease those of us there are like that.</p>","replies":[]},{"id":"dsq-457709862","author":"Jonathan Thomas","deleted":false,"createdAt":"2008-06-15T19:07:30Z","message":"<p>I believe that the plan for 4.2 is that containments can be mapped to virtual desktops, so then you can use normal virtual desktop switching, which can be mapped to shortcut keys.</p>","replies":[]},{"id":"dsq-457709865","author":"Andrea","deleted":false,"createdAt":"2008-06-15T20:00:27Z","message":"<p>Wow, great idea, that sounds much better than the ZUI.</p>","replies":[]},{"id":"dsq-457709866","author":"felix","deleted":false,"createdAt":"2008-06-15T20:39:46Z","message":"<p>That sounds just perfect!</p>","replies":[]},{"id":"dsq-457709867","author":"Cláudio da Silveira Pinheiro","deleted":false,"createdAt":"2008-06-15T21:03:39Z","message":"<p>Now that's what I call inovation. :) Good idea, really good one. I hope someone implements it quick. ;)<br>But there's one thing that still bothers me: The panels aren't hidable. If somebody only implemented it...</p>","replies":[]},{"id":"dsq-457709868","author":"Kishore","deleted":false,"createdAt":"2008-06-15T21:14:41Z","message":"<p>Did you know that you can shift between activities (ZUI) using shortcuts Ctrl+Shift+N for next activity and Ctrl+Shift+p for previous?</p><p>I know ZUI is not done yet but is capable of achieving similar. What i look forward when using it is that i can have a desktop more suitable for projection when I am giving a formal presentation and have my personal workspace otherwise. This already kinda works but is not perfect.</p>","replies":[]},{"id":"dsq-457709870","author":"rememberme","deleted":false,"createdAt":"2008-06-15T21:44:21Z","message":"<p>The solution is to assign shortcuts to the different activities. You could then have an \"empty\" containment and switch with a shortcut to your \"monitor\" / \"fun\" / whatever activity.<br>What you are proposing is just a duplication of the activities idea.<br>A shortcut for zooming out / in is obvious too. The graphical interface for switching between activities must become faster and feel more natural.<br>The ZUI is very basic right now but the possibilities are endless.</p>","replies":[]},{"id":"dsq-457709875","author":"jospoortvliet","deleted":false,"createdAt":"2008-06-15T22:06:37Z","message":"<p>i don't get why ppl 'want to see their wallpaper'. What is it about that picture thats so important? Don't we have gwenview for pictures? Or digikam? Those apps show pictures, let the desktop be useful please...</p>","replies":[]},{"id":"dsq-457709876","author":"fred","deleted":false,"createdAt":"2008-06-15T22:52:28Z","message":"<p>As far as I know there are plans to make plasmoids \" fold\" into an icon. When you click on the icon, the plasmoid show itself again. Hopefully this will come with some nice animation :-).</p>","replies":[]},{"id":"dsq-457709877","author":"Jakob Petsovits","deleted":false,"createdAt":"2008-06-16T00:31:50Z","message":"<p>jospoortvliet wrote:<br>&gt; Don’t we have gwenview for pictures?</p><p>Hm... yeah, I guess Aurélien might be familiar with what can be done with Gwenview :P</p>","replies":[]},{"id":"dsq-457709878","author":"frinring","deleted":false,"createdAt":"2008-06-16T00:45:46Z","message":"<p>jospoortvliet wrote:<br>&gt; i don’t get why ppl ‘want to see their wallpaper’.</p><p>I don't see my wallpaper, because my whole screen is covered with program windows (after all I paid to use the full size ;) ).<br>All I want, and I understood Aurélien to want the same, is to have containments slide in on top of all windows. Like the hiding panels of Kicker. Or Yakuake. By a keystroke. Or by throwing the mouse at one edge/side. He, quite some games use the same, and it works.</p>","replies":[]},{"id":"dsq-457709879","author":"Aurélien","deleted":false,"createdAt":"2008-06-16T01:35:09Z","message":"<p>@frinring: You got it right, that's what I would like to have.</p><p>@a few others: I will have a look at assigning shortcut to activities. It does not really match what I am looking for, but could be a nice workaround.</p>","replies":[]},{"id":"dsq-457709880","author":"Claes","deleted":false,"createdAt":"2008-06-16T02:21:59Z","message":"<p>I like this idea too</p>","replies":[]},{"id":"dsq-457709884","author":"Erunno","deleted":false,"createdAt":"2008-06-16T02:58:01Z","message":"<p>\"i don’t get why ppl ‘want to see their wallpaper’.\"</p><p>See, you don't have to understand it and just accept that people do like to see their wallpapers for whatever reasons. For instance, my girlfriend can look at her wallpaper for hours when listening to music. Don't ask me why, it puzzles me to no end. But who am I to tell her that she is wrong doing so?</p>","replies":[]},{"id":"dsq-457709887","author":"jamasi","deleted":false,"createdAt":"2008-06-16T06:20:33Z","message":"<p>I like the idea: an yakuake style plasmoid overlay would rock. to give it some more eyecandy the animation of its apperance should be made configurable. Some ideas for this:<br>slide in from any side, fade in (transparency), bump in, ... (add more of your favourite effects from slideshow presentations)</p>","replies":[]},{"id":"dsq-457709888","author":"tictric","deleted":false,"createdAt":"2008-06-16T10:18:09Z","message":"<p>It's exactly what I already thought too. Some plasmoids you gonna have always open and on top but it's certainly going to become quite a cluttered desktop in the end.</p><p>Since I don't want anything to collide with Yakuake and find it more and more confusing to remember all those shortcuts of actions that I rarely need I'd favor a way to iconify those plasmoids. Even in a folder view could be an idea.</p><p>Plasmoids organised like files or folders in a special view.</p><p>Hmm, could become cluttered again :-)</p>","replies":[]},{"id":"dsq-457709889","author":"Rioting_pacifist","deleted":false,"createdAt":"2008-06-16T17:08:51Z","message":"<p>is there any chance that plasmoids can be made to work as screenlets? That would be a good workaround/way of implementing this</p><p>Anyway i completly disagree with the activety binding stuff, i too would like a replacement for dashboard/screenlets instead of a vista like desktop.</p>","replies":[]},{"id":"dsq-457709890","author":"Dread Knight","deleted":false,"createdAt":"2008-06-17T06:44:19Z","message":"<p>+1</p><p>I think the future is not about having some Kicker menu or just some other way of opening applications, but by having all this processing power at our fingers, it's about having all those rather 'small' applications that we use a lot rather opened all the time somewhere on the desktop, so the 'apple dashboard' idea with tabs sounds uber awsome!</p>","replies":[]},{"id":"dsq-457709892","author":"Darko","deleted":false,"createdAt":"2008-07-03T11:45:32Z","message":"<p>I've wondered why KDE doesn't have this capability builtin. I'd absolutely love it be able to invoke emacs like that.</p>","replies":[]},{"id":"dsq-457709895","author":"Luis Augusto Fretes Cuevas","deleted":false,"createdAt":"2009-01-07T00:53:21Z","message":"<p>I know it's old, but KDE 4 has support for Dashboard.</p><p>And I mean plasmoids that only show on Dashboard, not just a Desktop on top. However, it lacks a GUI dialog to configure and set it :/</p>","replies":[]},{"id":"dsq-457709896","author":"MyXelf","deleted":false,"createdAt":"2009-02-13T22:11:19Z","message":"<p>Maybe this is the solution... I haven't test it yet, but I'm sure someone will... Please feedback...</p><p><a href=\"http://aseigo.blogspot.com/2008/09/howto-decoupling-dashboard-from-desktop.html\" rel=\"nofollow noopener\" title=\"http://aseigo.blogspot.com/2008/09/howto-decoupling-dashboard-from-desktop.html\">http://aseigo.blogspot.com/...</a></p>","replies":[]},{"id":"dsq-457709901","author":"Aurélien","deleted":false,"createdAt":"2009-02-14T03:43:19Z","message":"<p>@MyXelf: this is not exactly what I am looking for (tabbed containment which would slide with a key), but I will give it a try.</p>","replies":[]},{"id":"dsq-457709902","author":"MyXelf","deleted":false,"createdAt":"2009-02-19T22:53:42Z","message":"<p>I can confirm this works on KDE 4.2 Intrepid Ibex...</p><p>@Aurelien: Maybe the activities itself is a better approach to what you \"really\" want. But it will have to be a workaround in anycase. I'm thinking about a mix of \"toggle dashboard\" with Ctrl+Shift+[N|P] functionality. I hope you get the idea...</p>","replies":[]}]