[{"id":"dsq-457710183","author":"Henry de Valence","deleted":false,"createdAt":"2009-02-01T03:31:31Z","message":"<p>I would like #1. It fits well with the browse/view idea that Gwenview already uses.</p>","replies":[]},{"id":"dsq-457710184","author":"WarDron","deleted":false,"createdAt":"2009-02-01T03:41:20Z","message":"<p>Yep, the \"picasa-variant\" looks preferable.</p>","replies":[]},{"id":"dsq-457710187","author":"David","deleted":false,"createdAt":"2009-02-01T03:48:23Z","message":"<p>I would like #1 too. And optionally show more information in browse mode under thumbnails.</p>","replies":[]},{"id":"dsq-457710188","author":"Robert Kaiser","deleted":false,"createdAt":"2009-02-01T06:19:46Z","message":"<p>Here's another vote for #1 - and if I could launch Gwenview browse mode for a directory when right-clicking it in Dolphin's folder sidebar, that would be really cool then ;-)</p>","replies":[]},{"id":"dsq-457710189","author":"mutlu","deleted":false,"createdAt":"2009-02-01T07:10:44Z","message":"<p>I agree. One seems to fit best with how Gwenview works so far. And given that rotation is available directly on the picture, the most frequently used tool (and the only one I use in browse mode) is available in browse mode, too.</p><p>Btw., you are doing amazing work! I love Gwenview. Thank you very much for it. :)</p>","replies":[]},{"id":"dsq-457710190","author":"Apetrini","deleted":false,"createdAt":"2009-02-01T07:12:22Z","message":"<p>Nice ideas.<br>But... I think the gwneview \"integration\" in dolphin could be very usefull. So if you want you can start gwenview alone, but you can also switch in \"gwenview mode\" inside dolphin.</p><p>Maybe in the future...</p><p>However I really apreciate your work.</p><p>Sorry for my poor english.</p>","replies":[]},{"id":"dsq-457710191","author":"amir","deleted":false,"createdAt":"2009-02-01T11:27:27Z","message":"<p>thank you for the great job with Gwenview. the most important is to get a folder list as a sidebar in the view mode, which render the browse mode unnecessary.  the best for me is to add a sidebar like the iphoto one to the existing view mode and dropping the current sidebar. this will make my mother very happy (which is most important ; ) ).</p>","replies":[]},{"id":"dsq-457710192","author":"TheBlackCat","deleted":false,"createdAt":"2009-02-01T12:45:53Z","message":"<p>I think there are a few other ways to do things:</p><p>1. Implement the sidebar in the same way as dolphin's panels.  That is they can be dragged to whichever side of the screen you want, but tabbed, have on above the other, or be on opposite sides.  Doing that allows the user to choose any of the layouts you just mentioned.  This has the added advantage of being more flexible, you can add additional panels in the future with having to worry as much.  It has the disadvantage of making it hard to hide the whole thing, since people might want to hide one panel or both.  However, making it so wherever there is a panel there is a collapse/expand button.  Perhaps it would be in the form of an arrow in the top inner corner of the panel pointing towards the top outer corner.  So for a panel on the right the arrow would face to the right and be in the upper left corner of the panel.  When collapsed, the arrow would switch direction.  Alternatively, there could just be separate toolbar buttons for each panel.</p><p>2. Similar to the above, except the panel always has a tab (even if there is only one) and the tab is vertical.  Clicking on it when that panel is open hides it.  Clicking on it when another panel is open switches to that panel (when the two panels are stacked).</p>","replies":[]},{"id":"dsq-457710196","author":"TheBlackCat","deleted":false,"createdAt":"2009-02-01T12:46:39Z","message":"<p>I should add that my option 2 is how Amarok 2 currently implements the collection manager on the left.</p>","replies":[]},{"id":"dsq-457710199","author":"Michael","deleted":false,"createdAt":"2009-02-01T13:18:59Z","message":"<p>Hi,</p><p>I really love gwenview especially the new nepomuk features :-)<br>I like the simple detail view of dolphin. I think it has to be similar to dolphins detail view.<br>It would be nice to allow the dragging of that icons which appear if you select a file. Than you are able to show one item per action.<br>For example one to rotate the image and one to mirror it. If you click on it you move your mouse to the left or right or bottom or top and perhaps you can prewiew it in the thumbnails. <br>I think it would be also good to show the icons centered as an overlay and seperate the selection from that action icons. Then it looks like in dolphin and if you select more than one picture there ist an dark overlay to all of that pictures and in the center of that overlay you can show the \"draggable\" actions.<br>I think this would be really good :-). Because the actions will affect all pictures and the actions are shown only on one picture.<br>Buts thats a little much or?<br>To my opinion the current sidebar is to much. The folder operations are covered by a folder view.<br>With the above idea the image operations would be covered and would left only detail informations.<br>I think is currently good. I don't have problems with the current layout. The only thing I really don't like is that the meta infos never fit into my Panel. (I have Date and Time (original) in it...)</p>","replies":[]},{"id":"dsq-457710200","author":"helge","deleted":false,"createdAt":"2009-02-01T14:41:53Z","message":"<p>Thats great! I have really  been waiting for the folder-panel to appear again.</p><p> A notice to the detail-info-sidebar: the font is very small there, and by applying a new font-size to all components in systemsettings does not help.</p>","replies":[]},{"id":"dsq-457710205","author":"Alan","deleted":false,"createdAt":"2009-02-01T20:01:11Z","message":"<p>Instead of / as well as a folder view side bar breadcrumbs as a toolbar available in both browse and view modes wouldn't take up much screen real-estate and would make navigation easier. I'll bet an awful lot of photo galleries are set up n a hierarchy and this would map onto breadcrumbs neatly.</p>","replies":[]},{"id":"dsq-457710212","author":"Stefano Canepa","deleted":false,"createdAt":"2009-02-02T02:29:08Z","message":"<p>I vote for number #3 as an Evolution user I like it's interface.</p>","replies":[]},{"id":"dsq-457710213","author":"illissius","deleted":false,"createdAt":"2009-02-02T04:33:41Z","message":"<p>All I can say is: KISS. I love Digikam for many things, but its UI is a cluttered mess. Sidebars and widgets and subwidgets everywhere. Please do try to stay away from that.</p><p>I actually quite like the current sidebar, and haven't felt the need for a folder sidebar. (But then I don't use browse mode either - I use Dolphin for that.)</p><p>Upon some thought, the solution I like best would be to have a separate section at the top of the current sidebar with a single operation in it -- \"Browse Images\" or \"Open Image\" -- which, when you click on it, would expand into a folderview you can browse with. This would (a) retain the elegant simplicity of the current sidebar, (b) accomplish the goal, and (c) actually, I think, be more discoverable than options (1), (3), and depending on implementation (4), because it uses the same UI as the rest of the sidebar: people see that it's a sidebar and that it's got operations and stuff in it, but they may not expect to also look for tabs or mode-switching buttons, and so may simply miss them. Whereas another operation is right there (at the top of the list) and obvious.</p><p>A few other things now that I'm commenting here, because I'm lazy to file bugs and <a href=\"http://bugs.kde.org\" rel=\"nofollow noopener\" title=\"bugs.kde.org\">bugs.kde.org</a> hasn't been cooperative lately either:</p><p>- This is probably on your TODO list, but having the Resize dialog show both dimensions instead of just one would be helpful.</p><p>- Currently, if I open an image via the http kioslave, it doesn't let me rotate it or anything because it's not locally stored. But I don't see why it couldn't let me rotate it in memory - just so I can, you know, view it rotated - and then maybe do a save as later. And only give an error if I actually try to save over http.</p><p>- Please, please bring back gamma adjustment post-haste. This was the killer app of the KDE3 Gwenview for me. Whenever I came across a photo that was too bright or too dark, I pressed ctrl-(shift)-G a few times, and like magic, it was fixed -- as if the photo had been taken at that level of brightness in the first place. It might even be an idea to make this feature more prominent (by, say, putting it on the sidebar), because I'm pretty sure that most of the time, when people want to brighten or darken an image, what they <i>really</i> want is this.</p><p>Thanks!</p>","replies":[]},{"id":"dsq-457710217","author":"Mik Mike","deleted":false,"createdAt":"2009-02-02T13:14:43Z","message":"<p>Hello,<br>please make Gwenview sidebar draggable, same way as in Dolphin. I really don't understand why the sidebar in Gwenview is fixed and doesn't use standard Qt 4/ KDE 4 draggable dock widgets :-(</p>","replies":[]},{"id":"dsq-457710219","author":"Aurélien","deleted":false,"createdAt":"2009-02-02T14:12:14Z","message":"<p>As often, writing about a problem, helps me refine a solution, often just after pressing the \"Publish\" button... In this case I realized the Picasa solution may not be appropriate because one of the user grief with the new Gwenview is that it's difficult to change folders while in view mode... :(</p><p>About draggable sidebars:<br>I do not believe draggable sidebars is the solution: it just gives user more widgetry to mess with, I'd rather find a solution which is immediatly useful for most users without having to fine tune it.</p>","replies":[]},{"id":"dsq-457710222","author":"maninalift","deleted":false,"createdAt":"2009-02-02T14:35:08Z","message":"<p>I like the option of implementing th panels in a flexible way like Dolphin.</p><p>I _don't_ like the Picasa \"modes\" option. Another thing I'd really like is to see in gwenview and throughout KDE is keyboard short-cuts displayed in the tooltips--- I often find myself hunting though the menus for an option that I can find in the toolbar just so that I can see what it's keyboard short-cut is.</p><p>which brings me to an another KDE interface \"wish\" - that is making the menu searchable. So that from inside any KDE app you can hit a keyboard short-cut start typing and you will get a progressive search of your menus. This could be a quicker way of executing commands than actually using the menu: Think KRunner for  in-application actions.</p>","replies":[]},{"id":"dsq-457710223","author":"TheBlackCat","deleted":false,"createdAt":"2009-02-02T21:51:03Z","message":"<blockquote>I do not believe draggable sidebars is the solution: it just gives user more widgetry to mess with, I’d rather find a solution which is immediatly useful for most users without having to fine tune it.</blockquote><p></p><p>These two solutions are not mutually exclusive.  What I think would be best would be for you to figure out a layout that is optimal for the largest possible number people and use that as the initial layout people see when they first open Gwenview.  Most users will just leave it as-is, since it is a good layout.  However, since the panels are draggable, for (hopefully) much smaller subset of users who do not like the layout you picked they will be able to change it.  The idea is to come up with a sensible default layout that most people will be happy with, but still retain enough flexibility that you don't force the minority group to use a layout they do not like.</p>","replies":[]},{"id":"dsq-457710226","author":"Michael","deleted":false,"createdAt":"2009-02-09T15:11:31Z","message":"<p>I hope it will be possible to browse quickly through different folders like in the kde3 versions, where you could navigate through the folders with the folder tree on the upper left using the arrow keys on your keyboard and see the thumbnails on the right and a big preview bottom left. This was great! I really miss this in KDE4.</p><p>I don't use gwenview for image manipulation (I use gimp instead), so it is not really used anymore because browsing is just combersume right now. :(</p><p>Part from that, the KDE3 version was just great and I'm looking forward for the folder tree.</p>","replies":[]},{"id":"dsq-457710227","author":"Ben Selinger","deleted":false,"createdAt":"2009-03-03T04:04:28Z","message":"<p>:(  I just want gwenview to play my images back to me properly again.  Ever since the push to 4.x, I've found that while gwenview has become more advanced, and has a lot of interesting features being implemented, its functionality has dropped off the radar.</p><p>-Why did all the default hotkey's change?<br>-What happened to image pre-loading (next and previous in sequence should pre-load)<br>-Why is automatic image scaling still broken? (scale just forgets to work for large images)<br>-Full screen mode looks great... if you have a quad core 1.8Ghz machine with &gt;2Gb of Ram.  Not so much on a netbook, which has no problem performing the same operation using gqview (gqview performs all operations 10x faster)<br>-I want my thumbnail view on the side, scrolling vertically.  Why can't I do this?<br>-Where did animated gif support go?   Used to be great!</p><p>I know I'm just crying.  I just really miss having ANY image viewing application available to me.  I would take the old Gwenview over the new one any day at this point, but its a huge amount of work because of the dependencies.</p><p>Are any of these issues being addressed?</p>","replies":[]},{"id":"dsq-457710229","author":"Ulrich","deleted":false,"createdAt":"2009-03-07T20:02:52Z","message":"<p>Hi,</p><p>As to the four options, I wold like a folder view in \"view mode\".</p><p>Plus, the feature I miss most from the older versions is the possibility to:</p><p>display the preview bar on the side, instead of the bottom of the screen in view mode...</p>","replies":[]},{"id":"dsq-457710231","author":"Gerrit","deleted":false,"createdAt":"2009-04-15T20:08:06Z","message":"<p>The current solution (Tabs in the sidebar) in the SVN build is annoying. I have no use for a browser bar (I would like to disable it) and both the info and the edit tab take only (less than) half of the space on the sidebar. Please don't split it, because it makes it less useful.<br>Also, it looks ugly.</p><p>I love gwenview, even more after I dicovered all the stuff I can do with the plugins.</p>","replies":[]},{"id":"dsq-457710243","author":"Loved the old Gwenview much mo","deleted":false,"createdAt":"2009-04-20T12:29:40Z","message":"<p>Did you all get bored with the old gwenview?  I used it as a tool and as I did not like any database version of a photo app, so the old Gwenview was much loved, and now it is forgotten?  Now, for me, with the new one, can't get Kipi Plugins to work with Ubuntu, miss all the nice features of the old Gwenview, and the Ubuntu Repository (from the Add/Remove button) has ONLY now the KDE 4 version and can't get the old version (that is terrible).</p><p>I also don't like Evolution installed and hate Spot?  Like Thunderbird and the Old Gwenview mix (with Thunderbird like the Synch Kolab extension allowing contacts to be save up on an IMAP server in a folder there, of course GMail now has IMAP features too).</p><p>I do worry about KDE 4 as netbooks are what everyone is using these days, and KDE 4 with it's desire for more resouces, if really slow on a netbook for me.   So?</p><p>And... the future of computing is not the fast CPUs anymore as they take too much power to do simple tasks.   With the Pixel Qi screens  starting to come available where it is possible to have a 5 fold increase in battery time, and sunlight readable too... I can see these devices moving from netbook use to desktop use in all corporations, where they can reduce their IT electrical costs by 5 times, and if the unit has an OLPC like $10 user replaceable battery with 18 hours of back up use, then if a power outage, then the company is not shut down, AND they could power the entire IT desktop power use from solar panels on the roof.</p><p>(go to Pixel Qi, or search google for Mary Lou Jepsen's video interviews at Big Think to get an idea of where GREEN computing is headed, all started at OLPC, but really where power is not available in a 3rd world country and OLPC's low power works, then at any company in the world where folks just use email, small spreadsheet, web apps, then you don't need a fast CPU, so why not do the same as what OLPC is doing at the corporate level, or at home too?  Why not go as green as you can by using as low a power using computer as you can get... that just makes dollars and sense to be green like that)...</p><p>Where does KDE 4 (power hungry) sit in that scenerio for a greener earth?</p>","replies":[]},{"id":"dsq-457710245","author":"le Zaps","deleted":false,"createdAt":"2009-05-01T13:45:10Z","message":"<p>The old gwenview one is perfect (it looks like Dolphin in kde4)</p><p>Don't change what is working well !</p>","replies":[]},{"id":"dsq-457710253","author":"Hiasll","deleted":false,"createdAt":"2009-05-30T12:05:48Z","message":"<p>First of all, thank you for the new release!</p><p>I miss two features though which were available in earlier releases:<br>-) In View Mode: The number of pictures in the directory (10/200) in the left bottom corner. (Now there is the \"Thumbnail Bar\" Button)<br>-) The keyboard shortcuts for Home/End are not available. I cannot jump to the first/last picture with just one keystroke.</p><p>Thanks for your attention! :-)</p>","replies":[]},{"id":"dsq-457710256","author":"Marx","deleted":false,"createdAt":"2009-06-18T15:43:38Z","message":"<p>Bring back folder view from KDE 3.5, please.<br>Also, I have to agree with \"Hiasll\" about keyboard shortcuts.</p>","replies":[]},{"id":"dsq-457710265","author":"Flavio","deleted":false,"createdAt":"2009-09-26T03:16:27Z","message":"<p>Please!  Add an option (somehting like a button or checkbox) to show files that are not images. I like Gwenview interface so much that I decided to use it as my default file manager, even I know it wasn't build to accomplish that function.<br>Thank you very much</p>","replies":[]}]
