[{"id":"dsq-457710564","author":"Paul","deleted":false,"createdAt":"2009-07-07T15:19:37Z","message":"<p>That's incredible. It's the small, slick interactions that really polish the application off. You rock.</p>","replies":[]},{"id":"dsq-457710565","author":"Jon","deleted":false,"createdAt":"2009-07-07T15:22:03Z","message":"<p>I like Gwenview, but I really don't like the loading times. Would it be possible to enhance it in a way so that opening a simple jpg does not take 5 seconds on my netbook?<br>I mean a whole distro starts in 5 seconds. There has to be major room for improvement.</p>","replies":[]},{"id":"dsq-457710566","author":"Cyril","deleted":false,"createdAt":"2009-07-07T15:35:14Z","message":"<p>Gwenview is one of the best single apps i've ever seen, ny and way better than any other image viewing application in Linux or Windows (although irfanview is nice, too).<br>Keep up your good work! :-)</p>","replies":[]},{"id":"dsq-457710568","author":"sheytan","deleted":false,"createdAt":"2009-07-07T15:38:41Z","message":"<p>Hell yeah! I wish Gwen were some kind iPhoto 09 like. And i LOVE that crop dialog!</p>","replies":[]},{"id":"dsq-457710563","author":"redm","deleted":false,"createdAt":"2009-07-07T16:15:02Z","message":"<p>Only very few apps in KDE (or actually in the entire open source world) have such a level of polish and perfection and are so straight to the point as Gwenview!! Keep it up, you rock!!</p>","replies":[]},{"id":"dsq-457710562","author":"Elvis Stansvik","deleted":false,"createdAt":"2009-07-07T16:23:06Z","message":"<p>Looks great, especially the little crop dialog. A minor suggestion:</p><p>The minimize button of the dialog looks kind of like a \"confirm\" button. Maybe make it look like a little down arrow (when the dialog is on top of the crop area) or an up arrow (when the dialog is below the crop area) instead?</p>","replies":[]},{"id":"dsq-457710561","author":"Abc","deleted":false,"createdAt":"2009-07-07T16:30:06Z","message":"<p>I very much like how the crop settings adjust their position if the box gets close to the border of the image.</p><p>However, I wonder why the number of thumbnail rows needs a separate configuration. Can't you make that auto-adjust itself based on the width of the frame on the side?</p>","replies":[{"id":"dsq-457710579","author":"Aurélien","deleted":false,"createdAt":"2009-07-07T19:01:22Z","message":"<p>It needs a configuration because resizing the thumbnail bar makes the thumbnails go bigger or smaller. Gwenview 2.0 had a \"Preview Mode\" where you would adjust the thumbnail size with a slider and the column count by adjusting the thumbnail bar size, but it turned out to be difficult to adjust.</p>","replies":[{"id":"dsq-457710612","author":"eMPeee584","deleted":false,"createdAt":"2009-08-29T00:52:13Z","message":"<p>mmmhhm not sure where that thumbnail bar can be found, but i really would like to have bigger thumbs in browsing mode... please if you have the time, try faststone image viewer, it's a really great piece of windows freeware and works well with WiNE.. especially the fullscreen interface is way top at the usability front.</p>","replies":[]}]}]},{"id":"dsq-457710557","author":"Elvis Stansvik","deleted":false,"createdAt":"2009-07-07T16:49:46Z","message":"<p>Ah, I just realized that it is a checkbox and that is its style. It makes kind of more sense, so nevermind ;)</p>","replies":[]},{"id":"dsq-457710554","author":"Manfred","deleted":false,"createdAt":"2009-07-07T16:58:25Z","message":"<p>I really appreciate your work and use Gwenview and Digikam on a daily basis.</p><p>But I still cannot understand why I have to use eg. Dolphin for a quick overview when it comes to RAW files that I don't want to import into Digikam yet.</p><p>Regards<br>Manfred</p>","replies":[]},{"id":"dsq-457710572","author":"Iuri Fiedoruk","deleted":false,"createdAt":"2009-07-07T17:21:55Z","message":"<p>What I want for gwenview is that the scrollbar resets it's position when you change between pictures.<br>You know, you have a large image and scroll all the way down (think of a comic book), then you go to the next one and... have to scroll all your way up and then start scrolling down again. Very annoying thing :)</p>","replies":[]},{"id":"dsq-457710573","author":"Svein","deleted":false,"createdAt":"2009-07-07T17:59:11Z","message":"<p>Can the new crop mode be turned off? I really HATE getting things on top of the picture. I want it out and away. The crop as it is now is almost ok. There are a couple of things that could be added:</p><p>Set a fixed size and crop to it so it resizes and crops at the same time (like you can in Photoshop).</p><p>Apply the crop by pressing Enter so you do not have to click on the Crop button.</p><p>In addition, there are a couple of things I am missing from Gwen:</p><p>I want to be able to set both horizontal and vertical number of pixels when I resize. It is not always the horizontal number of pixels that is the most important.</p><p>And a big one: I have not found out how I can save as PNG... Why? Right now, I have to open GIMP just because of this.</p><p>With these things in place, Gwenview covers 90% of the work I need to do on pictures for web.</p><p>If we can get some advanced settings for tweaking quality, compression etc. for the different formats similar to the \"Save for web\" settings in Photoshop, things would be perfect :-) I am not talking about the interface or the complete functionality, just the different settings.</p>","replies":[{"id":"dsq-457712115","author":"Aurélien","deleted":false,"createdAt":"2009-07-07T19:04:33Z","message":"<p>You can adjust horizontal and vertical number of pixels either by the handles or by turning on the \"Advanced settings\" and entering values in the width and height spin boxes.</p><p>You can save as PNG: just go to \"File &gt; Save As\".</p><p>Other things you ask for are out of the scope of Gwenview in my opinion.</p>","replies":[]}]},{"id":"dsq-457710574","author":"max","deleted":false,"createdAt":"2009-07-07T18:32:19Z","message":"<p>One incredibly useful yet simple feature when cropping an image is the ability to quickly preview the result, as seen e.g. in Picasa.</p><p>Here the crop hud for cropping is simply gorgeous, but if i'm not happy with the crop i have to undo it completely. But then i lose the previous crop rectangle position/size, which is a bit annoying if i'd like to do minor adjustments.</p><p>Just my 2 cents for improving this already awesome app :-)</p>","replies":[{"id":"dsq-457710580","author":"Aurélien","deleted":false,"createdAt":"2009-07-07T19:06:01Z","message":"<p>This is a very good point. Adding this to my TODO list.</p>","replies":[]}]},{"id":"dsq-457710576","author":"crash0","deleted":false,"createdAt":"2009-07-07T18:45:05Z","message":"<p>would it be possible to include a simple \"rename file\". right now you have to misuse the \"move\" feature. but i think just a simple dialog with the ability to rename the file would be really useful, especially since gwenview in kde 3 had the rename functionality.<br>right now i have to use gqview for the rename use case.</p>","replies":[{"id":"dsq-457710583","author":"Aurélien","deleted":false,"createdAt":"2009-07-07T19:06:20Z","message":"<p>Yes, it's in my TODO list.</p>","replies":[]}]},{"id":"dsq-457710587","author":"Iudoz","deleted":false,"createdAt":"2009-07-07T19:22:47Z","message":"<p>Hi Aurelien,</p><p>I am absolutely in love with your tremendous app. I really think this is the best image viewer we've never had on linux by far!<br>I got only one trouble: when I open a folder containing about 100-200 photos in \"browse\" modality the program \"freeze\" (without generate any thumbnail) for several seconds and I'm not able neither to move the vertical scroll bar. After these 5-10 seconds the thumbnails are loaded very very quickly. Is this behaviour normal or there is something wrong with the packages of my distro (kubuntu)?<br>Can be the thumbnail generation improved?<br>Thank you very much for your beautiful app!</p>","replies":[]},{"id":"dsq-457710584","author":"djvujke","deleted":false,"createdAt":"2009-07-07T22:02:17Z","message":"<p>I miss tree view in gwenview.<br>Please, but please, implement it.<br>i cant find my way with current folder organisation.</p>","replies":[{"id":"dsq-457710585","author":"Aurélien","deleted":false,"createdAt":"2009-07-07T22:39:41Z","message":"<p>It's in the upcoming version (KDE 4.3)</p>","replies":[]}]},{"id":"dsq-457710590","author":"Victor","deleted":false,"createdAt":"2009-07-07T22:56:38Z","message":"<p>Hope this<br><a href=\"https://bugs.kde.org/show_bug.cgi?id=199264\" rel=\"nofollow noopener\" title=\"https://bugs.kde.org/show_bug.cgi?id=199264\">https://bugs.kde.org/show_b...</a><br>will also be sometime implemented, at least partially.<br>It is very convenient to use '/' key to zoom to fit, '*' - zoom to original dimension, '-' - zoom out and '+' to zoom in.</p>","replies":[]},{"id":"dsq-457710591","author":"KDS","deleted":false,"createdAt":"2009-07-07T22:58:42Z","message":"<p>Very nice, I am already using Gwenview 2.3 in KDE 4.3rc :)</p><p>I would also wish a faster startup of Gwenview for the next release.</p>","replies":[]},{"id":"dsq-457710592","author":"Dread Knight","deleted":false,"createdAt":"2009-07-08T02:41:42Z","message":"<p>Gwenview even beats the crap out of that shitty DragonPlayer. Well done.</p><p>Please make the following hotkeys default alternatives:</p><p>F - Fullscreen<br>right arrow - next<br>left arrow - previous</p><p>I know it's not the place for bugfixes/suggestions, but I find it very lame those aren't set up like that by default and I'll probably even make a proper bug report (I fucking hate bugzilla... home gnome/kde will use launchpad soon, when opensourced).</p>","replies":[]},{"id":"dsq-457710594","author":"Svein","deleted":false,"createdAt":"2009-07-08T03:49:28Z","message":"<p>I have looked and looked. Using Gwenview 2.2.4 and can not find any way of setting vertical resolution when I resize... But they say the eyes go blind first :-)</p><p>Also, I can not see any Avanced settings in the resize dialog... What am I missing? Where is it supposed to be?</p><p>Any forum or irc channel where I can ask about this?</p>","replies":[{"id":"dsq-457712116","author":"Aurélien","deleted":false,"createdAt":"2009-07-08T11:53:38Z","message":"<p>Oh... I thought you were talking about cropping, not resize... There is no advanced settings in the resize dialog. Sorry.</p>","replies":[]}]},{"id":"dsq-457710595","author":"Paul Gideon Dann","deleted":false,"createdAt":"2009-07-08T13:17:06Z","message":"<p>Maybe you've already tried this, but I can't think why it wouldn't work -- to make the widget transparent, have you tried using a QGraphicsScene, and adding the bar on top of the video with reduced opacity?  I've used that technique to create a semi-transparent desktop popup-toaster notification.</p>","replies":[{"id":"dsq-457710602","author":"Aurélien","deleted":false,"createdAt":"2009-07-10T01:12:39Z","message":"<p>Will give it a try. Thanks for the suggestion!</p>","replies":[]}]},{"id":"dsq-457710598","author":"Marisn","deleted":false,"createdAt":"2009-07-08T14:30:45Z","message":"<p>I hope that video playback feature can be disabled, as it's one of those features I *hate* in Gwenview 1.4. Simple configuration checkbox \"Play videos\" would be just fine.</p>","replies":[{"id":"dsq-457710605","author":"Aurélien","deleted":false,"createdAt":"2009-07-10T01:15:20Z","message":"<p>I can see how it could be painful in Gwenview 1.4 because video would automatically start in browse mode. It's not the case in Gwenview 2.3: a video only plays when you are in view mode. So they will only play if you open it explicitly or go through images and photos.</p>","replies":[]}]},{"id":"dsq-457710601","author":"maniacmusician","deleted":false,"createdAt":"2009-07-08T14:53:46Z","message":"<p>It's really great, using 2.3.0 at the moment. A couple of gripes / comments (doesn't everyone, though?):</p><p>- Can you include a configuration option for toggling video playback? Or at the very least, require the user to initiate playback when in \"View\" mode? It's really jarring to stumble upon a video while browsing a folder of images, and suddenly have blaring, too-loud audio hit you in the face because the volume for the video was set too high.</p><p>- The Page Up and Page Down buttons seem to move the user to the next or previous image, which I believe is an incorrect behavior for two reasons: (1) This action is already assigned different default shortcuts (Space, Backspace).  (2) I think PgUp &amp; PgDn have traditionally been meant for navigation within the loaded document, or in this case, image. This is most apparent when dealing with vertically large images, such as standard page scans (which also encompasses comic books, mentioned by another commenter)</p><p>I thought the second bullet might be an issue with my shortcuts configuration, but it was the same on a fresh account. It's also weird that it does this despite having different values set in the Configure Shortcuts dialog. When I try to set Next to PgDown in order to use space / shift + space for vertical navigation, it denies me and says that PgDown is ambiguous, though it doesn't seem to be.</p><p>Anyways, those have really been the only things for me that were worth a complaint, which is saying a lot. Brilliant job on this application.</p>","replies":[]},{"id":"dsq-457710604","author":"John S","deleted":false,"createdAt":"2009-07-13T18:40:18Z","message":"<p>When I finally get around to trying Gwenview, one thing that irritates me is that I can't choose the zooming algorithm. From what I understand, there used to be an option in the past or something. <br>Every other image viewer has it, or uses a sensible algorithm by default. So perhaps this is not Gwenview's fault and there is a hidden setting somewhere? Currently using v 2.2.2 and wondering if there's an option in the next version.</p><p>I myself don't need any fancy image manipulating at all in my viewer, or video support. But what I want is a consistent viewer for all my images with some tag support (.svg and .gif, wow), and Gwenview is just that kind of program. Better startup time is always good, even though I'm not hoping it will be as quick as feh or anything.</p>","replies":[{"id":"dsq-457710610","author":"Aurélien","deleted":false,"createdAt":"2009-07-15T11:12:40Z","message":"<p>Please define \"sensible algorithm\".</p><p>Gwenview algorithm uses smooth zoom if zoom &lt;= 2 and fast zoom otherwise, on the basis that if the user zoom the image more than twice, he is more likely to be interested in crisp pixel representation, for example to fine-tune a crop. It&amp;#039s a sensible algorithm to me :)</p>","replies":[{"id":"dsq-457712117","author":"John S","deleted":false,"createdAt":"2009-07-15T14:06:20Z","message":"<p>Saying 'zooming algorithm' was definitely a bit ambiguous of me there. Perhaps resampling algorithm? Luckily it looks like you understood my rambling there.<br>But what you said is interesting, it seems it is indeed a feature, like in this pic, at 25% Gwenview would start to behave like gThumb, and then at 200% the pixels would be crisp. <br><a href=\"http://i29.tinypic.com/37l14.png\" rel=\"nofollow noopener\" title=\"http://i29.tinypic.com/37l14.png\">http://i29.tinypic.com/37l1...</a></p><p>I might understand the reasoning behind that choice. Then again I might not, who knows. Just that I usually have multiple, small windows open, and such 'distorted' images certainly aren't the best visual clues, especially if there's text/graph involved (sometimes white text would turn bluish). I'm definitely not complaining about the pixels being crisp at 200% however, that's a much needed one.<br>Sorry if I didn't get why you did it. An option would be very nice, or you could make it smooth by default methinks...</p>","replies":[{"id":"dsq-457712613","author":"Aurélien","deleted":false,"createdAt":"2009-07-17T00:20:23Z","message":"<p>I understand better now. So you would like a nicer scaled output? For now Gwenview uses Qt scaling algorithms. I might try to implement nicer algorithm later, but it's quite low in my TODO list.</p>","replies":[]}]}]}]},{"id":"dsq-457710611","author":"noska","deleted":false,"createdAt":"2009-08-23T15:29:04Z","message":"<p>Gwenview is great ! I welcome the return of the video.  However gwenview crashes in slideshow mode when it's a video (but it works in fullscreen without slideshow).</p><p>J'attendais avec impatience le retour de la vidéo, c'est vraiment super. Seulement dommage que ça ne marche pas très bien en mode diaporama : gwenview plante à chaque vidéo (en revanche ça ne plante pas en plein écran sans diaporama).</p><p>Le nouvel outil de recadrage est vraiment très bien. J'aurais aimé avoir \"16/9\" dans la liste (j'imagine que c'est présent pour ceux qui ont un écran 16/9), ça aurait été plus utile que les autres choix disponibles.</p><p>Bravo, gwenview est vraiment excellent !</p>","replies":[]},{"id":"dsq-457710615","author":"Jacob Wintersmith","deleted":false,"createdAt":"2009-11-03T02:58:06Z","message":"<p>Maybe I'm blind, but I can't figure out how to reorient the thumbnail bar vertically or otherwise configure it. Help?</p>","replies":[{"id":"dsq-457710621","author":"Jacob Wintersmith","deleted":false,"createdAt":"2009-11-03T03:02:11Z","message":"<p>I finally found it -- 5 seconds after posting. Maybe a little blind :(</p>","replies":[]}]},{"id":"dsq-457710622","author":"Ruairi","deleted":false,"createdAt":"2009-11-11T14:23:22Z","message":"<p>Hi,<br>    When I try to crop a photo in 2.3.2 (Kubuntu 9.10) there are no \"grabbers\" to indicate where to resize the image. I have to move the mouse up and down the edges until it changes... Is this a setting / theme error or should I go file a kubuntu bug...</p><p>Ruairi</p>","replies":[{"id":"dsq-457712120","author":"Aurélien","deleted":false,"createdAt":"2009-11-12T21:31:09Z","message":"<p>I need to investigate this. I had the same problem but it was only on a specific user! Can you try running Gwenview as a different user to see if it changes anything?</p>","replies":[]}]},{"id":"dsq-457710613","author":"irlandes","deleted":false,"createdAt":"2009-11-27T05:54:19Z","message":"<p>I think it was on your Importer page, I just posted on the fact that 2.3.2 in Kubuntu 9.10 crop is sick.  No 'handles' if that is what you call them.  It worked really great in Kubuntu 9.04.  I have had to use CONVERT from Imagemagick to crop, which really sucks.  Sounds like I am seeing the same problem. Dell Vostro A860 here.</p>","replies":[{"id":"dsq-457712118","author":"Aurélien","deleted":false,"createdAt":"2009-11-28T03:21:42Z","message":"<p>It is a nasty problem, which does not seem to happen on all computers. I need to fix it, but until it is fixed, you can crop nevertheless: the crop handles are still there, but they are invisible. Move the mouse to the corner of the image, until you notice that the cursor change to a diagonal double arrow. You can now drag the corner.</p>","replies":[]}]},{"id":"dsq-457710626","author":"David","deleted":false,"createdAt":"2009-12-16T02:42:15Z","message":"<p>I too don't have any grab handles when I crop. Makes cropping a very difficult task. Initially I thought it was just not working but watched the video and saw what I am supposed to see.</p><p>Its a real downer ! I used Gwenview mainly for its elegant cropping ability, now its all gone away !</p><p>I'm using Gwenview in Gnome, noticed this problem since I updated to Ubuntu 9.10</p><p>David</p>","replies":[{"id":"dsq-457712125","author":"Aurélien","deleted":false,"createdAt":"2009-12-16T03:07:57Z","message":"<p>The good news is: I fixed it in Gwenview 2.4 (KDE 4.4). I am going to try to get an SRU (Stable Release Update) to get the version in Ubuntu 9.10 updated.</p>","replies":[]}]},{"id":"dsq-457710627","author":"David","deleted":false,"createdAt":"2009-12-16T12:00:25Z","message":"<p>Thats great news indeed !</p><p>Thanks, I really like Gwenview. Maybe I need to revert back to KDE, I abandoned it in a rage when 4.1 was so unstable but Gnome is so limited ....</p><p>David</p>","replies":[]},{"id":"dsq-457710625","author":"Staffan","deleted":false,"createdAt":"2009-12-22T20:30:18Z","message":"<p>It would be nice to be able to disable video viewing. Or at least, make them not start automatically.</p><p>I often open up my download folder and start gwenview to look through all downloaded images. Often there happens to be a video downloaded as well, and I usually am not interested in looking at it while browsing through the images. Right now, I had about ten videos and five photos and had to click on each photo one after the other (in dolphin) to avoid starting a lot of videos while looking at photos.</p>","replies":[{"id":"dsq-457712122","author":"Aurélien","deleted":false,"createdAt":"2009-12-22T21:17:18Z","message":"<p>Unfortunately, I was short of time to implement this. A workaround can be to filter out the videos:<br>- In \"Browse\" mode, Click on \"Add Filter\" in the status bar<br>- Select \"Filter by Name\"<br>- Select \"Name does not contain\"<br>- Enter something like \".avi\" (or whatever your videos are) in the text entry</p>","replies":[]}]},{"id":"dsq-457710629","author":"amir","deleted":false,"createdAt":"2010-01-27T02:05:02Z","message":"<p>Dear Aurélien;</p><p>i would like to suggest you to add \"Horizontal Scroll bar\" to \"folder tree\" tab of \"Sidebar\" (I couldn't find anything in settings for customizing the folder tree)<br>It's annoying when working with deep branches in folder tree or browsing the long names. here it is a screenshot:<br><a href=\"http://img2.pict.com/28/69/af/2650781/0/800/hscrollbar.jpg\" rel=\"nofollow noopener\" title=\"http://img2.pict.com/28/69/af/2650781/0/800/hscrollbar.jpg\">http://img2.pict.com/28/69/...</a></p><p>another suggestion is to offer the users a \"Save As/Rename\" option when \"Image Operation (crop/flip/resize/...)\" is used.<br>Most of the time we may want to keep the original image intact! but now we have to make a backup (manually) first, then do the desired editing.<br>Most of the application I know always ask the user how to commit the new changes, \"overwrite\" or \"save as\" into a new document (image) and eliminate such manual backup.</p><p>I can contribute in this fantastic application if you are in short of time for such small modification.</p><p>regards<br>amir</p>","replies":[{"id":"dsq-457712126","author":"Aurélien","deleted":false,"createdAt":"2010-01-27T04:10:03Z","message":"<p>I agree the folder tree lacks an horizontal scrollbar. I just had a look at that part and I now remember I added code to shrink the treeview column to avoid it being wider than necessary. It seems that code also prevents the horizontal scrollbar from appearing.</p><p>The \"Save As/Rename\" situation is a bit nicer now in KDE 4.4: there is a proper \"Rename\" action, and \"Save As\" now brings you to the new document, with a tiny button to go back if necessary.</p><p>Contributers are always welcome, so if you want to have a look at this horizontal scrollbar issue, feel free to do so!</p>","replies":[]}]}]