[{"id":"dsq-2713352634","author":"gm","deleted":false,"createdAt":"2016-06-05T16:54:43Z","message":"<p>Thanks for this update. I downloaded the latest master from github, installed it as user and tried the two examples. I only see a white window. The Converter combobox only shows GitHub Markdown and GitHub Flawored Markdown.</p>","replies":[{"id":"dsq-2713449317","author":"Aurélien Gâteau","deleted":false,"createdAt":"2016-06-05T18:07:45Z","message":"<p>You are missing some optional dependencies to add support for more converters. The GitHub converters only require the Python Requests module because they use GitHub online tools to convert Markdown to HTML. It is strange that the screen stays blank, though, these converters are slow but they should produce some output. Can you try running mup with the -v switch? This will make it more chatty, logging information on the terminal.</p><p>I suggest installing either the Python 3 version of the Markdown module, Pandoc or CommonMark for fast Markdown conversion.</p>","replies":[]}]},{"id":"dsq-2713798086","author":"Andy de Cleyre","deleted":false,"createdAt":"2016-06-05T22:37:50Z","message":"<p>For restructuredtext support you might consider making use of retext's <a href=\"https://github.com/retext-project/pymarkups\" rel=\"nofollow noopener\" title=\"https://github.com/retext-project/pymarkups\">https://github.com/retext-p...</a> , or simply python's docutils (which provides rst2html5, which I think is ready to go as an external converter).</p>","replies":[{"id":"dsq-2714265351","author":"Aurélien Gâteau","deleted":false,"createdAt":"2016-06-06T07:43:36Z","message":"<p>MUP does use the docutils Python module for restructuredtext (though I found a bug in it yesterday evening :/, the fix is in the dev branch for now)</p>","replies":[{"id":"dsq-2714970399","author":"Andy de Cleyre","deleted":false,"createdAt":"2016-06-06T16:49:53Z","message":"<p>That's great, thanks! reST definitely needs more tooling all around, I'm glad to have a reason to check out your tool, and I like the way it's set up to integrate with other software, loosely coupled (converters, editors).</p>","replies":[]}]}]}]
