[{"id":"dsq-997996643","author":"Markus S.","deleted":false,"createdAt":"2013-08-12T22:03:31Z","message":"<p>Great! I find KF5 more important because that will enable the Kontact Suite to get fresh QtQuick2-based UIs, developed from the ground up instead of tweaking the existing ones (which I personally find way more complicated to do).</p>","replies":[{"id":"dsq-1001102817","author":"markg85","deleted":false,"createdAt":"2013-08-14T17:53:24Z","message":"<p>Where did you get that idea from? Specially since i'm working on making the calendar data available in QML. I kinda know how much there is right now and besides the calendar stuff, there isn't much. Sure, there are some projects working somewhat OK.</p><p>But as far as i know, i'm the only one that is really making new QML components available. Those aim to be as abstract as possible so that they can be used wherever one might want to use them.</p><p>In time they could be powerful enough to create a full blown KOrganizer in QML. But that is certainly far away.</p><p>As for more like making KMail in QML or KPeople or any other Kontact part. There are no components that expose any of that data so nobody can make QML based applications for them.</p><p>You're welcome to help :)</p>","replies":[{"id":"dsq-1001449192","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-08-14T21:23:39Z","message":"<p>&gt; As for more like making KMail in QML or KPeople or any other Kontact <br>part. There are no<br>&gt; components that expose any of that data so nobody can<br> make QML based applications<br>&gt; for them.</p><p>What about KMail Mobile?</p>","replies":[]}]}]},{"id":"dsq-1001703233","author":"Eric","deleted":false,"createdAt":"2013-08-15T01:06:22Z","message":"<p>Good evening, I just wanted to mention something quick. :)  Please, for KDE5 can performance not be something fixed as a \"bug\" 6-11 minor revisions down the road like it is now in KDE4?<br>I don't want to encourage premature optimization of course since that is of course bad practice. More of... could you at least profile things as your amazingly helpful team works on KDE5? <br>That would make my year, to finally have a decently fast and resource friendly KDE for daily use.  Of course the Qt containers etc don't let KDE be the smallest thing in the world but it's OK, I would just hope for performance to not be such an afterthought as it seemingly was during all of KDE4's lifecycle which still doesn't live up to reasonable expectation today.<br>Good luck on the project! And I hope my request is reasonable enough to profile KDE5 during development to indeed only get the stuff thats actually impactful and worth dev time.</p>","replies":[{"id":"dsq-1003878226","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-08-16T16:46:38Z","message":"<p>This is not about KDE5, actually there is no KDE5. What people call KDE5 will be Plasma Workspace 2 and... whatever name we decide for the Qt5 version of the rest of KDE Software Compilation 4.</p><p>The work we are doing is about porting  kde*libs* components to Qt5 and splitting kdelibs to make it easier for the rest of the (Qt) world to use parts of it. We are not writing groundbreaking new code, we are \"just\" meticulous reviewing our code base, splitting it into smaller parts, deprecating what needs to be deprecated, upstreaming as much as we can to Qt itself. The amount of brand-new code is quite small, so I do not expect the result of this work to introduce performance regressions.</p>","replies":[]}]}]