[{"id":"dsq-457709656","author":"xdmx","deleted":false,"createdAt":"2008-02-10T02:19:13Z","message":"<p>Very good work with gwenview, i love it.. and i'm still with the kde 3 version :)<br>I've a little wish, if it there isn't already... do you plan to add support for psd files?</p>","replies":[]},{"id":"dsq-457709657","author":"BeCe","deleted":false,"createdAt":"2008-02-10T02:28:43Z","message":"<p>How about changing images with mouse wheel? This is the only thing that keeps me from using new, truly amazing, Gwenview.</p>","replies":[]},{"id":"dsq-457709661","author":"Aurélien","deleted":false,"createdAt":"2008-02-10T02:56:21Z","message":"<p>@xdmx: Gwenview use Qt for image loading. Since Qt image loading is plugin-based, one \"just\" need to write a PSD Qt image plugin and all Qt/KDE apps will be able to load PSD images.</p><p>@BeCe: This will probably come back soon.</p>","replies":[]},{"id":"dsq-457709662","author":"Sebastiano","deleted":false,"createdAt":"2008-02-10T03:19:43Z","message":"<p>great work, keep it up!</p>","replies":[]},{"id":"dsq-457709663","author":"killer1987","deleted":false,"createdAt":"2008-02-10T03:39:23Z","message":"<p>really great work, gwenview is one of my favourite kde4 apps : )</p><p>Ps= can you restore the kde3 feature to switch between images with the scroll whell?</p><p>thank you for this wonderful program and good work</p><p>Marcello</p>","replies":[]},{"id":"dsq-457709665","author":"killer1987","deleted":false,"createdAt":"2008-02-10T03:41:58Z","message":"<p>i'm sorry, i didn't read comment #2,it seems an other person look forward for that feature : )</p>","replies":[]},{"id":"dsq-457709666","author":"Javier","deleted":false,"createdAt":"2008-02-10T03:43:26Z","message":"<p>Thank you for Gwenview KDE4, I love it!</p>","replies":[]},{"id":"dsq-457709650","author":"xdmx","deleted":false,"createdAt":"2008-02-10T03:55:42Z","message":"<p>@Aurélien</p><p>the problem is that \"just\" :)<br>i have any idea how to write a plugin...and actually, i don't know c/c++ neither, which i think it's needed :(</p>","replies":[]},{"id":"dsq-457709651","author":"Aurélien","deleted":false,"createdAt":"2008-02-10T03:59:44Z","message":"<p>@killer1987: Yes, browsing with mouse wheel looks like a most wanted :-)</p><p>@xdmx: I see your point. What I wanted to say is that this does not have to be done in Gwenview, so maybe someone will come up with such a plugin. I do not have any PSD file myself, so I have little incentive to write a PSD reader. I need to \"choose my battles\"...</p>","replies":[]},{"id":"dsq-457709652","author":"signor_rossi","deleted":false,"createdAt":"2008-02-10T14:51:52Z","message":"<p>I like the new gwenview also very much.<br>Some suggestions for the preview mode though:<br>When resizing the preview split view with the mouse and passing e.g. from 2 columns to 1 column in the left view a lot of unused space can remain on the left when I don't resize exactly to the size of the pictures. Some automatic adjustment would be fine, either moving the separator to the left until the space is used or incrase the size of the preview pictures on the left until the space is used.<br>Then depending on the format (16:10/4:3) of the pictures, the format of the monitor(s) and the location of the toolbar (I like it on the left) someone uses it could be convenient to allow to split the preview mode horizontally.</p><p>Sorry for my convoluted english, it's not my mother tongue.<br>Bye, signor_rossi.</p>","replies":[]},{"id":"dsq-457709654","author":"tjong","deleted":false,"createdAt":"2008-02-11T01:31:04Z","message":"<p>About switching between images with the scroll wheel: my first thought is always that the scroll wheel will scroll the current image, not switching images. It's happened so many times and often there is an old video in the cache which makes Gwenview lock up for a moment - when all I wanted was to scroll the current image.</p><p>Maybe it's just me, or isn't the intuitive behavior to just scroll the image - as in many other applications?</p>","replies":[]},{"id":"dsq-457709655","author":"Aurélien","deleted":false,"createdAt":"2008-02-11T02:38:42Z","message":"<p>@tjong: I agree with you, it's more natural for me to scroll with the mouse wheel. This really is a case where 50% of users expect one behavior while the others expect another behavior.<br>As a result this will be a user option, and default will stay to scrolling.</p>","replies":[]},{"id":"dsq-457709648","author":"mutlu","deleted":false,"createdAt":"2008-03-11T23:57:21Z","message":"<p>Aurelien, could you please inform us about what is happening to WengoPhone? It is short of actually working (uvc, better H232 protocol support, etc.), but it seems noone but you spent any time on it recently. Also, its maintainership has been transferred to a r&amp;d company. What does all this mean?</p><p>Thanks,</p><p>mutlu</p>","replies":[]},{"id":"dsq-457709642","author":"Aurélien","deleted":false,"createdAt":"2008-03-12T00:16:59Z","message":"<p>@mutlu: that's quite offtopic, but I'll answer nevertheless. Since the OpenWengo team got laid off, I am not involved anymore in the WengoPhone project. I know however that the R&amp;D company you are refering to is MBDSYS and that they have been working with Wengo on the WengoPhone since the beginning of the project (the original SIP stack has been implemented by MBDSYS), so I believe the project is in good hands.</p>","replies":[]},{"id":"dsq-457709646","author":"multu","deleted":false,"createdAt":"2008-03-12T06:01:14Z","message":"<p>Thanks for the quick response! And good to hear that development is continuing. :)</p>","replies":[]}]