[{"id":"dsq-457711592","author":"ivar","deleted":false,"createdAt":"2010-12-27T05:43:23Z","message":"<p>Great work!</p>","replies":[]},{"id":"dsq-457711593","author":"charon66","deleted":false,"createdAt":"2010-12-27T05:56:23Z","message":"<p>Good article.<br>I'd add that the first KSnapshoot feels unbalanced: I'd expect something on the right, but I see only empty space.<br>Also there is no explanation on what the checkboxes do; ok the do \"include\" but the explanation should be on the right, so maybe I'd reverse the order of the strings. This way the status of the checkbox gets associated to an action to do or not. IMHO.</p>","replies":[]},{"id":"dsq-457711595","author":"Aaron Seigo","deleted":false,"createdAt":"2010-12-27T06:04:28Z","message":"<p>there are lots of places that checkboxes will always be on the left (e.g. menus). that isn't the point. consistency here is a losing battle because people don't get confused or work slower due to the checkbox location being different in different contexts. what matters is that they are well associated visually.</p><p>the target size can be address in a few different ways: linking a clicked() signal on the text label or by allowing the checkbox widget to grow instead of remain constrained.</p><p>so what is gained by this? well, studies i've read that have done real world experiments show that this is the fastest and most eye-pleasing arrangement possible. here's one such a study:</p><p><a href=\"http://www.uxmatters.com/mt/archives/2006/07/label-placement-in-forms.php\" rel=\"nofollow noopener\" title=\"http://www.uxmatters.com/mt/archives/2006/07/label-placement-in-forms.php\">http://www.uxmatters.com/mt...</a></p><p>obviously putting labels above widgets isn't an option. so keeping a clean central trough between \"what i'm controling\" and \"what i use to control it\" with a consistent left-right orientation is useful.</p><p>with the example of ksnapshot, the mouse checkbox ends up just hanging out there in the middle of nowhere, and this gets increasingly bad with dialogs with a few of these in them.</p><p>for configuration dialogs with a number of checkboxes in them, having everything on the left makes scanning for the features very easy and efficient.</p><p>i don't think this should happen everywhere in the UI, but in form-only UIs like configuration dialogs, i think it makes a lot of sense.</p>","replies":[{"id":"dsq-457711613","author":"Aurélien","deleted":false,"createdAt":"2010-12-27T19:16:02Z","message":"<p>&gt; there are lots of places that checkboxes will always be on the left (e.g. menus). that isn’t the point. <br>I couldn't disagree more. Consistency matters a lot.</p><p>&gt; the target size can be address in a few different ways: linking a clicked() signal on the text label or by allowing the checkbox widget to grow instead of remain constrained.<br>Making description labels clickable would mean items on the left side would suddenly become active whereas before the whole left column was only descriptive. This is bad, surprising and inconsistent. As for allowing the checkbox widget to grow, I don't see how this would look, and I don't think it would work with all styles.</p><p>&gt; so what is gained by this? well, studies i’ve read that have done real world experiments show that this is the fastest and most eye-pleasing arrangement possible. here’s one such a study:<br>&gt; <a href=\"http://www.uxmatters.com/mt/archives/2006/07/label-placement-in-forms.php\" rel=\"nofollow noopener\" title=\"http://www.uxmatters.com/mt/archives/2006/07/label-placement-in-forms.php\">http://www.uxmatters.com/mt...</a></p><p>That's a very interesting article, but it does not prove your point. One of the conclusions it reaches is when one uses a two-column layout, descriptive labels from the left column should be right aligned, which I think is not the subject of the discussion. It does not mention checkboxes at all. The solution the HIG suggests or the one I suggest both support right-aligned descriptive widgets.</p><p>Imagine for a moment that the two \"include\" checkboxes from KSnapshot where mutually exclusive. You would then use radio buttons. Would you also put the description of the radio buttons to the left side? I hope not. The difference here is that usually radio buttons have a separate description label. This is exactly what I am suggesting here. Keep a clickable text on the right of the checkbox and add a descriptive label on the left.</p>","replies":[]}]},{"id":"dsq-457711597","author":"-","deleted":false,"createdAt":"2010-12-27T06:04:51Z","message":"<p>Very good article. I liked the KSnapshot example. Keep posting like this.</p>","replies":[]},{"id":"dsq-457711599","author":"christoph","deleted":false,"createdAt":"2010-12-27T06:39:20Z","message":"<p>Another common error is removing the margin around content of tab pages. Oxygen style hides this problem, but with all other styles it looks bad. For an example, check rekonq \"Network\" configuration dialog pages.</p>","replies":[]},{"id":"dsq-457711601","author":"Dylon","deleted":false,"createdAt":"2010-12-27T07:27:52Z","message":"<p>I think these posts are great!  Please keep them coming.  I have a fairly strong background in computer science and software engineering, but not so much in UI design --- I'm learning a lot from your posts and think you are doing a really nice job.  Knowing even the different perspectives of where to place checkboxes with respect to their labels, as described by both you and Aaron Seigo (in the post above), are helpful.</p><p>Thank you.</p>","replies":[]},{"id":"dsq-457711602","author":"Markus","deleted":false,"createdAt":"2010-12-27T07:33:17Z","message":"<p>Months ago (IIRC before 4.5) I tried to do exactly the same with checkboxes in the config window of the taskbar plasmoid. The problem I encountered was that Qt Creator's Designer was totally braindead (at least back then -- don't know about today). I couldn't get it to align the widgets properly. Maybe it's just me and everybody else has no troubles with Designer. I many other people have the same problems with Designer as I have, I really don't blame them for less than perfect GUIs.<br>After -- no kidding -- an hour or so of fighting Designer over only a tiny window, I at very least could get align all text labels of checkboxes within the window on the same side, reduce wasted window space, and align the widgets to a common center: <a href=\"http://kamikazow.wordpress.com/?attachment_id=70\" rel=\"nofollow noopener\" title=\"http://kamikazow.wordpress.com/?attachment_id=70\">http://kamikazow.wordpress....</a><br>Not that I'm happy with the final result -- I'm just less annoyed when I see the window now...</p>","replies":[{"id":"dsq-457711629","author":"Markus","deleted":false,"createdAt":"2010-12-29T07:51:05Z","message":"<p>Oh, just saw in the SVN log it wasn't me who did that layout. I rearranged it and a while later Aaron center-aligned it (guess I wanted to center it but didn't win against Designer...)</p>","replies":[{"id":"dsq-457712430","author":"Aurélien","deleted":false,"createdAt":"2010-12-29T17:56:24Z","message":"<p>I really dislike the new layout:<br>- it makes inconsistent use of colons (some labels are followed with columns other are not)<br>- it is much less visible that the \"Only when the taskbar is full\" option depends on the grouping combobox<br>- and of course the checkboxes are super small</p>","replies":[]}]}]},{"id":"dsq-457711603","author":"dave","deleted":false,"createdAt":"2010-12-27T09:13:36Z","message":"<p>I like that you are fixing and talking about the user interface problems. Keep up the good work :)</p>","replies":[]},{"id":"dsq-457711609","author":"Victor","deleted":false,"createdAt":"2010-12-27T17:37:25Z","message":"<p>Great work! I hope you will also be consistent as the interface you promote and will finish the work!<br>Good luck and Merry Christmas!</p>","replies":[]},{"id":"dsq-457711614","author":"Naproxeno","deleted":false,"createdAt":"2010-12-27T20:50:53Z","message":"<p>I too am very grateful for these post and for the work you're doing. I think this kind of attention to consistency and polish is sorely needed in KDE software in general. Keep up the good work!</p>","replies":[]},{"id":"dsq-457711615","author":"jamboarder","deleted":false,"createdAt":"2010-12-27T22:06:54Z","message":"<p>Very cool! Thanks sooooo, soooo much for looking at AND blogging about this stuff. Like many others have said, this is definitely an area that KDE could use some welcome effort. It is especially nice to see the tangible ways we can work to improve things.</p><p>It would be cool if we could raise a small team of ui contributors (especially since much of this isn't about coding): Dedicated to finding areas to improve like you've done, blogging about it, and updating the HIG as required. Review requests interested in the UI feedback could include this team on the review request.</p><p>Anyway, thanks much for sharing.</p>","replies":[]},{"id":"dsq-457711616","author":"alex","deleted":false,"createdAt":"2010-12-27T22:09:46Z","message":"<p>cher Aurélien,<br>your work is the one of the winners..!</p>","replies":[]},{"id":"dsq-457711617","author":"thorGT","deleted":false,"createdAt":"2010-12-27T23:00:14Z","message":"<p>Oh my, a great battle between Auerelien and Aaron... let's see who wins, because the issue has been plaguing us for years if not decades. Let's finally fix it and decide on an approach, make it official and fix everything that does not fit. It's time to do that, already. Don't you think? Consistency is good, but peace and agreement between developers is even more important that that.</p>","replies":[]},{"id":"dsq-457711604","author":"[Po]lentino","deleted":false,"createdAt":"2010-12-28T03:05:28Z","message":"<p>Awesome, this post explains perfectly my feelings about my thoughts during these months :)<br>I've also added a review request for a <a href=\"http://reviewboard.kde.org/r/5748/\" rel=\"nofollow noopener\" title=\"veeeeery smaaaal patch\">  (I don't like to commit code belonging to others, even if it's a one-line fix :P)<br>Anyway, great article :)</a></p>","replies":[{"id":"dsq-457711626","author":"Aurélien","deleted":false,"createdAt":"2010-12-29T18:50:05Z","message":"<p>Just approved it!</p>","replies":[]}]},{"id":"dsq-457711618","author":"Aaron Seigo","deleted":false,"createdAt":"2010-12-28T10:51:46Z","message":"<p>&gt; Consistency matters a lot.</p><p>it does, up until the point that the consistency introduces inefficiencies. the point of consistency is to allow predictability and lowering surprise. when it fails to add value in that form, then it's not worth chasing after.</p><p>another example of this is toolbutton order and contents in the file manager versus the file dialog.</p><p>this is very much about \"making sure that usability improvements equate to real world benefit\" versus \"sticking to rules without bending because rules are there for a reason\".</p><p>&gt; Imagine for a moment that the two “include” checkboxes from KSnapshot<br>&gt; where mutually exclusive.</p><p>they aren't, so it's not particularly relevant to the question of checkboxes, as checkboxes aren't radio buttons :)</p><p>&gt; You would then use radio buttons. Would you also put the description of the radio buttons to the<br>&gt; left side?</p><p>no, and here's why: the left is the \"topic\", the right is the control. in radio buttons, the control is in part contextual (so belongs with the radio) but the topic is shared and goes on the left. a checkbox is a \"special\" case where there is only one boolean choice. adding more context is irrelevant, the topic remains on the left.</p><p>if you wish to press for consistency, press for it _within the same interface_ where the topic is on the left and the control is on the right. trying to make things consistent globally resulting in locally inconsistencies seems to miss the point imho.</p><p>i also haven't yet found a person who is confused by the naked checkboxes on the right, though it provides a more visually pleasing layout and is easily scannable. which to me says that this kind of change is one of those \"theoretically better\" changes with no real world benefit, as in \"making the user better at using the interface or more satisfied with how it looks\". (in general terms; aesthetics are variable between individuals, yadda yadda :)</p><p>a pet peeve of mine are theoretically better changes that are devoid of real value. i gave a presentation about 5 years ago at akademy about usability and this was one of the things i presented about. look up \"cargo cults\" on google :)</p>","replies":[{"id":"dsq-457711623","author":"Aurélien","deleted":false,"createdAt":"2010-12-28T19:41:07Z","message":"<p>&gt; this is very much about “making sure that usability improvements equate to real world benefit” versus “sticking to rules without bending because rules are there for a reason”.</p><p>I fail to see how drastically reducing the clickable size of a widget is a real word benefit. I am sure people with difficulties moving a mouse, such as people suffering from fine motor skill disorders dislike this idea as well.</p><p>&gt; no, and here’s why: the left is the “topic”, the right is the control. in radio buttons, the control is in part contextual (so belongs with the radio) but the topic is shared and goes on the left. a checkbox is a “special” case where there is only one boolean choice. adding more context is irrelevant, the topic remains on the left.</p><p>I agree, but I don't see how it goes against my proposal. In my mockup, \"Include:\" is the shared topic,  \"Mouse buttons\" and \"Window decorations\" are part of the control. What's wrong with this?</p><p>&gt; i also haven’t yet found a person who is confused by the naked checkboxes on the right</p><p>You are having an argument with one, and others are commenting on this post.</p>","replies":[]},{"id":"dsq-457711624","author":"jamboarder","deleted":false,"createdAt":"2010-12-29T00:25:28Z","message":"<p>While I'm sure there is a point to be made about taking usability <b>guidelines</b> and making them <b>rules</b>, it is incredibly difficult for me or others to see how the changes here make things worse or, for that matter, contradict anything you are talking about.<br>Obviously, if blindly following a set of guidelines makes for a worse experience then it is entirely appropriate to identify a different solution.  That can hardly be said to be the case here.  However, if in our zeal to highlight what is admittedly a pet-peeve, we make the unfortunate implication that there is little or no value in following <i>some</i> set of guidelines, or providing <i>some</i> UI consistency - which I don't think was you <b>intent</b> - then we end up with a lot of opportunities for improvement like we do today.   <br>We have certainly and unequivocally come a long ways in the UI department in KDE.  But I'm pretty sure there is universal agreement that we can do better, and I'm grateful for articles like this that help us all work towards that improvement.  Thanks Aurélien!</p>","replies":[]}]},{"id":"dsq-457711619","author":"Onkar","deleted":false,"createdAt":"2010-12-28T12:23:40Z","message":"<p>I like these posts about usability. They are useful for anyone trying to make his/her application look good and behave consistently.</p><p>By the way these problems may not be specific to KDE. They may be present in GNOME as well. I would love to see a series about GNOME as well.</p>","replies":[]},{"id":"dsq-457711620","author":"Marco Martin","deleted":false,"createdAt":"2010-12-28T15:35:27Z","message":"<p>About the checkboxes:<br>1) small mouse target: this is an issue, but highlights more what i think is a problem in Qt: i really do think in case of clickable elements the buddy should pass clicks. perhaps not easily implementable and don't think would be accepted upstram since introduces a behavioural change, but would really make sense there<br>2) consistency: depends on what. in the ksnapshot example i see the first version, where i have description:input control for all the elements there, versus having the last two widget with the description swapped for no apparent reason.</p><p>As in general left vs right: is not really an easy topic since in some cases, like this ksnapshot example is easy to semantically group multiple checkboxes: in this case, what we want to include in the screenshot? chose between two items, so it can be interpreted in a way not much different from radio buttons and it is possible to have a more general topic on the left.</p><p>for many other cases, the checkboxes are really stand alone, or grouping with the nearby ones makes a really too big logic stretch, so they lose any similarity with radio buttons and become more similar to other widgets, like lineedits or combo boxes, where is natural to have description: input widget</p>","replies":[{"id":"dsq-457712433","author":"Aurélien","deleted":false,"createdAt":"2010-12-29T18:11:24Z","message":"<blockquote>1) small mouse target: this is an issue, but highlights more what i think is a problem in Qt: i really do think in case of clickable elements the buddy should pass clicks. perhaps not easily implementable and don’t think would be accepted upstram since introduces a behavioural change, but would really make sense there</blockquote><p><br>I disagree: it would make part of the left column active whereas it is only descriptive right now. This would be inconsistent and difficult to discover.</p><p></p><blockquote><br>As in general left vs right: is not really an easy topic since in some cases, like this ksnapshot example is easy to semantically group multiple checkboxes: in this case, what we want to include in the screenshot? chose between two items, so it can be interpreted in a way not much different from radio buttons and it is possible to have a more general topic on the left.</blockquote><p><br>You get it, in this case the checkboxes can be grouped, just like one would do with radio buttons.</p><p></p><blockquote>for many other cases, the checkboxes are really stand alone, or grouping with the nearby ones makes a really too big logic stretch, so they lose any similarity with radio buttons and become more similar to other widgets, like lineedits or combo boxes, where is natural to have description: input widget</blockquote><p><br>In these cases you can either:</p><p>- Be creative and come up with a descriptive label. For example, this is what I did in Gwenview configuration dialog: <a href=\"http://simplest-image-hosting.net/jpg-0-plasmoidviewerc30475\" rel=\"nofollow noopener\" title=\"http://simplest-image-hosting.net/jpg-0-plasmoidviewerc30475\">http://simplest-image-hosti...</a><br>- Follow KDE HIG and use a generic label for your checkbox, something like \"On\" or \"Enabled\".</p><p>If you really want checkboxes to work without labels you should do something similar to the UISwitch control provided by iOS: <a href=\"http://developer.apple.com/library/ios/documentation/UserExperience/Conceptual/MobileHIG/UIElementGuidelines/UIElementGuidelines.html#//apple_ref/doc/uid/TP40006556-CH13-SW14\" rel=\"nofollow noopener\" title=\"http://developer.apple.com/library/ios/documentation/UserExperience/Conceptual/MobileHIG/UIElementGuidelines/UIElementGuidelines.html#//apple_ref/doc/uid/TP40006556-CH13-SW14\">http://developer.apple.com/...</a> or use two horizontally-aligned radio buttons</p>","replies":[{"id":"dsq-457712677","author":"Gres","deleted":false,"createdAt":"2010-12-30T05:11:01Z","message":"<p>I think that your solution for what you did in Gwenview is nice.</p>","replies":[]}]}]},{"id":"dsq-457711627","author":"Markus","deleted":false,"createdAt":"2010-12-29T07:45:08Z","message":"<blockquote>Small mouse target: in a normal checkbox, both the box and its text are clickable. With reversed checkboxes there is only a box, so you get a much smaller mouse target.</blockquote><p></p><p>Even though Qt Designer drove me nuts, I remember seeing an option to configure where to put the text label: Left or right.<br>In the task bar config window didn't use the feature, though. I tried but Designer's auto-aligning was so bad, it simply didn't even work.<br>Hmmm...maybe I'll retry with the current Designer release. Maybe it works now....</p>","replies":[{"id":"dsq-457712432","author":"Aurélien","deleted":false,"createdAt":"2010-12-29T16:52:21Z","message":"<p>I assume you refer to turning the widget in left-to-right mode. That would be wrong as it would force the direction regardless of the system direction. It would also not help much here since the label would still be in the right column.</p>","replies":[]}]},{"id":"dsq-457711633","author":"teprrr","deleted":false,"createdAt":"2011-01-03T20:08:54Z","message":"<p>Thanks a lot for the nice work and this series of blog posts you've been doing, I do really enjoy reading them and seeing the changes in action.</p><p>Just wanted to hop in and say that removal of the borders (in this case with documentMode) fixes really annoying usability problem when applications are run in maximized mode. Basically you can not just drag your mouse to the edge of the screen and use the wheel to scroll around because of that border.</p><p>So everyone who is using the QTabWidget layouted to the edge of the window, please switch it on. :-)</p>","replies":[]},{"id":"dsq-457711630","author":"Nicolas Ternisien","deleted":false,"createdAt":"2011-01-04T19:08:32Z","message":"<p>Congrats' Julien for such modifications, it's really annoying to see these little simple-to-fix things everywhere in KDE.</p>","replies":[{"id":"dsq-457711635","author":"Aurélien","deleted":false,"createdAt":"2011-01-05T02:41:34Z","message":"<p>Thanks, but... mmm... my first name is Aurélien :)</p>","replies":[]}]},{"id":"dsq-457711636","author":"jk","deleted":false,"createdAt":"2011-01-17T21:28:24Z","message":"<p>What about this? <a href=\"http://simplest-image-hosting.net/png-0-sysset\" rel=\"nofollow noopener\" title=\"http://simplest-image-hosting.net/png-0-sysset\">http://simplest-image-hosti...</a><br>Let's think about small screens..<br>It would be great if KDE would set up a group of specialist to polish these UI consistencies methodically, application after application..</p>","replies":[{"id":"dsq-457712437","author":"Aurélien","deleted":false,"createdAt":"2011-01-18T02:36:02Z","message":"<p>I agree, it's quite a waste of space.</p>","replies":[]}]}]