[{"id":"dsq-457709957","author":"Andreas","deleted":false,"createdAt":"2008-09-26T21:07:42Z","message":"<p>I have my doubts that it's a good idea to add sundry image editing to a viewer like Gwenview. It is a viewer after all. Rotating seems to make sense because, from experience, on needs to rotate images all the time and also while viewing. Anything else, not so much.<br>It's a bit stupid that I only comment when I don't like something, so don't be put off. I still like Gwenview :)</p>","replies":[]},{"id":"dsq-457709950","author":"teezee","deleted":false,"createdAt":"2008-09-26T21:26:43Z","message":"<p>niiiiiiiceeee!</p><p>But go for smart recognition please, its so much more comfortable. And integrate it somewhere easier accessible.</p>","replies":[]},{"id":"dsq-457709956","author":"Aurélien","deleted":false,"createdAt":"2008-09-26T21:37:45Z","message":"<p>@Andreas: The idea is to make very basic picture manipulation options accessible. You can still use it as a viewer, it won't get in the way.</p><p>@Teezee: Smart recognition may happen later, I have other stuff to implement before feature freeze :). As for making it more accessible, it's also accessible from the sidebar, but I hid it in the screencast to accomodate with the limited video resolution.</p>","replies":[]},{"id":"dsq-457709949","author":"Tyler","deleted":false,"createdAt":"2008-09-27T01:43:05Z","message":"<p>The feature itself may be useful, it avoids to open the gimp.<br>Picasa has a function for correcting red eyes, so having it in gwenview too is cool.</p>","replies":[]},{"id":"dsq-457709946","author":"Skaz!","deleted":false,"createdAt":"2008-09-27T06:45:59Z","message":"<p>I personnaly think thats a real great idea, keep going this way !</p>","replies":[]},{"id":"dsq-457709947","author":"kwilliam","deleted":false,"createdAt":"2008-09-27T08:08:28Z","message":"<p>The title got me excited but the video is a disappointment. Why not re-use Digikam's red-eye removal algorithm? It's a much easier in my experience. Although, what we REALLY need it to get Google to open source Picasa's red eye removal tool, which is truly amazing!!</p>","replies":[]},{"id":"dsq-457709943","author":"kwilliam","deleted":false,"createdAt":"2008-09-27T08:24:56Z","message":"<p>Btw, KDE4 Gwenview is REALLY AMAZING!! I love it. Used it for cropping some photos and rotating, and the slideshow mode is awesome - it's just a great program now! It was OK in KDE3, but it's really useful in KDE4 - I use it instead of Digikam for simple things now.</p>","replies":[]},{"id":"dsq-457709938","author":"Aurélien","deleted":false,"createdAt":"2008-09-27T14:13:59Z","message":"<p>@kwilliam: you are right, I am going to check Digikam algorithm.</p>","replies":[]},{"id":"dsq-457709940","author":"TheGrudge","deleted":false,"createdAt":"2008-09-27T17:48:29Z","message":"<p>There will (maybe) be a kipi-plugin that can batch remove red-eyes in photos, right now I'm porting it to KDE4 and improve it a little bit.</p><p>Here is a video showing the KDE3 version in action (inside of digiKam):</p><p><a href=\"http://videos.the-grudge.net/redeye_removal.ogv\" rel=\"nofollow noopener\" title=\"http://videos.the-grudge.net/redeye_removal.ogv\">http://videos.the-grudge.ne...</a></p><p>The main problem is speed, I think the detection works quite well already.</p><p>Andi Clemens</p>","replies":[]},{"id":"dsq-457709959","author":"DiamondDrake","deleted":false,"createdAt":"2009-12-24T00:41:20Z","message":"<p>If you would, could you point me to which plugin you used? I have been working on red-eye reduction past couple of days, doing it manually, but I am having a lot of trouble, there isn't much information out there, I can't seem to get any good results. As the results here look great. I am working no a free ware quick image editing package aimed at getting images ready to be mailed, resizing them, and mailing them automatically.</p>","replies":[]}]