[{"id":"dsq-457709499","author":"Alex","deleted":false,"createdAt":"2007-10-31T03:29:30Z","message":"<p>A similar dish helped me get through two summers living on my own.  Definitely geek and student friendly.</p><p>Also, the word you are looking for is \"pour\", not \"poor\".</p>","replies":[]},{"id":"dsq-457709501","author":"Matija \"hook\" Šuklje","deleted":false,"createdAt":"2007-10-31T03:30:12Z","message":"<p>On the KDE Planet so often we get to see recipes ...do you guys happen to use KRecipes and would perhaps make or use a KRecipes recipe exchange server (maybe using KGHNS)?</p>","replies":[]},{"id":"dsq-457709503","author":"Thomas","deleted":false,"createdAt":"2007-10-31T03:39:53Z","message":"<p>Looks nice though I think I'd prefer to cook the rice in the rice cooker and not buy it in a glass.</p><p>Oh and I guess you mean \"pour\" and not \"poor\".</p>","replies":[]},{"id":"dsq-457709505","author":"Aurélien","deleted":false,"createdAt":"2007-10-31T04:03:11Z","message":"<p>Fixed the \"poor\" mistake, thanks.</p><p>@Thomas: the \"glass\" of rice is just my handy way of getting the right amount of rice for two plates, I do not buy rice in glasses either :-).</p>","replies":[]},{"id":"dsq-457709506","author":"Aurélien","deleted":false,"createdAt":"2007-10-31T04:05:42Z","message":"<p>@Matija: I am afraid I don't cook often enough to make use of KRecipes. I showed it to my wife though, but she likes her hardcopy cookbooks better.</p>","replies":[]},{"id":"dsq-457709508","author":"everettattebury","deleted":false,"createdAt":"2007-10-31T04:32:22Z","message":"<p>Perhaps you meant \"cup\" instead of \"glass\"?  A cup is 8 ounces, and is the measure usually given in recipes.</p>","replies":[]},{"id":"dsq-457709509","author":"Aurélien","deleted":false,"createdAt":"2007-10-31T12:11:00Z","message":"<p>@everettattebury: \"cups\" sounds good. I replaced \"glass\" with it, thanks!</p>","replies":[]},{"id":"dsq-457709512","author":"Chani","deleted":false,"createdAt":"2007-11-01T07:29:23Z","message":"<p>\"in a casserole\"? I never knew the dish a casserole is cooked in is also called a casserole. :) interesting.</p><p>also, there are a few recipes sitting in a box back in canada that I'd have with me right now if I'd used KRecipe. doh.</p>","replies":[]},{"id":"dsq-457709513","author":"Aurélien","deleted":false,"createdAt":"2007-11-01T16:42:33Z","message":"<p>@Chani: At least in France, a \"casserole\" is a dish. Maybe I should have used \"sauce pan\". Would it be more appropriate?</p>","replies":[]},{"id":"dsq-457709515","author":"Darkstar","deleted":false,"createdAt":"2007-11-03T21:03:10Z","message":"<p>I'd probably simply use \"pot\" instead of \"casserole\", but I'm no native English speaker either.</p><p>BTW, wouldn't it be really cool if every KDE (core-)developer offered one or two of his favorite recipes for inclusion into KRecipes, so that when KDE4 launches, we will have some nice recipes from all over the world?</p><p>For example, I'd really love to know what Aaron likes to cook ;-)</p><p>--Darkstar</p>","replies":[]},{"id":"dsq-457709516","author":"Aurélien","deleted":false,"createdAt":"2007-11-04T19:30:05Z","message":"<p>@Darkstar: I am not sure about \"pot\", according to wordreference it means \"cannabis\". And I can assure you there is no cannabis involved in this recipe :-)</p><p>I like the KDE dev recipes idea, you should suggest it to KRecipes developers!</p>","replies":[]}]