[{"id":"dsq-1101040983","author":"Open Source Tea Partier","deleted":false,"createdAt":"2013-10-29T16:50:10Z","message":"<p>I like neither Canonical's CLA nor Qt's and therefore I contribute to neither project. However IMO Qt's is less bad because A) there is the KDE Free Qt Foundation, B) Trolltech/Nokia/Digia has always been honest about the reason for the CLA: It's about selling proprietary licenses (Canonical denies the same to this day), and C) I have yet to see Qt's leaders insult Qt CLA critics as Shuttleworth recently did with \"Open Source Tea Party\".</p>","replies":[{"id":"dsq-1101493749","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-10-29T22:25:39Z","message":"<p>A) I don't think that matters much, see my answer to Aaron</p><p>B) The CLA says you grant Canonical the right to sublicense your contribution. I have always interpreted this as \"we may include your contributions in proprietary offers\"</p><p>C) I am not going to find excuses for what Mark Shuttleworth wrote, I felt insulted by it as well. But I think how we deal with this accident should be kept separated from opinions on topics like the CLA.</p>","replies":[{"id":"dsq-1102138615","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-10-30T13:10:10Z","message":"<p>Actually I have something to say regarding C). There is no excuse to what Mark wrote, but one could say he did considerably less harm to Qt overall than former Nokia CEO. After all, Mark decided to use QML for Ubuntu Touch, and aims at shipping phones running it, whereas Elop pretty much killed the one Nokia was preparing.</p>","replies":[]},{"id":"dsq-1103428359","author":"TheBlackCat13","deleted":false,"createdAt":"2013-10-31T11:03:33Z","message":"<p>Regarding C, I don't think you can call a press release like that an \"accident\", Mark deliberately wrote that, then stood by it.  It is also only one in a series of such comments.  Just trying to dismiss it as an \"accident\" is not going to improve the situation.</p>","replies":[{"id":"dsq-1103542532","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-10-31T13:20:38Z","message":"<p>If you go that way, then I don't think you can call a blog post a \"press release\". But OK, \"accident\" may not be the most appropriate word.</p>","replies":[{"id":"dsq-1103566869","author":"Martin Gräßlin (OSTP)","deleted":false,"createdAt":"2013-10-31T13:43:52Z","message":"<p>it was a press release as it was the place where he announced the name for Ubuntu 14.04 thus ensuring that the post gets read. Maybe it's not considered as a \"press release\" by Mark, but it is a press release by communicating about the future of Ubuntu *shrug*</p>","replies":[{"id":"dsq-1103662269","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-10-31T15:05:15Z","message":"<p>The code name is for developers and enthusiasts, it is never used as part of Canonical official communication.</p><p>This is a press release: <a href=\"http://www.canonical.com/content/latest-ubuntu-1310-includes-first-step-mobile-pc-convergence\" rel=\"nofollow noopener\" title=\"http://www.canonical.com/content/latest-ubuntu-1310-includes-first-step-mobile-pc-convergence\">http://www.canonical.com/co...</a></p><p>This is a post on the personal blog of a well-known individual: <a href=\"http://www.markshuttleworth.com/archives/1295\" rel=\"nofollow noopener\" title=\"http://www.markshuttleworth.com/archives/1295\">http://www.markshuttleworth...</a></p><p>Note that I am not trying to find any excuse for what Mark said, I fully agree it was a low blow, insulting, and uncalled for.</p>","replies":[]}]}]}]}]},{"id":"dsq-1102380046","author":"Jo-Erlend Schinstad","deleted":false,"createdAt":"2013-10-30T16:22:00Z","message":"<p>What if Canonical doesn't intend to sell proprietary licenses? You make it sound like intending to sell proprietary licenses is somehow more honest than sticking to the FOSS model.</p>","replies":[]},{"id":"dsq-1105208960","author":"Robert Collins","deleted":false,"createdAt":"2013-11-01T17:59:39Z","message":"<p>So the proprietary aspect seems no worse than ApacheV2 to me - if one is ok contributing to ApacheV2 projects, one is granting all users of those projects roughly the same capability. What troubles me is that Canonical asks for this right on projects that are typically [A]GPL - this is asymmetric. I'd happily sublicence my contributions to the owner of an Apache licensed project in that fashion, but I'm not keen on creating asymmetric situations.</p>","replies":[]}]},{"id":"dsq-1101042106","author":"davidedmundson","deleted":false,"createdAt":"2013-10-29T16:51:03Z","message":"<p>I also signed the CLA and I have never worked for Canonical.</p><p>My interpretation of it was; \"we did 90% of the work for this project, we'd like to use your commits, but don't want to lose the possibility to dual license for profit\". Given most of the work was theirs that seemed reasonably fair.</p><p>I could still use my lovely GPL code, if things ever turned nasty I still have access to the GPL version and could fork.</p><p>I've had discussions since with the CLA naysayers, and the situations they come up with in which the CLA could be a problem seem incredibly contrived.</p>","replies":[]},{"id":"dsq-1101057722","author":"Aaron Seigo","deleted":false,"createdAt":"2013-10-29T17:03:08Z","message":"<p>There are still at least three outstanding problems with Canonical's CLA, of which you note 1 of them:</p><p>1. it gives Canonical the right to release your contributions under a proprietary license; unlike the Digia CLA (which I haven't signed, btw) there is no additional agreement like the FreeQt Foundation that gives some level of safety. For those of us who care about our code being openly available, this matters.</p><p>2. When reading a contract, you need to expand all the terms that are defined. You note that it just covers things you submit to Canonical. Well, what does \"submit\" mean? The CLA says:</p><p>\"“Submit” means any form of electronic, verbal, or written communication sent to Us or our representatives, including but not limited to electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, Us for the purpose of discussing and improving the Material, but excluding communication that is conspicuously marked or otherwise designated in writing by You as “Not a Contribution.”</p><p>Who are the representatives? What about a mailing list managed 'on behalf of' (which is already somewhat ambiguous) Canonical? This definition is frankly so absurdly broad, it is just crazy.</p><p>3. Having no termination clause; you mention this but brush it aside. Given points 1 and 2, not having a termination clause is really a Pandora's Box. It means that no matter how Canonical evolves in future, you've committed to them forever, even though that commitment is to the Canonical of today (or whenever you signed it).</p><p>Canonical's CLA is written to give maximal control to Canonical, and as such it is a very good piece of lawyering.</p><p>The FSF's CLA is outmoded relative to the FSFE's FLA imho, but at least it provides a guarantee to Free software licensing.</p><p>I respect that you are OK with signing Canonical's CLA, and more so that you won't trojan other people's code into repos under that.</p><p>What I find dishonorable in your post is to equate people with valid legal issues with the CLA with 'haters'. You may think that technical matters trump legal matters, but many of us use Free software even when it is inferior to other products in some way because of the licensing. It has nothing to do with hate or or not liking Canonical. I know you wish to be treated with respect, so please show equal measure to others.</p>","replies":[{"id":"dsq-1101479543","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-10-29T22:12:51Z","message":"<p>1) To me the FreeQt foundation mattered a lot back when Qt was GPL and some classes were only available in the proprietary versions, because if Trolltech were to go out of business, then it would have precluded anyone from building proprietary software with Qt. Now that all of Qt is LGPL, I don't see what the FreeQt foundation brings: if Digia goes out of business, we would still be able to work with Qt and those who wish to could still create proprietary software using Qt. Canonical libraries are LGPL so they provide the same level of safety.</p><p>2) Regarding mailing lists: if you send a patch to a mailing list for a CLA-governed project, don't you expect your patch to get included?</p><p>3) I may have expressed myself ambiguously: I do not consider people who have issues with the CLA as 'haters'. What I meant to say is that the CLA provides another argument to haters to avoid having to  judge a product on its technical merit.</p>","replies":[{"id":"dsq-1101894854","author":"Martin Gräßlin (OSTP)","deleted":false,"createdAt":"2013-10-30T07:03:28Z","message":"<p>&gt; What I meant to say is that the CLA provides another argument to haters <br>to avoid having to  judge a product on its technical merit.</p><p>I think you are doing people injustice here. For me this is an important technical argument. I'm not willing to sign the CLA (see my other comments), thus I have to consider that I cannot even fix a simple bug when using the technology. The advantages on technical merits have to be huge to outweight this disadvantage. And we as KDE should know what we are talking about. Remember the qt-patches we used to have in our qt-copy? We should learn from our mistakes...</p>","replies":[{"id":"dsq-1101961967","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-10-30T09:14:18Z","message":"<p>FreeQt does not provide any more protection, so to be consistent you should not be using Qt at all.</p><p>I don't understand the analogy with qt-copy: it was created back when the Qt source tree was not public so there was no way to get code into Qt before a release. Now Qt source tree is opened and you can contribute to it after you sign Digia CLA, just like you can contribute to a Canonical project after you sign Canonical CLA.</p>","replies":[{"id":"dsq-1102000700","author":"Martin Gräßlin (OSTP)","deleted":false,"createdAt":"2013-10-30T10:31:08Z","message":"<p>Concerning the FreeQt foundation I think we have to agree to disagree. You think it doesn't provide any more protection, I think the opposite. We will both not convince the other of the importance or non-importance of the FreeQt agreement (to be quite clear: I would prefer if the agreement would no longer exist and there were no CLA for Qt in return).</p><p>You don't see the relation to the qt-copy patches? Did you read about what is supposed to be the solution to CLA on Upstart in case Debian switches to it? Right, keeping downstream patches in the Debian package. Exactly the same.</p><p>Also please don't just compare the Digia CLA to the Canonical CLA. The licence in question is also important. E.g. Qt is LGPL, if I contribute to it, I am aware that this will result in proprietary software. After all it's part of the licence choice - the additional part provided to Digia is rather small given that proprieatary software is already possible. Canonical CLA also covers software under GPL. If I contribute to GPL I do want to have the strong copyleft aspect of it. Otherwise I would not contribute to it. The Canonical CLA allows to make it proprietary which is not in my interest if I contribute to GPL based software. I might be willing to sign the Canonical CLA for an LGPL based software, but one gets only the whole or nothing. So for me it would be relevant to contribute to LightDM to get a Wayland backend. I won't do so because it's GPLv3+CLA. The GPL says it should stay free software and I'm totally fine with that. But if I contribute to GPL based software I do want to ensure that it stays free software. I do not want to have it in proprieatary software. If Canonical wants to do that, they should choose a different free software licence. Then the game is open and inbound=outband would be valid again.</p>","replies":[{"id":"dsq-1102054139","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-10-30T11:50:15Z","message":"<p>I haven't read the Upstart discussion, but I wonder how different it is with Qt: if a Debian packager writes a patch for Qt packages but does not want to sign Digia CLA, then the patch must be kept downstream as well.</p><p>You make a valid point regarding GPLv3 + CLA: while I personally don't mind if the code gets used in a proprietary way since it would still exist as free software, I can see how others can be put off by that aspect.</p>","replies":[{"id":"dsq-1102156726","author":"Martin Gräßlin (OSTP)","deleted":false,"createdAt":"2013-10-30T13:27:48Z","message":"<p>Right, with Qt that's the same (and they used to do that with qt-copy patches). But the chances that they need to patch Qt are lower. In the upstart discussion it's important as upstart (neither systemd) doesn't fulfil Debian's requirment for Hurd and BSD. So they know already that they have to patch it to a certain degree if they would want to go that way.</p>","replies":[]}]}]}]},{"id":"dsq-1102210269","author":"Jo-Erlend Schinstad","deleted":false,"createdAt":"2013-10-30T14:16:37Z","message":"<p>«thus I have to consider that I cannot even fix a simple bug when using the technology.»</p><p>That is a false claim. You have every possibility to fix the bug and to release your fix. You just can't expect Canonical to maintain it. That's a completely different matter. For instance, Intel's X-driver is open, but Intel refuses to accept Canonical's fixes. That only means that Canonical has to maintain a fork. They're still able to fix the driver, even if Intel won't maintain the fix.</p>","replies":[]}]}]},{"id":"dsq-1101505063","author":"Georg Grabler","deleted":false,"createdAt":"2013-10-29T22:36:09Z","message":"<p>I a little bit dislike this patent part as well... what does mean if i come to know? What about if I just didn't read the mail (i'm taggin important persons, rest can be deleted without being read). Did I know that or not? Technically, they could argue that I've put the mail status on \"read\" and archived it. But seriously, I don't read hundreds of mailing list mails a day, since that would take me hours.</p>","replies":[]},{"id":"dsq-1102013005","author":"davidedmundson","deleted":false,"createdAt":"2013-10-30T10:52:41Z","message":"<p>&gt;1. it gives Canonical the right to release your contributions under a proprietary license; unlike the Digia CLA (which I haven't signed, btw) there is no additional agreement like the FreeQt Foundation that gives some level of safety. <br>&gt;For those of us who care about our code being openly available, this matters.</p><p>But the open code doesn't go away. I don't understand how from an open source perspective the ability for one company to fork a closed version with your code makes it any worse than contributing to a BSD licensed project. Any code you contribute is still also open.</p><p>Personally, I find it \"dishonourable\" that you basically accuse Aurelien, me, and many many others of not caring about our code being open. We've clearly all dedicated a large chunk of our lives to work on open source because we care about it.</p>","replies":[]}]},{"id":"dsq-1101058739","author":"Martin Gräßlin (OSTP)","deleted":false,"createdAt":"2013-10-29T17:03:53Z","message":"<p>I think there is one major difference between the Qt and the Ubuntu CLA: Qt is also covered by the Free-Qt Foundation. I have signed the Qt CLA and have so far only contributed to parts which are covered by the Free-Qt Foundation and will never contribute to parts not covered by it. What's most important about it is that Digia cannot just fork Qt into a closed source project. My understanding of the Ubuntu CLA is that Canonical is allowed to do so. I might be wrong in this aspect, I do not fully understand the agreement - I would need a lawyer to explain it to me which is another reason to not sign it.</p><p>Another difference between those two is that Digia right now has a closed source business model around Qt which helps me to understand why it needs those rights. I cannot say the same about Canonical, though.</p><p>Also we have to combine the license with the GPL. For Qt it's a rather free LGPL, so even if Digia would close it down the license would still be quite useful. I cannot say the same for some of the GPLv3-only projects by Canonical.</p><p>Overall I just can say what I always say when it comes to the discussion: the comparison doesn't work as each CLA is different and the whole situation is way more complex than going down to say \"if you sign one CLA, you can sign all\".</p>","replies":[{"id":"dsq-1101068356","author":"Martin Gräßlin (OSTP)","deleted":false,"createdAt":"2013-10-29T17:10:50Z","message":"<p>s/Also we have to combine the license with the GPL/Also we have to combine the license with the CLA/g</p>","replies":[]},{"id":"dsq-1101482590","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-10-29T22:15:30Z","message":"<p>As I wrote above, I don't think the FreeQt foundation matters much in this discussion. I am also not saying \"if you sign one CLA you can sign them all\", what I am saying is that Canonical and Digia CLA are similar enough that people should be comfortable signing both, but that is just my opinion.</p>","replies":[{"id":"dsq-1101893123","author":"Martin Gräßlin (OSTP)","deleted":false,"createdAt":"2013-10-30T06:59:00Z","message":"<p>and I disagree in that matter. I would not have signed the Digia CLA if there was not the Free Qt Foundation agreement. I'm against CLA in general and the Free Qt Foundation agreement is what makes it acceptable to me. That's why I think it cannot be compared.</p>","replies":[{"id":"dsq-1101923430","author":"mzanetti","deleted":false,"createdAt":"2013-10-30T07:55:38Z","message":"<p>I respect your opinion on CLAs in general. However, as explained in another comment I really don't understand what the Free Qt Foundation agreement changes in that matter. Can you elaborate on that?</p>","replies":[]}]}]}]},{"id":"dsq-1101068417","author":"biohazara","deleted":false,"createdAt":"2013-10-29T17:10:52Z","message":"<p>This may be an ignorant question, but isn't there a possibility for people to donate code to Canonical? If Canonical accepted the donation, then the donated code would be CLAed, if not, it would remain attributed to the donator. This would avoid people asking you to lie.</p>","replies":[{"id":"dsq-1101495898","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-10-29T22:27:38Z","message":"<p>I have no idea if this is possible.</p>","replies":[{"id":"dsq-1102245418","author":"Jo-Erlend Schinstad","deleted":false,"createdAt":"2013-10-30T14:45:23Z","message":"<p>It should be sufficient to license the patch under CC0 and attaching it to a bug?</p>","replies":[]}]}]},{"id":"dsq-1101090712","author":"mzanetti","deleted":false,"createdAt":"2013-10-29T17:27:37Z","message":"<p>Reading the comments I'm actually curious: I didn't read the whole KDE Free Qt Foundation license agreement, but basically it states that if Digia (actually it says still Nokia) should ever stop developing Qt, KDE has the right to continue developing and distributing it. Now, I can see how this was useful back in the days when Qt was licensed under the QPL, but nowadays where Qt is true free software I don't really get the point of if. Wouldn't you be allowed to fork it at any time and do the same anyways?</p>","replies":[{"id":"dsq-1101163940","author":"CuteBoy","deleted":false,"createdAt":"2013-10-29T18:17:16Z","message":"<p><a href=\"http://www.kde.org/community/whatiskde/kdefreeqtfoundation.php\" rel=\"nofollow noopener\" title=\"http://www.kde.org/community/whatiskde/kdefreeqtfoundation.php\">http://www.kde.org/communit...</a> has in the first paragraph a summary that answers your questions.</p>","replies":[{"id":"dsq-1101174962","author":"mzanetti","deleted":false,"createdAt":"2013-10-29T18:22:07Z","message":"<p>I read that before. Still it's not very clear to me what the real advantage is. Is it the BSD style licence? Ok, I guess without that we'd have to stick with GPL and LGPL. Not a real problem in my opinion, unless KDE wants to go closed source which I hardly believe.</p>","replies":[{"id":"dsq-1101326991","author":"Morty","deleted":false,"createdAt":"2013-10-29T20:18:03Z","message":"<p>The BSD is not for KDE to make it closed, it's a simple free-for-all at the core business model of Qt.</p><p>It gives everyone the possibility to take over Qt, hire a bunch of core people away from Digia, market yourself as the future of Qt and undercut Digia on all commercial offerings. </p>","replies":[{"id":"dsq-1101593696","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-10-30T00:01:49Z","message":"<p>So it only matters for people who want to carry on releasing proprietary versions of Qt if Digia were to stop doing it. As mzanetti said, it is not really relevant to KDE and should not be relevant to free software developers either.</p>","replies":[{"id":"dsq-1101924945","author":"TheBlackCat13","deleted":false,"createdAt":"2013-10-30T07:56:58Z","message":"<p>It matters to free software developers because it matters to Digia.  It makes it dangerous for Digia to try to take Qt closed-source since they would lose a lot of their closed-source business customers if they did so.</p><p>If it just left Qt as LPGL, then it wouldn't affect Digia's business model since they would still be the only ones able to offer a closed-source Qt.</p><p>This means that if the software market or legal systems changes and somehow closed-source software becomes more profitable, Canonical could close-source their stack and become the only vendor of the closed-source version, but Digia couldn't.</p>","replies":[{"id":"dsq-1101957403","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-10-30T09:04:17Z","message":"<p>The Free Qt agreement, does not prevent Digia from keeping its own closed-source version of the Qt code. Digia could even start an open-core business with closed-source components built on top of Qt, that is not a problem as long as Digia keeps releasing new free-software versions of Qt.</p>","replies":[{"id":"dsq-1102232209","author":"TheBlackCat13","deleted":false,"createdAt":"2013-10-30T14:33:58Z","message":"<p>Yes, that is the whole point.  The agreement is designed to guarantee that Digia will continue releasing free-software versions of Qt.  Canonical has no such guarantee.</p>","replies":[{"id":"dsq-1102284398","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-10-30T15:09:24Z","message":"<p>True, but they could decide to do minimal-service releases to avoid triggering the Free Qt agreement, while actively developing their closed-source components. Therefore I agree it is indeed a plus, but it's not a strong guarantee the product will remain fully free software.</p>","replies":[{"id":"dsq-1103430245","author":"TheBlackCat13","deleted":false,"createdAt":"2013-10-31T11:06:29Z","message":"<p>No, they can't.  The agreement explicitly prohibits that.</p><p>And it is still far more of a guarantee than Canonical has given.</p>","replies":[{"id":"dsq-1103540446","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-10-31T13:18:32Z","message":"<p>I had to search a bit in the agreement, and indeed you are right (Section 2 in <a href=\"http://www.kde.org/community/whatiskde/images/nokia-agreement-3.jpg\" rel=\"nofollow noopener\" title=\"http://www.kde.org/community/whatiskde/images/nokia-agreement-3.jpg\">http://www.kde.org/communit...</a> ), so I agree it is a stronger guarantee than what I thought. It would not prevent an open-core model though.</p>","replies":[]}]}]}]}]}]}]},{"id":"dsq-1101922338","author":"mzanetti","deleted":false,"createdAt":"2013-10-30T07:52:48Z","message":"<p>Exactly. Everyone can do that. Right now. Straight away. LGPL or GPL. What does the KDE Free Qt Foundation Agreement add on top of that (except the right for KDE to release it under a BSD style license - which is really not what they want anyways I assume)?</p>","replies":[{"id":"dsq-1101948709","author":"Martin Gräßlin (OSTP)","deleted":false,"createdAt":"2013-10-30T08:46:00Z","message":"<p>No, there are things one cannot do with LGPL. E.g. static linking. If some entity having the right to close down the development they would be the only one selling licence exceptions allowing static linking. The FreeQt foundation agreement would allow to destroy this business model by just providing Qt under a licence which allows the same thing as what could be achieved by licence exceptions.</p><p>The important idea behind the agreement is not that the foundation would be allowed to re-licence, but to have a threat to a possible closed-sourced business model to prevent that from ever happening. Let's face it: we do not want to ever execute the rights of the Free Qt Foundation. It's a safe guard for the worst case scenario.</p>","replies":[{"id":"dsq-1101952305","author":"Laszlo Papp","deleted":false,"createdAt":"2013-10-30T08:53:11Z","message":"<p>Please note that Qt has exceptions on top of LGPL, for instance we have been considering static linking for QtSerialPort as such an exception. Not sure if other modules do it. BSD also has downsides, like the contribution does not have to be provided back even for explicit asking which is IMO a more significant problem for KDE than static linking.</p>","replies":[]},{"id":"dsq-1101967175","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-10-30T09:25:13Z","message":"<p>That is a very small difference. I don't think one can create a business-model around static linking.</p>","replies":[{"id":"dsq-1102115991","author":"Laszlo Papp","deleted":false,"createdAt":"2013-10-30T12:45:52Z","message":"<p>I think it is important for KDE to consider LGPL or BSD. If a company, sized as Nokia or any other big multinational, forks a code, and the lot of work never comes back to the community with BSD, that is ... more than unfortunate. :/</p><p>(It is also unfortunate for smaller companies with less resource, for sure)</p><p>That cannot happen with LGPL. History shows that even with LGPL, some of them tried to bypass the publication with DVDs and so forth, but they eventually had to provide it for asking.</p><p>We cannot defend against that part of the BSD license since that is a core principle of it in my understanding (not a lawyer here), but LGPL can be changed (again IMO, IANAL, etc) for static linking with exceptions, and that is why we have been considering it for QtSerialPort.</p><p>Edit: ah, I see you replied to Martin, not me... I am not used to this UI, sorry. That said, I leave my comment here as it may be useful to show my stance about LGPL vs. BSD.</p>","replies":[{"id":"dsq-1102134924","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-10-30T13:06:26Z","message":"<p>I agree you can static-link with BSD but not with LGPL, but I don't understand how it is relevant in this discussion. Do you consider the Free Qt agreement worth it because it would allow you to statically link Qt if Digia goes down?</p>","replies":[{"id":"dsq-1102138948","author":"Laszlo Papp","deleted":false,"createdAt":"2013-10-30T13:10:30Z","message":"<p>mzanetti wrote:</p><p>\"Exactly. Everyone can do that. Right now. Straight away. LGPL or GPL. What does the KDE Free Qt Foundation Agreement add on top of that (except the right for KDE to release it under a BSD style license - which is really not what they want anyways I assume)?\"</p><p>Then, there was some concern about LGPL vs. BSD by Martin. I replied to those comments. Personally, I agree with mzanetti that BSD is not a major addition. From KDE perspective, I even consider it as disadvantageous for the aforementioned reasons unless it is guaranteed in some other way.</p><p>Hence, I personally think that mzanetti's questions are valid. I do not know the answer for them either. I think we would need Martin or Olaf from the foundation to answer this for sure. Perhaps, they may have already received an email with an URL to this blog post...</p>","replies":[]},{"id":"dsq-1103836926","author":"Kevin Krammer","deleted":false,"createdAt":"2013-10-31T17:23:55Z","message":"<p>Just to clarify a misconception: the LGPL does not prevent static linking.</p><p>Static linking makes it more difficult for recipients of the combined software to excerise their rights on the LGPL parts, but unless the program is distributed in violation of the LGPL they can</p>","replies":[{"id":"dsq-1104238460","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-10-31T22:51:53Z","message":"<p>Good point.</p>","replies":[]}]}]}]}]}]}]}]}]}]},{"id":"dsq-1101246166","author":"TheBlackCat13","deleted":false,"createdAt":"2013-10-29T19:13:40Z","message":"<p>The difference is that it becomes BSD-licensed, which means Digia would lose its current advantage with closed-source customers.  Unfortunately at the present time this only applies to the Linux and Android versions, although nowadays the platform-dependent parts are relatively limited.</p>","replies":[{"id":"dsq-1101971977","author":"mzanetti","deleted":false,"createdAt":"2013-10-30T09:35:01Z","message":"<p>Let's walk this through:</p><p>With the KDE Free Qt Foundation Agreement:<br>* Let's assume Digia would stop publishing Qt under [L]GPL starting with Qt6<br>* KDE would take the latest available Qt5 version (an possibly some unreleased but still published commits from master) and release it under the BSD license<br>* Some very few others would start to statically link Qt to their closed source application  (KDE itself wont)<br>* Digia would continue publishing their edition of Qt as closed source.<br>* KDE would continue developing their fork BSD licensed.</p><p>Without the Agreement:<br>* Let's assume Digia would stop publishing Qt under [L]GPL starting with Qt6<br>* KDE would take the latest available Qt5 version and release it under<br> the [L]GPL<br>* Digia would continue publishing their edition of Qt as closed source.<br>* KDE would continue developing their fork [L]GPL licensed.</p><p>Now in practice I would say that even with the Agreement existing, KDE would go for the [L]GPL road, unless the BSD licensed edition is just released in order to harm Digia without thinking about the implications for the rest of the Qt ecosystem.</p><p>While I agree there is a theoretical difference, I still think it's quite far fetched as an argument why Canonical's CLA is so much worse than Qt's one.</p><p>And given that you always have the right to fork a GPL project and make it better than the others, I'm having a hard time to understand why CLAs are so bad at all. The only thing it does is to provide the legal foundation to Canonical/Digia to be able to form a business model around the code they are heavily investing in, while still giving you the code for free and allowing you to contribute and influence the project's direction for your needs.</p>","replies":[{"id":"dsq-1102228436","author":"TheBlackCat13","deleted":false,"createdAt":"2013-10-30T14:31:46Z","message":"<p>\"Digia would continue publishing their edition of Qt as closed source.\"</p><p>Here is the issue: if Digia ever closed-source Qt, then anyone who wanted to could sell closed-source version of Qt based on the BSD version.  Closed-source Qt licenses would essentially become free.  Digia would no longer be able to sell them.  This scenario would be bad for everyone, the whole point is that it provides a threat that essentially says \"if you try to close-source Qt you will go out of business\".</p><p>Canonical has no similar restrictions.  If Canonical thought they could get more money selling closed-source licenses for their stack, they could to that and there would be no one who could compete with them.  Unlike with Qt, no one else could offer closed-source versions of their software.  Their only punishment is losing the support of open-source developers.</p>","replies":[{"id":"dsq-1102284503","author":"mzanetti","deleted":false,"createdAt":"2013-10-30T15:09:26Z","message":"<p>Ok... I see... So its really just about punishing Canonical/Digia/Whomever in case they don't see giving away their stuff for free as a viable business model for the future any more (Note: Noone will take away everything they gave so far, and especially noone will take away the stuff you contributed under CLA).</p><p>Well, if this is true then this is my conclusion from it:</p><p>To me personally it seems a bit odd that the people who think the KDE Free Qt Foundation Agreement this is a good thing, are the same that think CLAs are a bad thing. After this discussion I'm not really a huge supporter of the KDE Free Qt Foundation agreement any more as it has much more potential for abuse and less real practical benefit than the CLAs we're talking about (Even though I don't think KDE would ever make us of it).</p>","replies":[{"id":"dsq-1102342763","author":"Martin Gräßlin (OSTP)","deleted":false,"createdAt":"2013-10-30T15:53:20Z","message":"<p>I think you see it wrong. The idea AFAIU is to create a threat to prevent them from going the close source only way. It's a way to ensure that whoever owns the right on Qt is encouraged to continue developing Qt. The idea is to never execute these rights.</p><p>And there is another aspect to it which is not about \"punishing\". Consider the owner of Qt would decide to no longer make a business with Qt that is just stop development of both commercial and free version. The rights of the foundation would allow to setup an entity which could continue the development in the same way as before including the right to relicence in case that LGPL is not the best solution in future.</p>","replies":[]},{"id":"dsq-1103431801","author":"TheBlackCat13","deleted":false,"createdAt":"2013-10-31T11:08:52Z","message":"<p>What potential for abuse?  And it is a CLA plus an agreement, how could it be worse than a CLA alone?</p>","replies":[]}]}]}]}]}]},{"id":"dsq-1101124403","author":"Robert Ancell","deleted":false,"createdAt":"2013-10-29T17:52:56Z","message":"<p>Nice writeup!</p>","replies":[]},{"id":"dsq-1101515115","author":"keithzg","deleted":false,"createdAt":"2013-10-29T22:45:28Z","message":"<p>Ermm. When you say \"It is actually much less demanding than FSF requirements to either assign your copyright to them, or place your contribution under the public domain\" that's quite misleading of an oversimplification. There are several things to keep in mind:</p><p>(1) The FSF assignment guarantees that the assigned works will remain Free Software. That means if a person is worried about their contributions being turned into proprietary software, they do not have to worry about that with the FSF, but do with Canonical. So in that circumstance, the FSF requirements are definitely less demanding (they only demand you license it over to them as Free Software, not demand that you give them the ability to chose to relicense it).</p><p>(2) Not all FSF software requires assigning copyright to them! As is stated in fact in one of the documents you linked to, \"GNU packages need not be FSF-copyrighted; this is up to the author(s), generally at the time the package is dubbed GNU. When copyright is assigned to the FSF, the FSF can act to stop GPL violations about the package. Otherwise, legal actions are up to the author(s).\"</p><p>(There are other points, but those are just the two that occur to me off the top of my head, and IANAL either!)</p><p>I get what you're trying to do, and I'm all for harmony and understanding. But please, don't misrepresent what others do in an attempt to paint a different light on Canonical's CLA; you do your argument an ironic disservice when in trying to clarify and clear up misunderstandings and oversimplifications of Canonical's CLA you do the same to others . . .</p>","replies":[{"id":"dsq-1101590213","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-10-29T23:57:54Z","message":"<p>1) What I meant is that you give up more control on your contributions when agreeing to transfer your code to the FSF than when signing Canonical CLA. I agree one of the reasons Canonical and Qt CLAs exist is to allow proprietary licensing, which is highly unlikely to happen to code transferred to the FSF. But this  is only due to our trust in the FSF to keep the code free: as far as I know, there is no legal barrier preventing an FSF-gone-mad to re-license its code under a proprietary license.</p><p>2) Not all *GNU* software requires assigning copyright, but all software *owned by the FSF* do.</p>","replies":[{"id":"dsq-1101595632","author":"keithzg","deleted":false,"createdAt":"2013-10-30T00:04:04Z","message":"<p>1) Au contraire. Part of the CLA is explicitly prohibiting some crazy FSF-gone-mad from relicensing the code under a proprietary license. There's some meta-language in the agreement defining Free Software, but again, IANAL so I can't easily explain how it works; but yes, the FSF *can't* relicense code assigned to it under a proprietary license.</p><p>2) Umm, sure, yes, that is entirely true. But that's a post-hoc definition, and you yourself were linking to two GNU docs, and didn't make the distinction in your original post. And this takes on a very different tenor considering 1.</p>","replies":[{"id":"dsq-1101966158","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-10-30T09:23:06Z","message":"<p>1) Do you have an URL for this? I can't find it on the FSF site.</p><p>2) I made a small update to make this distinction clearer.</p>","replies":[{"id":"dsq-1102395976","author":"keithzg","deleted":false,"createdAt":"2013-10-30T16:34:27Z","message":"<p>I don't have a good text link, sadly, but John Sullivan (current FSF executive director) gave a talk at FOSDEM 2013, and he goes into the FSF/GNU CLA details starting at about 14min in (with Bradley Kuhn chiming in a bit) at <a href=\"http://faif.us/cast/2013/oct/17/0x43/\" rel=\"nofollow noopener\" title=\"http://faif.us/cast/2013/oct/17/0x43/\">http://faif.us/cast/2013/oc...</a> (slowly turns into talk of compliance efforts).</p>","replies":[]}]}]}]}]},{"id":"dsq-1101800498","author":"Scott K","deleted":false,"createdAt":"2013-10-30T04:29:26Z","message":"<p>It is a simple fact that the Canonical CLA contributes significantly to the perception that many people have that Canonical is trying to separate itself from the rest of the free software community.  I get the theory behind it (I don't agree with it, but I understand it), but on a practical basis it just isn't working.  It is a substantial barrier to Canonical projects being adopted outside Ubuntu.</p><p>It doesn't matter if it should be or not, it is.  It came up in the KDE discussion about a replacement for KDM and it's a factor right now in the Debian discussion about future init systems.  Even if Canonical is not actively trying to separate itself from the rest of the community (and I don't think they are), the effect of the CLA is very much in that direction.  Whatever it's theoretical purpose, the only practical achievement is to block contributions.</p>","replies":[{"id":"dsq-1101956270","author":"Aurélien Gâteau","deleted":false,"createdAt":"2013-10-30T09:01:45Z","message":"<p>This is sadly true.</p>","replies":[]},{"id":"dsq-1102169892","author":"Jo-Erlend Schinstad","deleted":false,"createdAt":"2013-10-30T13:40:25Z","message":"<p>But Fedora does the same, and nobody is criticizing them for it? In order to contribute to Fedora, you have to give RedHat all rights to that software. In fact it's quite common to have CLAs in open projects, but I've never seen anyone complain about that until Canonical did it. And that seems to be because of some kind of theory that Canonical is preparing to make Ubuntu a proprietary operating system, which seems to be just a made up story.</p><p>So if I understand correctly, any project that originates in Fedora, will be owned by RedHat and they will therefore not be bound by any licenses, allowing them to make that project into proprietary software if they wanted to. Only what is shared under a Free Software license will be protected against that. Isn't this the exact same situation as with Canonicals projects? The moment Canonical releases something under GPL3, that version is protected even if they could still choose not to release future versions.</p>","replies":[{"id":"dsq-1102206364","author":"Martin Gräßlin (OSTP)","deleted":false,"createdAt":"2013-10-30T14:13:08Z","message":"<p>I think you have outdated information. I just checked, because I have never heard of it, and I cannot find anything about having to give rights to RedHat. For reference: <a href=\"https://fedoraproject.org/wiki/Legal:Fedora_Project_Contributor_Agreement\" rel=\"nofollow noopener\" title=\"https://fedoraproject.org/wiki/Legal:Fedora_Project_Contributor_Agreement\">https://fedoraproject.org/w...</a></p>","replies":[{"id":"dsq-1102356629","author":"Jo-Erlend Schinstad","deleted":false,"createdAt":"2013-10-30T16:03:45Z","message":"<p>You're right, the old CLA has been obsoleted: <a href=\"https://fedoraproject.org/wiki/Legal:Licenses/CLA?rd=Legal/Licenses/CLA\" rel=\"nofollow noopener\" title=\"https://fedoraproject.org/wiki/Legal:Licenses/CLA?rd=Legal/Licenses/CLA\">https://fedoraproject.org/w...</a></p>","replies":[]}]}]}]},{"id":"dsq-1105060103","author":"Havian #5","deleted":false,"createdAt":"2013-11-01T16:15:48Z","message":"<p>The problem with the CLAs is one of exclusive rights. The GPL+CLA gives certain exclusives to one party, the \"owner\", that other parties, the contributors to the project, don't receive in exchange.</p><p>A leveled playing field.</p><p>Let's look at the Linux kernel. It doesn't belong to one person or corporation. Nobody has exclusive rights to it. It's a leveled playing field. Since everyone has the same rights and the same obligations. Everyone contributes to it.</p><p>Let's look at a GPL+CLA project. The \"owner\" of the project require a license from the contributor to do whatever the \"owner\" wants but the contributor doesn't receives the same from the \"owner\". It's no longer a leveled playing field. No one contributes to the project.</p><p>Projects like the Linux kernel thrive with different owners from different companies or individuals. While projects with CLAs remain all their existence with one owner until they die or are sold out.</p><p>The CLAs are all about compromises. They were never popular, but now, even the one from FSF is being questioned.</p><p>The ones from the Apache Foundation or the FSF are harmless since neither of them wants or expects commercial gain. They act as custodians. They don't compete with other reusers of the software.</p><p>Canonical on the other hand is not a custodian of the code. It's an interested party and acts a competitor to other parties, but still expects the other parties to give them a competitive advantage over them when they contribute. Of course no one wants to contribute on these terms.</p><p>Canonical doesn't want or cares about contributions. They just want to stop others from having a leveled playing. They show bad behaviour. They benefit from the hard working of the other players, that for their part played fair, while at the same time they want exclusive rights for themselves.</p><p>It also sad to see that Ubuntu functions like a cult. People that work or have worked for Canonical are blind to Canonical's behaviour. They're always finding excluses, most of them lame, while at the same attacking everyone that criticizes them. Including sending in attack dogs, that do nothing but throw insults, to <a href=\"http://LWN.net\" rel=\"nofollow noopener\" title=\"LWN.net\">LWN.net</a> or the developers and users' personal blogs.</p>","replies":[]}]