[{"id":"dsq-457709999","author":"xdmx","deleted":false,"createdAt":"2008-10-29T20:12:54Z","message":"<p>great job!</p>","replies":[]},{"id":"dsq-457710003","author":"Louis","deleted":false,"createdAt":"2008-10-29T20:20:05Z","message":"<p>Wow.  Gwenview looks great and has awesome features.  I've never actually rated my pictures, but this looks easy enough to make me start doing it.</p>","replies":[]},{"id":"dsq-457710004","author":"Damnshock","deleted":false,"createdAt":"2008-10-29T20:28:14Z","message":"<p>First of all: great job :)</p><p>Once said that... the question: is this digikam compatible? (maybe I shoud ask digikam devs if it's using nepomuk, right?</p><p>Damnshock</p>","replies":[]},{"id":"dsq-457710012","author":"Luis","deleted":false,"createdAt":"2008-10-29T20:29:38Z","message":"<p>This is very cool. Finally I will be able to search my photos by comments or tags.</p>","replies":[]},{"id":"dsq-457710017","author":"Troy Unrau","deleted":false,"createdAt":"2008-10-29T20:46:22Z","message":"<p>Thanks :) I'm already growing to love rating things from within applications (amarok), so having this be ubiquitous is wonderful.</p>","replies":[]},{"id":"dsq-457710019","author":"Raul","deleted":false,"createdAt":"2008-10-29T20:51:43Z","message":"<p>Is there a way to filter by tags, or maybe browse virtual folders? that would be pretty interesting.</p><p>In an unrelated question, is there a way to easily rename a picture in gwenview? in the KDE3 version I only had to hit F2 and type the new name, but I haven't find that option in the KDE4 version yet.</p>","replies":[]},{"id":"dsq-457710023","author":"Hendrik","deleted":false,"createdAt":"2008-10-29T20:57:52Z","message":"<p>I really miss a folder-navigation together with a preview in gwenview/kde4, and the possibility to disable folders in the main-thumbnail-view. would it be possible to implement an optional panel with such functionality like in gwenview/kde3?</p>","replies":[]},{"id":"dsq-457710024","author":"Shyru","deleted":false,"createdAt":"2008-10-29T21:01:10Z","message":"<p>Well done!<br>One question though: Does Gwenview always display thumbnails pixelated like this? I mean not using a bilinear/smooth resize for the thumbs? I find it looks quite ugly and misrepresents the original image quality.<br>Is it an option?</p>","replies":[]},{"id":"dsq-457710026","author":"albert","deleted":false,"createdAt":"2008-10-29T21:20:40Z","message":"<p>nice I hope that ubuntu will provide nepomuk with sesam2 for 09.4 to be able to test this kind of feature.</p>","replies":[]},{"id":"dsq-457710027","author":"albert","deleted":false,"createdAt":"2008-10-29T21:28:12Z","message":"<p>Oh stupid question. I would like to know if the notation system through nepomuk will be share with digikam? That will be great to have this in common and naturally to not have to redo the same things two times.</p>","replies":[]},{"id":"dsq-457710029","author":"digiK","deleted":false,"createdAt":"2008-10-29T21:36:30Z","message":"<p>Gret job! What about digikam? Are the ratings and more so the tags compatible? It would be silly if you had to use double ratings!</p><p>Keep up the great work!</p>","replies":[]},{"id":"dsq-457710030","author":"Dread Knight","deleted":false,"createdAt":"2008-10-29T21:38:21Z","message":"<p>\\m/ Awesome!</p>","replies":[]},{"id":"dsq-457710031","author":"Andre","deleted":false,"createdAt":"2008-10-29T21:51:56Z","message":"<p>Perhaps you could make the tagging of more obvious use for users who don't know what to do with tagging. You could make an input box called \"Who's on the picture', and let users search for that specific attribute.</p>","replies":[]},{"id":"dsq-457710032","author":"Johannes Simon","deleted":false,"createdAt":"2008-10-29T22:24:19Z","message":"<p>Nepomuk is one of the reasons I think KDE 4 has a high potential for becoming the best desktop environment out there. Great work! :)</p>","replies":[]},{"id":"dsq-457710036","author":"furester","deleted":false,"createdAt":"2008-10-29T22:33:13Z","message":"<p>this ratings is also visible in dolphin?</p>","replies":[]},{"id":"dsq-457710037","author":"Mark Kretschmann","deleted":false,"createdAt":"2008-10-29T22:54:37Z","message":"<p>Aurélien, I'd be happy if I could simply sort images by different criteria, like sorting by date. I just can't find this in Gwenview (trunk).</p><p>Am I missing something?</p>","replies":[]},{"id":"dsq-457710040","author":"slacky","deleted":false,"createdAt":"2008-10-29T22:56:39Z","message":"<p>it would be nice to select only picture with one star - because these pictures should - for instance - be removed.</p>","replies":[]},{"id":"dsq-457710041","author":"Aurélien","deleted":false,"createdAt":"2008-10-30T01:35:33Z","message":"<p>@several of you: ratings are not shared with Digikam ratings. They are shared with Dolphin and all Nepomuk aware applications. I guess Digikam devs will either migrate to Nepomuk or (more likely), ensure that ratings set in Digikam get replicated in Nepomuk.</p><p>@raul: it's already possible to filter by tag, but the ui is too ugly to post a screenshot right now :)</p><p>@slacky: finer filtering is taking shape, it should be there in 4.2</p>","replies":[]},{"id":"dsq-457710042","author":"Mikko","deleted":false,"createdAt":"2008-10-30T22:20:50Z","message":"<p>digiKam does not use Nepomuk for ratings and other infos. It use sqlite database and stores the all photo information to files metadata itself (and own database for faster use), so when moving the file around other software like Lightroom 2 or Photoshop, you have all the same ratings and information. What seems that nepomuk does not allow.</p><p>Gwenview should store all this kind information as XMP to file metadata so it can be readed from digiKam too and Gwenview to use metadata from digiKam for Nepomuk.</p><p>Gwenview is not suitable application to handle my photo collection (now over 75 000 photos), and seems that Nepomuk can not help at all in this case. digiKam seems to be more for professionals and those who use RAW, while Gwenview tries to keep all users happy and then failing on all areas. Gwenview anymore needs a phototouching tools from GIMP or Krita and you would start calling it ultimate image-editor application.</p><p>So mayby the Gwenview should use XMP and other metadata as #1 storing possibility and then use Nepomuk to read those from there. And not trying to replace whole photographing information world with Nepomuk.</p>","replies":[]},{"id":"dsq-457709992","author":"Modar","deleted":false,"createdAt":"2008-11-12T14:38:22Z","message":"<p>Well, well... but where is the navigation panel?<br>How I can move the thumbnail panel to left / right side of the screen?</p>","replies":[]},{"id":"dsq-457709989","author":"linleno","deleted":false,"createdAt":"2008-11-19T12:58:23Z","message":"<p>I miss folder-navigation too...  lol</p>","replies":[]},{"id":"dsq-457709998","author":"Vladimir","deleted":false,"createdAt":"2008-12-04T19:53:06Z","message":"<p># Tags (more on this in another article)</p><p>Can \"another article\" words be a link to that article?</p>","replies":[]},{"id":"dsq-457710045","author":"dmitry","deleted":false,"createdAt":"2009-05-01T23:55:02Z","message":"<p>Please, please, please, note the comment somebody left here about renaming: \"in the KDE3 version I only had to hit F2 and type the new name, but I haven’t find that option in the KDE4 version yet\". This lack of F2-renaming possibility is really a serious drawback, and it must be so easy to implement.</p><p>And I also would like to side with another comment here: \"I really miss a folder-navigation together with a preview in gwenview/kde4, and the possibility to disable folders in the main-thumbnail-view. would it be possible to implement an optional panel with such functionality like in gwenview/kde3?\"</p><p>All the best</p>","replies":[]},{"id":"dsq-457710046","author":"Aavo","deleted":false,"createdAt":"2009-05-25T09:42:11Z","message":"<p>I would also like to see the rename function back. I was using it quite often when scanning in a number of documents and later renaming them while viewing the results.</p>","replies":[]}]
